[
  {
    "id": 1,
    "name": "Bermuda Dunes Country Club",
    "description": "The Bermuda Dunes Country Club in Dunes, CA, is a prestigious and serene gated community offering luxurious living with scenic golf course views, upscale amenities, and a tranquil desert lifestyle, featuring beautifully landscaped properties, exclusive recreational facilities, and a welcoming atmosphere for residents to enjoy a high standard of living, including a championship golf course, tennis courts, swimming pools, and access to nature trails, all within a prime location for those seeking peace and luxury.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20240713183426745497000000-o.jpg",
    "features": [
      "Historic golf course",
      "Diverse residences",
      "Active social scene"
    ],
    "location": "Bermuda Dunes, CA",
    "coordinates": {
      "latitude": 33.7489,
      "longitude": -116.2861
    },
    "keywords": [
      "Bermuda Dunes Country Club homes for sale",
      "Living in Bermuda Dunes Country Club",
      "Golf communities in Bermuda Dunes"
    ],
    "slug": "bermuda-dunes-country-club"
  },
  {
    "id": 2,
    "name": "Bellissimo at Bermuda Dunes Country Club",
    "description": "Bellissimo, a private enclave within the guard-gated Bermuda Dunes Country Club in Bermuda Dunes, CA, offers luxury single-family homes built between 2002 and 2004, ranging from 1,744 to 2,607 square feet with 2 to 4 bedrooms, situated on average 8,590 square foot lots, featuring amenities such as a 27-hole golf course, community pools, and spas, with HOA fees of $593 per month, providing residents with a secure and upscale living experience in the heart of the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20240301032150274199000000-o.jpg",
    "features": [
      "Modern homes",
      "Access to country club amenities",
      "Elegant architecture"
    ],
    "location": "Bermuda Dunes, CA",
    "coordinates": {
      "latitude": 33.7495,
      "longitude": -116.2855
    },
    "keywords": [
      "Bellissimo homes for sale",
      "Living in Bellissimo Bermuda Dunes",
      "Luxury homes in Bermuda Dunes"
    ],
    "slug": "bellissimo-at-bermuda-dunes-country-club"
  },
  {
    "id": 3,
    "name": "Montego West",
    "description": "Montego West in Bermuda Dunes, CA is a charming, family-friendly community offering a tranquil desert lifestyle with picturesque views, spacious homes, and easy access to local amenities. Nestled in the heart of the Coachella Valley, residents enjoy a serene atmosphere while being close to golf courses, parks, shopping, and dining options. This peaceful oasis combines modern comfort with natural beauty, making it the perfect place to call home for those seeking both relaxation and convenience in Southern California.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20210521012716067765000000-o.jpg",
    "features": [
      "Spacious condos",
      "Community pools and tennis courts",
      "Scenic views"
    ],
    "location": "Bermuda Dunes, CA",
    "coordinates": {
      "latitude": 33.7502,
      "longitude": -116.287
    },
    "keywords": [
      "Montego West condos for sale",
      "Living in Montego West Bermuda Dunes",
      "Condo communities in Bermuda Dunes"
    ],
    "slug": "montego-west"
  },
  {
    "id": 4,
    "name": "Volaré",
    "description": "Volaré in Bermuda Dunes, CA, offers a vibrant and upscale community with luxurious homes, scenic mountain views, and a serene desert atmosphere, providing residents with a blend of modern living and natural beauty, exceptional amenities including golf courses and swimming pools, and a welcoming environment for families, retirees, and professionals seeking tranquility and a high quality of life, all while being just minutes from Palm Springs and the renowned Coachella Valley.",
    "photo": null,
    "features": [
      "Modern single-story homes",
      "Private pools and spas",
      "Gated community"
    ],
    "location": "Bermuda Dunes, CA",
    "coordinates": {
      "latitude": 33.748,
      "longitude": -116.275
    },
    "keywords": [
      "Volaré homes for sale",
      "Living in Volaré Bermuda Dunes",
      "New homes in Bermuda Dunes"
    ],
    "slug": "volar"
  },
  {
    "id": 2,
    "name": "Yorkville",
    "description": "Yorkville in Bermuda Dunes, CA, is a serene and upscale residential community offering a blend of luxury homes and tranquil surroundings, perfect for those seeking a peaceful desert lifestyle. Located near top-rated golf courses, shopping centers, and restaurants, Yorkville provides a prime location for enjoying year-round sunshine and beautiful mountain views. With spacious homes and meticulously maintained landscapes, it offers an ideal environment for families and retirees alike, combining comfort, convenience, and style.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20220428233955569336000000-o.jpg",
    "features": [
      "Spacious lots",
      "Peaceful streets",
      "Proximity to golf"
    ],
    "location": "Bermuda Dunes, CA",
    "coordinates": {
      "latitude": 33.7487,
      "longitude": -116.2779
    },
    "keywords": [
      "Yorkville homes for sale",
      "Living in Yorkville Bermuda Dunes",
      "Family neighborhoods in Bermuda Dunes"
    ],
    "slug": "yorkville"
  },
  {
    "id": 3,
    "name": "BDCC Villas",
    "description": "BDCC Villas in Bermuda Dunes, CA, offers a luxurious, tranquil living experience with spacious homes nestled within a beautiful desert landscape, providing modern amenities, stunning mountain views, and exclusive access to a world-class golf course, creating an ideal environment for relaxation and recreation. The community features meticulously designed villas, abundant green spaces, and a strong sense of privacy, making it the perfect destination for those seeking comfort, sophistication, and a vibrant lifestyle in a serene setting.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20240904184613110353000000-o.jpg",
    "features": [
      "Golf course views",
      "Stylish townhomes",
      "Community pools"
    ],
    "location": "Bermuda Dunes, CA",
    "coordinates": {
      "latitude": 33.7512,
      "longitude": -116.2765
    },
    "keywords": [
      "BDCC Villas homes for sale",
      "Living in BDCC Villas Bermuda Dunes",
      "Condos in Bermuda Dunes"
    ],
    "slug": "bdcc-villas"
  },
  {
    "id": 4,
    "name": "Bellissimo",
    "description": "Bellissimo in Bermuda Dunes, CA is an exclusive, gated real estate community offering luxurious living in a serene desert oasis, featuring custom homes, spacious lots, and panoramic mountain views. With a central location providing easy access to world-class golf courses, fine dining, shopping, and entertainment, Bellissimo offers a perfect blend of privacy and convenience, ideal for those seeking a high-end, peaceful lifestyle in one of California's most sought-after desert destinations.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20240904184613110353000000-o.jpg",
    "features": [
      "Custom-built homes",
      "Gated community",
      "Private pools"
    ],
    "location": "Bermuda Dunes, CA",
    "coordinates": {
      "latitude": 33.7501,
      "longitude": -116.2792
    },
    "keywords": [
      "Bellissimo homes for sale",
      "Living in Bellissimo Bermuda Dunes",
      "Luxury homes in Bermuda Dunes"
    ],
    "slug": "bellissimo"
  },
  {
    "id": 5,
    "name": "Desert Homes",
    "description": "Desert Homes in Bermuda Dunes, CA, offers a tranquil and luxurious living experience nestled in the heart of the Coachella Valley, featuring spacious, desert-inspired residences with breathtaking mountain views, modern amenities, and a welcoming community atmosphere. This serene neighborhood is ideal for those seeking a peaceful retreat while being close to world-class golf courses, shopping, dining, and outdoor activities, making it a perfect blend of comfort and convenience in the desert landscape.",
    "photo": null,
    "features": [
      "Affordable homes",
      "Large yards",
      "Family-friendly"
    ],
    "location": "Bermuda Dunes, CA",
    "coordinates": {
      "latitude": 33.7523,
      "longitude": -116.27344
    },
    "keywords": [
      "Desert Homes for sale",
      "Living in Desert Homes Bermuda Dunes",
      "Family neighborhoods in Bermuda Dunes"
    ],
    "slug": "desert-homes"
  },
  {
    "id": 6,
    "name": "Country Club Estates",
    "description": "Country Club Estates in Bermuda Dunes, CA, is an exclusive, gated community offering luxurious living with spacious homes, scenic views of the golf course, and a peaceful atmosphere, perfect for families and retirees alike. This upscale neighborhood features beautiful landscaping, private amenities, and a close-knit, friendly environment, providing residents with easy access to nearby shops, restaurants, and entertainment options, all while maintaining a serene and secure lifestyle in the heart of the Coachella Valley.",
    "photo": null,
    "features": [
      "Luxurious custom homes",
      "Golf course views",
      "Upscale living"
    ],
    "location": "Bermuda Dunes, CA",
    "coordinates": {
      "latitude": 33.7506,
      "longitude": -116.2757
    },
    "keywords": [
      "Country Club Estates homes for sale",
      "Living in Country Club Estates Bermuda Dunes",
      "Luxury homes in Bermuda Dunes"
    ],
    "slug": "country-club-estates"
  },
  {
    "id": 7,
    "name": "Stone Gate",
    "description": "Stone Gate in Bermuda Dunes, CA, is a tranquil and picturesque residential community offering a mix of luxurious homes, scenic mountain views, and convenient access to local amenities, including golf courses, parks, and shopping centers, all nestled within a peaceful, gated environment that ensures privacy and security while providing a welcoming atmosphere for families, retirees, and professionals alike who seek a serene and active lifestyle in the heart of the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20240620171906038030000000-o.jpg",
    "features": [
      "Elegant homes",
      "Gated community",
      "Quiet atmosphere"
    ],
    "location": "Bermuda Dunes, CA",
    "coordinates": {
      "latitude": 33.748,
      "longitude": -116.2789
    },
    "keywords": [
      "Stone Gate homes for sale",
      "Living in Stone Gate Bermuda Dunes",
      "Gated neighborhoods in Bermuda Dunes"
    ],
    "slug": "stone-gate"
  },
  {
    "id": 8,
    "name": "The Greens",
    "description": "The Greens in Bermuda Dunes, CA is a vibrant and welcoming community offering picturesque views, golf course living, and a serene environment, perfect for those seeking a peaceful retreat with easy access to local amenities, upscale living, and a variety of outdoor activities, making it an ideal destination for families, retirees, and professionals who enjoy a relaxed lifestyle, while being close to the attractions and conveniences of the Coachella Valley and surrounding desert regions.",
    "photo": null,
    "features": [
      "Townhomes and condos",
      "Lush landscaping",
      "Community amenities"
    ],
    "location": "Bermuda Dunes, CA",
    "coordinates": {
      "latitude": 33.7539,
      "longitude": -116.2752
    },
    "keywords": [
      "The Greens homes for sale",
      "Living in The Greens Bermuda Dunes",
      "Affordable homes in Bermuda Dunes"
    ],
    "slug": "the-greens"
  },
  {
    "id": 9,
    "name": "Vista Montana",
    "description": "Vista Montana in Bermuda Dunes, CA, is a distinguished 55+ gated community renowned for its breathtaking mountain vistas, meticulously maintained manufactured homes, and a comprehensive array of amenities including a clubhouse, fitness center, pools, spas, and tennis courts, all situated in close proximity to dining, shopping, and entertainment options, offering residents a vibrant and active lifestyle in the heart of the Coachella Valley.",
    "photo": null,
    "features": [
      "55+ community",
      "Clubhouse and fitness center",
      "Active social calendar"
    ],
    "location": "Bermuda Dunes, CA",
    "coordinates": {
      "latitude": 33.755,
      "longitude": -116.2713
    },
    "keywords": [
      "Vista Montana homes for sale",
      "Living in Vista Montana Bermuda Dunes",
      "55+ communities in Bermuda Dunes"
    ],
    "slug": "vista-montana"
  }
]