[
  {
    "id": 1,
    "name": "Cathedral City Cove",
    "description": "Cathedral City Cove in Cathedral City, CA is a tranquil, scenic community nestled in the foothills of the San Jacinto Mountains, offering residents a peaceful, desert retreat with easy access to outdoor recreation, modern amenities, and stunning views. With charming mid-century homes, a close-knit atmosphere, and proximity to downtown Cathedral City and Palm Springs, this neighborhood is perfect for those seeking a serene lifestyle while still being close to vibrant cultural events, shopping, dining, and entertainment options.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230629211126227553000000-o.jpg",
    "features": [
      "Artistic community",
      "Scenic mountain views",
      "Proximity to downtown"
    ],
    "location": "Cathedral City, CA",
    "coordinates": {
      "latitude": 33.7797,
      "longitude": -116.4653
    },
    "keywords": [
      "Cathedral City Cove homes for sale",
      "Living in Cathedral City Cove",
      "Home prices in Cathedral City Cove"
    ],
    "slug": "cathedral-city-cove"
  },
  {
    "id": 2,
    "name": "Panorama",
    "description": "Panorama in Cathedral City, CA offers a serene and picturesque community with stunning mountain views, spacious homes, and a peaceful atmosphere, making it an ideal location for families and professionals alike. Residents enjoy proximity to local amenities, shopping centers, top-rated schools, and recreational opportunities, with easy access to Palm Springs and the surrounding desert areas, all set in a welcoming environment perfect for those seeking a blend of relaxation and convenience in the heart of the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20231117000640861797000000-o.jpg",
    "features": [
      "Spacious homes",
      "Family-friendly",
      "Nearby amenities"
    ],
    "location": "Cathedral City, CA",
    "coordinates": {
      "latitude": 33.8425,
      "longitude": -116.4668
    },
    "keywords": [
      "Panorama homes for sale",
      "Living in Panorama Cathedral City",
      "Home prices in Panorama"
    ],
    "slug": "panorama"
  },
  {
    "id": 3,
    "name": "Rio Vista",
    "description": "Nestled in the scenic beauty of Cathedral City, CA, Rio Vista is a welcoming real estate community offering a perfect blend of modern living and natural charm, with spacious homes, serene surroundings, and close proximity to amenities, schools, and vibrant local culture. Whether you’re seeking a cozy retreat or a family-friendly neighborhood, Rio Vista promises a peaceful lifestyle in the heart of California's Coachella Valley, offering residents an ideal mix of comfort, convenience, and tranquility.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20231110170334115064000000-o.jpg",
    "features": [
      "Quiet streets",
      "Diverse housing options",
      "Proximity to parks"
    ],
    "location": "Cathedral City, CA",
    "coordinates": {
      "latitude": 33.8331,
      "longitude": -116.4635
    },
    "keywords": [
      "Rio Vista homes for sale",
      "Living in Rio Vista Cathedral City",
      "Home prices in Rio Vista"
    ],
    "slug": "rio-vista"
  },
  {
    "id": 4,
    "name": "Century Park",
    "description": "Century Park in Cathedral City, CA, is a vibrant and family-friendly real estate community offering a blend of modern and classic homes, well-maintained parks, and a welcoming atmosphere. Known for its prime location, it provides convenient access to schools, shopping, dining, and entertainment, making it ideal for families, professionals, and retirees alike. Residents enjoy a serene lifestyle with picturesque views of the surrounding mountains and a strong sense of community in this desirable neighborhood.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230610211150734191000000-o.jpg",
    "features": [
      "Tree-lined streets",
      "Community park",
      "Close to schools"
    ],
    "location": "Cathedral City, CA",
    "coordinates": {
      "latitude": 33.8123,
      "longitude": -116.4645
    },
    "keywords": [
      "Century Park homes for sale",
      "Living in Century Park Cathedral City",
      "Home prices in Century Park"
    ],
    "slug": "century-park"
  },
  {
    "id": 5,
    "name": "Montage at Mission Hills",
    "description": "Montage at Mission Hills in Cathedral City, CA, is a premier gated real estate community offering luxurious single-family homes with sophisticated architectural designs, nestled alongside the prestigious Mission Hills Country Club. This serene neighborhood boasts beautifully landscaped surroundings, access to world-class golf courses, and close proximity to shopping, dining, and entertainment in the Coachella Valley, making it an ideal haven for those seeking an upscale desert lifestyle.",
    "photo": null,
    "features": [
      "Gated community",
      "Luxury homes",
      "Proximity to golf courses"
    ],
    "location": "Cathedral City, CA",
    "coordinates": {
      "latitude": 33.7984,
      "longitude": -116.4417
    },
    "keywords": [
      "Montage at Mission Hills homes for sale",
      "Living in Montage at Mission Hills",
      "Home prices in Montage at Mission Hills"
    ],
    "slug": "montage-at-mission-hills"
  },
  {
    "id": 6,
    "name": "The Canyon",
    "description": "The Canyon in Cathedral City, CA, is a vibrant 55+ gated community offering a blend of serene desert living and active lifestyle amenities, including a clubhouse, pool, fitness center, tennis courts, and social activities, all nestled within beautifully landscaped grounds with stunning mountain views, conveniently located near dining, shopping, and entertainment options, making it an ideal destination for retirees seeking a perfect balance of comfort, community, and convenience in Southern California.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20210828211850125996000000-o.jpg",
    "features": [
      "55+ community",
      "Clubhouse",
      "Peaceful environment"
    ],
    "location": "Cathedral City, CA",
    "coordinates": {
      "latitude": 33.8006,
      "longitude": -116.4564
    },
    "keywords": [
      "The Canyon homes for sale",
      "Living in The Canyon Cathedral City",
      "Home prices in The Canyon"
    ],
    "slug": "the-canyon"
  },
  {
    "id": 7,
    "name": "Landau Manor Homes",
    "description": "Landau Manor Homes in Cathedral City, CA, offers a welcoming community nestled amidst scenic beauty and modern conveniences, featuring a range of beautifully designed residences perfect for families and professionals alike; residents enjoy a tranquil suburban environment with access to lush parks, top-rated schools, shopping, dining, and entertainment options, all while being strategically located near major roadways, ensuring a perfect balance of comfort, lifestyle, and accessibility in Southern California.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20221107191326979769000000-o.jpg",
    "features": [
      "Single-family homes",
      "Spacious yards",
      "Quiet community"
    ],
    "location": "Cathedral City, CA",
    "coordinates": {
      "latitude": 33.8054,
      "longitude": -116.4683
    },
    "keywords": [
      "Landau Manor Homes homes for sale",
      "Living in Landau Manor Cathedral City",
      "Home prices in Landau Manor Homes"
    ],
    "slug": "landau-manor-homes"
  },
  {
    "id": 8,
    "name": "Cathedral Canyon Country Club",
    "description": "Cathedral Canyon Country Club in Cathedral City, CA, is a vibrant real estate community offering a mix of condominiums and single-family homes, surrounded by scenic mountain views and lush golf courses. This gated community boasts resort-style amenities, including pools, tennis courts, and an 18-hole championship golf course, providing a serene yet active lifestyle for residents. Conveniently located near Palm Springs, it offers easy access to dining, shopping, and entertainment in the Coachella Valley area.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20221001163824289859000000-o.jpg",
    "features": [
      "Golf course",
      "Active lifestyle",
      "Community amenities"
    ],
    "location": "Cathedral City, CA",
    "coordinates": {
      "latitude": 33.7993,
      "longitude": -116.4502
    },
    "keywords": [
      "Cathedral Canyon Country Club homes for sale",
      "Living in Cathedral Canyon Country Club",
      "Home prices in Cathedral Canyon Country Club"
    ],
    "slug": "cathedral-canyon-country-club"
  },
  {
    "id": 9,
    "name": "Tapestry",
    "description": "Tapestry in Cathedral City, CA, is a vibrant residential community offering a mix of modern homes, breathtaking mountain views, and a welcoming atmosphere, perfectly suited for families and individuals seeking a serene desert lifestyle. Located conveniently near local amenities, parks, and shopping centers, Tapestry features thoughtfully designed properties with diverse architectural styles and a strong sense of community, making it a premier destination for comfortable and elegant living.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20220201233531955503000000-o.jpg",
    "features": [
      "Modern homes",
      "Contemporary design",
      "Proximity to schools"
    ],
    "location": "Cathedral City, CA",
    "coordinates": {
      "latitude": 33.8157,
      "longitude": -116.4675
    },
    "keywords": [
      "Tapestry homes for sale",
      "Living in Tapestry Cathedral City",
      "Home prices in Tapestry"
    ],
    "slug": "tapestry"
  },
  {
    "id": 10,
    "name": "Rio Del Sol",
    "description": "Rio Del Sol in Cathedral City, CA, is a vibrant and sought-after gated community offering a blend of modern and classic desert living, featuring stunning mountain views, well-maintained landscapes, and a variety of amenities, including pools, spas, and tennis courts, making it an ideal destination for families, retirees, and professionals seeking a tranquil yet active lifestyle in the heart of the Coachella Valley, with close proximity to shopping, dining, and cultural attractions.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20211009140621188681000000-o.jpg",
    "features": [
      "Gated community",
      "Beautiful landscaping",
      "Community pool"
    ],
    "location": "Cathedral City, CA",
    "coordinates": {
      "latitude": 33.7963,
      "longitude": -116.4419
    },
    "keywords": [
      "Rio Del Sol homes for sale",
      "Living in Rio Del Sol Cathedral City",
      "Home prices in Rio Del Sol"
    ],
    "slug": "rio-del-sol"
  },
  {
    "id": 11,
    "name": "Verano",
    "description": "Verano in Cathedral City, CA, is a vibrant and modern real estate community offering a mix of stylish homes, thoughtfully designed landscapes, and exceptional amenities, catering to a diverse range of residents seeking a harmonious blend of contemporary living and natural beauty; this neighborhood boasts convenient access to local attractions, outdoor recreational opportunities, dining, and shopping, making it an ideal destination for families, professionals, and retirees alike.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20210908021509285966000000-o.jpg",
    "features": [
      "Modern homes",
      "Community parks",
      "Family-oriented"
    ],
    "location": "Cathedral City, CA",
    "coordinates": {
      "latitude": 33.8224,
      "longitude": -116.4739
    },
    "keywords": [
      "Verano homes for sale",
      "Living in Verano Cathedral City",
      "Home prices in Verano"
    ],
    "slug": "verano"
  },
  {
    "id": 12,
    "name": "The District at the Edge",
    "description": "The District at the Edge in Cathedral City, CA, is a vibrant and modern real estate community offering a unique blend of contemporary architectural designs, energy-efficient homes, and a welcoming atmosphere; situated in the heart of the Coachella Valley, this community is surrounded by stunning desert landscapes, convenient access to shopping, dining, and entertainment options, and is known for its close-knit neighborhood feel, making it an ideal destination for families, professionals, and retirees alike.",
    "photo": null,
    "features": [
      "Modern design",
      "Private pools",
      "Gated community"
    ],
    "location": "Cathedral City, CA",
    "coordinates": {
      "latitude": 33.7892,
      "longitude": -116.4563
    },
    "keywords": [
      "The District homes for sale",
      "Living in The District Cathedral City",
      "Home prices in The District"
    ],
    "slug": "the-district-at-the-edge"
  },
  {
    "id": 13,
    "name": "La Pasada",
    "description": "La Pasada in Cathedral City, CA, is a picturesque and welcoming real estate community characterized by its tranquil desert ambiance, modern and spacious single-family homes, lushly landscaped streets, and breathtaking mountain views, offering residents a harmonious blend of suburban comfort and natural beauty; conveniently located near local amenities, schools, golf courses, and outdoor recreational areas, La Pasada presents an ideal setting for families and professionals seeking a serene and vibrant lifestyle.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230618194700968224000000-o.jpg",
    "features": [
      "Open floor plans",
      "Spacious homes",
      "Close to parks"
    ],
    "location": "Cathedral City, CA",
    "coordinates": {
      "latitude": 33.8371,
      "longitude": -116.4605
    },
    "keywords": [
      "La Pasada homes for sale",
      "Living in La Pasada Cathedral City",
      "Home prices in La Pasada"
    ],
    "slug": "la-pasada"
  },
  {
    "id": 14,
    "name": "Campanile",
    "description": "Nestled in the heart of Cathedral City, CA, Campanile offers a vibrant, serene community with stunning desert mountain views, modern amenities, and spacious homes perfect for families and individuals alike; enjoy a relaxed lifestyle with nearby parks, shopping, and dining options, along with easy access to major highways and the picturesque Coachella Valley, making it an ideal place to call home for those seeking comfort, convenience, and natural beauty.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230603192159213473000000-o.jpg",
    "features": [
      "Tuscan design",
      "Gated community",
      "Clubhouse and pool"
    ],
    "location": "Cathedral City, CA",
    "coordinates": {
      "latitude": 33.8121,
      "longitude": -116.4712
    },
    "keywords": [
      "Campanile homes for sale",
      "Living in Campanile Cathedral City",
      "Home prices in Campanile"
    ],
    "slug": "campanile"
  },
  {
    "id": 15,
    "name": "Rancho Village",
    "description": "Rancho Village in Cathedral City, CA, is a vibrant and welcoming community offering a blend of modern living and scenic desert landscapes, featuring spacious homes, well-maintained streets, and an abundance of amenities such as parks, recreational facilities, and nearby shopping, dining, and entertainment options, making it an ideal destination for families, retirees, and professionals alike who seek comfort, convenience, and a relaxed desert lifestyle with easy access to major highways and downtown Palm Springs.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20220301000324076530000000-o.jpg",
    "features": [
      "Gated community",
      "Quiet atmosphere",
      "Beautiful landscaping"
    ],
    "location": "Cathedral City, CA",
    "coordinates": {
      "latitude": 33.7998,
      "longitude": -116.4527
    },
    "keywords": [
      "Rancho Village homes for sale",
      "Living in Rancho Village Cathedral City",
      "Home prices in Rancho Village"
    ],
    "slug": "rancho-village"
  },
  {
    "id": 16,
    "name": "Victoria Park",
    "description": "Victoria Park in Cathedral City, CA, offers a vibrant, family-friendly community with a mix of modern homes, beautiful landscaping, and a welcoming atmosphere. Known for its serene surroundings and convenient location, residents enjoy access to nearby shopping, dining, and entertainment options. With close proximity to major highways, excellent schools, and parks, Victoria Park is an ideal place for those seeking a peaceful yet connected lifestyle in the heart of the Coachella Valley.",
    "photo": null,
    "features": [
      "Family-friendly",
      "Large yards",
      "Quiet streets"
    ],
    "location": "Cathedral City, CA",
    "coordinates": {
      "latitude": 33.8356,
      "longitude": -116.4691
    },
    "keywords": [
      "Victoria Park homes for sale",
      "Living in Victoria Park Cathedral City",
      "Home prices in Victoria Park"
    ],
    "slug": "victoria-park"
  },
  {
    "id": 17,
    "name": "Shadow Crest",
    "description": "Shadow Crest in Cathedral City, CA is a vibrant and desirable community offering scenic mountain views, modern homes, and a tranquil environment, ideal for families and professionals. With well-maintained parks, proximity to shopping, dining, and entertainment, as well as easy access to major highways, residents enjoy both convenience and privacy. The neighborhood fosters a strong sense of community, with a range of recreational activities and a commitment to maintaining its peaceful, welcoming atmosphere for all ages.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20210105211608889366000000-o.jpg",
    "features": [
      "Gated community",
      "Desert landscaping",
      "Quiet retreat"
    ],
    "location": "Cathedral City, CA",
    "coordinates": {
      "latitude": 33.7953,
      "longitude": -116.4534
    },
    "keywords": [
      "Shadow Crest homes for sale",
      "Living in Shadow Crest Cathedral City",
      "Home prices in Shadow Crest"
    ],
    "slug": "shadow-crest"
  },
  {
    "id": 18,
    "name": "Rancho Mirage Cove",
    "description": "Nestled in the scenic Rancho Mirage Cove of Cathedral City, CA, this vibrant community offers a blend of luxurious homes, peaceful desert surroundings, and modern amenities, all with stunning views of the San Jacinto Mountains. Perfect for those seeking a tranquil retreat with access to nearby golf courses, upscale shopping, dining, and entertainment, residents enjoy a lifestyle of comfort, convenience, and natural beauty in one of the Coachella Valley's most desirable locations.",
    "photo": null,
    "features": [
      "Upscale living",
      "Nearby country clubs",
      "Luxury amenities"
    ],
    "location": "Cathedral City, CA",
    "coordinates": {
      "latitude": 33.7769,
      "longitude": -116.4203
    },
    "keywords": [
      "Rancho Mirage Cove homes for sale",
      "Living in Rancho Mirage Cove Cathedral City",
      "Home prices in Rancho Mirage Cove"
    ],
    "slug": "rancho-mirage-cove"
  },
  {
    "id": 19,
    "name": "Alicante",
    "description": "Nestled in the heart of Cathedral City, CA, the real estate community offers a vibrant blend of modern living and desert charm, featuring stunning homes with breathtaking mountain views, lush landscapes, and a thriving local culture, making it an ideal location for families, retirees, and investors alike, with easy access to shopping, dining, outdoor activities, and a welcoming neighborhood atmosphere that promises a perfect balance of comfort, convenience, and relaxation in a year-round sunny climate.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230127000152535731000000-o.jpg",
    "features": [
      "Modern homes",
      "Open floor plans",
      "Proximity to parks"
    ],
    "location": "Cathedral City, CA",
    "coordinates": {
      "latitude": 33.8181,
      "longitude": -116.4752
    },
    "keywords": [
      "Alicante homes for sale",
      "Living in Alicante Cathedral City",
      "Home prices in Alicante"
    ],
    "slug": "alicante"
  },
  {
    "id": 20,
    "name": "Rio Vista Village",
    "description": "Rio Vista Village in Cathedral City, CA is a vibrant, welcoming 55+ active adult community offering a peaceful, scenic environment with access to modern amenities, beautifully maintained homes, and an ideal location close to shopping, dining, and outdoor recreational activities. Residents enjoy a tight-knit neighborhood atmosphere with a range of social and recreational opportunities, making it the perfect place to relax, stay active, and engage with fellow residents in a serene desert setting.",
    "photo": null,
    "features": [
      "Family-friendly",
      "Single-family homes",
      "Nearby amenities"
    ],
    "location": "Cathedral City, CA",
    "coordinates": {
      "latitude": 33.8338,
      "longitude": -116.4615
    },
    "keywords": [
      "Rio Vista Village homes for sale",
      "Living in Rio Vista Village Cathedral City",
      "Home prices in Rio Vista Village"
    ],
    "slug": "rio-vista-village"
  },
  {
    "id": 21,
    "name": "Desert Princess Country Club",
    "description": "Desert Princess Country Club in Cathedral City, CA offers a vibrant, gated community featuring beautiful desert landscapes, an 18-hole championship golf course, luxurious homes, resort-style amenities such as tennis courts, a fitness center, a clubhouse, and multiple pools, all surrounded by stunning mountain views. With a welcoming atmosphere, this exclusive community is perfect for those seeking an active lifestyle, a peaceful retreat, and a close-knit environment with access to nearby shopping, dining, and entertainment options.",
    "photo": null,
    "features": [
      "Golf course",
      "Gated community",
      "Resort-style amenities"
    ],
    "location": "Cathedral City, CA",
    "coordinates": {
      "latitude": 33.8104,
      "longitude": -116.4561
    },
    "keywords": [
      "Desert Princess homes for sale",
      "Living in Desert Princess Cathedral City",
      "Home prices in Desert Princess"
    ],
    "slug": "desert-princess-country-club"
  },
  {
    "id": 22,
    "name": "The Cove at Cathedral City",
    "description": "The Cove at Cathedral City is a vibrant, gated community nestled in the heart of Cathedral City, CA, offering a serene desert oasis with stunning mountain views, spacious homes, and a variety of amenities including lush landscaping, a community pool, and recreational areas, all designed to provide a comfortable and modern lifestyle for residents seeking tranquility, privacy, and convenience while being close to shopping, dining, and entertainment options in the Coachella Valley.",
    "photo": null,
    "features": [
      "Custom homes",
      "Panoramic views",
      "Modern designs"
    ],
    "location": "Cathedral City, CA",
    "coordinates": {
      "latitude": 33.7792,
      "longitude": -116.4684
    },
    "keywords": [
      "The Cove homes for sale",
      "Living in The Cove Cathedral City",
      "Home prices in The Cove"
    ],
    "slug": "the-cove-at-cathedral-city"
  },
  {
    "id": 23,
    "name": "Whitewater Neighborhood",
    "description": "The Whitewater Neighborhood in Cathedral City, CA, offers a vibrant and diverse community with a blend of residential options, from cozy single-family homes to modern townhouses, all nestled in a scenic desert landscape with stunning views of the San Jacinto Mountains, close to local parks, top-rated schools, shopping centers, and easy access to major highways, making it an ideal place for families, professionals, and retirees looking for both tranquility and convenience in the heart of the Coachella Valley.",
    "photo": null,
    "features": [
      "Mid-century homes",
      "Affordable living",
      "Charming community"
    ],
    "location": "Cathedral City, CA",
    "coordinates": {
      "latitude": 33.8271,
      "longitude": -116.4679
    },
    "keywords": [
      "Whitewater homes for sale",
      "Living in Whitewater Cathedral City",
      "Home prices in Whitewater"
    ],
    "slug": "whitewater-neighborhood"
  },
  {
    "id": 24,
    "name": "Las Quintas",
    "description": "Las Quintas City in Cathedral City, CA offers a vibrant, family-friendly community with stunning desert views, spacious homes, and a welcoming atmosphere, perfect for those seeking a peaceful yet connected lifestyle, surrounded by beautiful landscapes, convenient access to shopping, dining, and recreational activities, while maintaining a close-knit, secure environment ideal for both relaxation and active living in one of California's most desirable desert cities.",
    "photo": null,
    "features": [
      "Well-maintained homes",
      "Quiet community",
      "Local amenities"
    ],
    "location": "Cathedral City, CA",
    "coordinates": {
      "latitude": 33.8179,
      "longitude": -116.4692
    },
    "keywords": [
      "Las Quintas homes for sale",
      "Living in Las Quintas Cathedral City",
      "Home prices in Las Quintas"
    ],
    "slug": "las-quintas"
  },
  {
    "id": 25,
    "name": "Shadow Mountain",
    "description": "Shadow Mountain in Cathedral City, CA, is a serene and upscale community offering breathtaking views of the San Jacinto Mountains, luxurious homes, lush golf courses, and a variety of amenities including sparkling pools, tennis courts, and scenic walking trails, making it an ideal destination for those seeking a peaceful, active lifestyle in the heart of the Coachella Valley, with convenient access to shopping, dining, and entertainment options in nearby Palm Springs and surrounding areas.",
    "photo": null,
    "features": [
      "Mountain views",
      "Spacious homes",
      "Scenic surroundings"
    ],
    "location": "Cathedral City, CA",
    "coordinates": {
      "latitude": 33.8142,
      "longitude": -116.4715
    },
    "keywords": [
      "Shadow Mountain homes for sale",
      "Living in Shadow Mountain Cathedral City",
      "Home prices in Shadow Mountain"
    ],
    "slug": "shadow-mountain"
  },
  {
    "id": 26,
    "name": "Dream Homes",
    "description": "Dream Homes in Cathedral City, CA offers a vibrant community with luxurious residences, scenic views, and a welcoming atmosphere, combining modern amenities with a prime location for a relaxed, upscale lifestyle. Residents enjoy proximity to shopping, dining, and entertainment, as well as access to beautiful parks and recreational activities. The community features a variety of beautiful homes in a range of styles, making it an ideal place for those seeking both comfort and convenience in the heart of California's Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230213232925187457000000-o.jpg",
    "features": [
      "Affordable homes",
      "Diverse community",
      "First-time buyer friendly"
    ],
    "location": "Cathedral City, CA",
    "coordinates": {
      "latitude": 33.8249,
      "longitude": -116.4713
    },
    "keywords": [
      "Dream Homes homes for sale",
      "Living in Dream Homes Cathedral City",
      "Home prices in Dream Homes"
    ],
    "slug": "dream-homes"
  }
]