[
  {
    "id": 1,
    "name": "Desert Edge",
    "description": "Desert Edge is a serene and picturesque neighborhood located in Desert Hot Springs, CA. Known for its tranquil ambiance and stunning desert landscapes, this community offers a mix of single-family homes, manufactured residences, and spacious lots. Residents of Desert Edge enjoy breathtaking views of the San Bernardino Mountains and the Coachella Valley, making it a haven for nature lovers and those seeking a peaceful retreat.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20210712212941021927000000-o.jpg",
    "features": [
      "Quiet streets",
      "Community-oriented",
      "Clean environment"
    ],
    "location": "Desert Hot Springs, CA",
    "coordinates": {
      "latitude": 33.9595,
      "longitude": -116.5087
    },
    "keywords": [
      "Desert Edge homes for sale",
      "Moving to Desert Edge Desert Hot Springs",
      "Home prices in Desert Edge"
    ],
    "slug": "desert-edge"
  },
  {
    "id": 2,
    "name": "Wardman Heights",
    "description": "Wardman Heights is a central neighborhood in Desert Hot Springs, CA, offering a mix of mid-century modern and contemporary homes. Known for its elevated location, the community provides stunning panoramic views of the Coachella Valley and surrounding mountains. Residents enjoy the atmosphere while being close to local amenities, including shopping, dining, and wellness spas. With its unique architectural appeal and tranquil setting, Wardman Heights is a sought-after destination for those seeking a serene desert lifestyle.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20220103194034220537000000-o.jpg",
    "features": [
      "Hill views",
      "Family-friendly",
      "Walkable neighborhood"
    ],
    "location": "Desert Hot Springs, CA",
    "coordinates": {
      "latitude": 33.9458,
      "longitude": -116.4975
    },
    "keywords": [
      "Wardman Heights homes for sale",
      "Moving to Wardman Heights Desert Hot Springs",
      "Home prices in Wardman Heights"
    ],
    "slug": "wardman-heights"
  },
  {
    "id": 3,
    "name": "Mission Lakes Country Club",
    "description": "Mission Lakes Country Club is a community in Desert Hot Springs, CA, known for its championship golf course and resort-style amenities. The neighborhood offers a mix of single-family homes and condos, many of which feature views of the San Jacinto Mountains and surrounding desert landscapes. Residents enjoy access to a clubhouse, restaurant, tennis courts, and a community pool, creating opportunities for recreation and social activities. Conveniently located near local shops and dining, Mission Lakes Country Club provides a balanced lifestyle in a scenic desert setting.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20201127190409061240000000-o.jpg",
    "features": [
      "Golf course",
      "Clubhouse",
      "Resort amenities"
    ],
    "location": "Desert Hot Springs, CA",
    "coordinates": {
      "latitude": 33.9775,
      "longitude": -116.538
    },
    "keywords": [
      "Mission Lakes Country Club homes for sale",
      "Living in Mission Lakes Country Club",
      "Home prices in Mission Lakes Country Club"
    ],
    "slug": "mission-lakes-country-club"
  },
  {
    "id": 4,
    "name": "Sky Valley Resort",
    "description": "Sky Valley Resort is a gated community in Desert Hot Springs, CA, renowned for its natural hot mineral springs and resort-style amenities. The neighborhood features manufactured homes and RV spaces, offering a unique desert living experience. Residents enjoy access to mineral pools, spas, fitness facilities, and recreational areas, fostering a vibrant and active atmosphere. With its scenic desert surroundings and proximity to hiking trails, Sky Valley Resort appeals to those seeking relaxation and outdoor adventure.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20220216060522941382000000-o.jpg",
    "features": [
      "Natural hot springs",
      "Resort-style living",
      "Spa amenities"
    ],
    "location": "Desert Hot Springs, CA",
    "coordinates": {
      "latitude": 33.9228,
      "longitude": -116.3763
    },
    "keywords": [
      "Sky Valley Resort homes for sale",
      "Moving to Sky Valley Resort",
      "Home prices in Sky Valley Resort"
    ],
    "slug": "sky-valley-resort"
  },
  {
    "id": 5,
    "name": "Hidden Springs Country Club",
    "description": "Hidden Springs Country Club is a gated community in Desert Hot Springs, CA, centered around a 9-hole executive golf course. The neighborhood offers manufactured homes with views of the San Jacinto Mountains and the surrounding desert. Residents enjoy amenities such as a clubhouse, community pool, fitness center, and tennis courts, fostering an active and social lifestyle. Its convenient location provides easy access to local shopping, dining, and recreational opportunities.",
    "photo": "https://lh3.googleusercontent.com/p/AF1QipPyX4wba37PPJ1avGSz1kUlWnGZO73-ARVPdYYC=s680-w680-h510",
    "features": [
      "55+ community",
      "9-hole golf course",
      "Scenic desert views"
    ],
    "location": "Desert Hot Springs, CA",
    "coordinates": {
      "latitude": 33.9414,
      "longitude": -116.5252
    },
    "keywords": [
      "Hidden Springs Country Club homes for sale",
      "Moving to Hidden Springs Country Club",
      "Home prices in Hidden Springs Country Club"
    ],
    "slug": "hidden-springs-country-club"
  },
  {
    "id": 7,
    "name": "Agua Dulce",
    "description": "Agua Dulce is a new-home community in Desert Hot Springs, CA, featuring modern single-family residences managed by a homeowners' association. These newly constructed homes showcase contemporary designs and thoughtful layouts, catering to modern lifestyles. Residents benefit from HOA-managed amenities and the community's convenient location near schools, shopping, and recreational opportunities. Surrounded by stunning desert scenery, Agua Dulce offers a fresh and vibrant living experience.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20210801060036976683000000-o.jpg",
    "features": [
      "Affordable housing",
      "Family-friendly",
      "Proximity to amenities"
    ],
    "location": "Desert Hot Springs, CA",
    "coordinates": {
      "latitude": 33.9378,
      "longitude": -116.4939
    },
    "keywords": [
      "Agua Dulce homes for sale",
      "Living in Agua Dulce Desert Hot Springs",
      "Home prices in Agua Dulce"
    ],
    "slug": "agua-dulce"
  },
  {
    "id": 8,
    "name": "Via El Rancho",
    "description": "Via El Rancho is a neighborhood in Desert Hot Springs, CA, offering spacious lots and stunning views of the desert and surrounding mountains. The area features a mix of single-family homes and open landscapes, providing residents with room to enjoy the natural beauty of the region. Conveniently located near local amenities and recreational opportunities, Via El Rancho combines scenic living with accessibility.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20210702214814464041000000-o.jpg",
    "features": [
      "Spacious lots",
      "Panoramic views",
      "Quiet environment"
    ],
    "location": "Desert Hot Springs, CA",
    "coordinates": {
      "latitude": 33.9315,
      "longitude": -116.4823
    },
    "keywords": [
      "Via El Rancho homes for sale",
      "Living in Via El Rancho Desert Hot Springs",
      "Home prices in Via El Rancho"
    ],
    "slug": "via-el-rancho"
  },
  {
    "id": 9,
    "name": "The Highlands",
    "description": "The Highlands is a hillside community in Desert Hot Springs, CA, offering stunning views of the Coachella Valley and surrounding mountains. Known for its elevated location, this neighborhood features a mix of single-family homes and access to nearby hiking trails. Residents appreciate its proximity to local amenities, making The Highlands a desirable location for enjoying the desert lifestyle.",
    "photo": "https://www.nps.gov/common/uploads/cropped_image/primary/F6C44D55-A002-54C4-DBC235FFDEFCA24B.jpg?width=1600&quality=90&mode=crop",
    "features": [
      "Hillside living",
      "Hiking trails",
      "Stunning views"
    ],
    "location": "Desert Hot Springs, CA",
    "coordinates": {
      "latitude": 33.9501,
      "longitude": -116.5012
    },
    "keywords": [
      "The Highlands homes for sale",
      "Moving to The Highlands Desert Hot Springs",
      "Home prices in The Highlands"
    ],
    "slug": "the-highlands"
  },
  {
    "id": 10,
    "name": "Hacienda anbd Mountain View",
    "description": "Hacienda and Mountain View is a community in Desert Hot Springs, CA, known for its modern homes and scenic mountain views. Featuring properties built in the last decade, the neighborhood offers upgraded interiors with features such as tile flooring, quartz or granite countertops, and stainless steel appliances. Many homes boast spacious backyards, covered patios, and western-facing views of the mountains, perfect for enjoying desert evenings. With no HOA dues, this area provides homeowners with flexibility and affordability, making it an ideal choice for families and first-time buyers seeking a contemporary desert lifestyle.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20230131154148424464000000-o.jpg",
    "features": [
      "Gated 55+ community",
      "Active lifestyle",
      "Clubhouse amenities"
    ],
    "location": "Desert Hot Springs, CA",
    "coordinates": {
      "latitude": 33.9274,
      "longitude": -116.5108
    },
    "keywords": [
      "Hacienda and mountain view homes for sale",
      "Living in Hacienda and mountain view Desert Hot Springs",
      "Home prices in Hacienda and mountain view"
    ],
    "slug": "paradise-springs"
  },
  {
    "id": 13,
    "name": "North Palm Springs",
    "description": "North Palm Springs is a rural area offering a variety of housing options, including single-family homes and manufactured residences. Known for its open landscapes and proximity to the desert’s natural beauty, this community provides opportunities for homeowners seeking larger lots and a quieter environment. Located near major transportation routes, North Palm Springs offers convenient access to surrounding cities and amenities while retaining its unique desert charm.",
    "photo": "https://www.desertsun.com/gcdn/presto/2021/01/08/PPAS/74577b85-7c9c-4e3f-ac9d-30ab266236de-Skyborne_overview__DJI_0063_Raw.jpg?crop=2999,1687,x0,y450",
    "features": [
      "Affordable homes",
      "Diverse community",
      "Convenient location"
    ],
    "location": "Desert Hot Springs, CA",
    "coordinates": {
      "latitude": 33.9226,
      "longitude": -116.5441
    },
    "keywords": [
      "North Palm Springs homes for sale",
      "Living in North Palm Springs",
      "Home prices in North Palm Springs"
    ],
    "slug": "north-palm-springs"
  },
  {
    "id": 14,
    "name": "Sky Haven",
    "description": "Sky Haven is a neighborhood in Desert Hot Springs, CA, offering a mix of single-family homes and manufactured residences. Known for its expansive desert views and accessible location, this community provides a balance of residential living and proximity to local amenities. Residents benefit from the scenic surroundings and the area’s connection to the broader Coachella Valley.",
    "photo": "https://www.desertsun.com/gcdn/presto/2021/05/05/PPAS/019f2209-9f4a-44eb-9ccc-3e4dc3821fea-402dhscondos-2.jpg?width=1733&height=1156&fit=crop&format=pjpg&auto=webp",
    "features": [
      "Expansive views",
      "Quiet living",
      "Desert landscape"
    ],
    "location": "Desert Hot Springs, CA",
    "coordinates": {
      "latitude": 33.9212,
      "longitude": -116.5129
    },
    "keywords": [
      "Sky Haven homes for sale",
      "Living in Sky Haven Desert Hot Springs",
      "Home prices in Sky Haven"
    ],
    "slug": "sky-haven"
  },
  {
    "id": 15,
    "name": "B-Bar-H Ranch",
    "description": "B-Bar-H Ranch is a historic neighborhood in Desert Hot Springs, CA, offering a blend of modern and vintage homes with a distinct ranch-style charm. Known for its spacious lots and open desert views, this community provides a unique living experience that reflects the area's rich history. Conveniently located near local amenities and major transportation routes, B-Bar-H Ranch combines rustic appeal with modern convenience.",
    "photo": "https://www.desertsun.com/gcdn/-mm-/c5fa965c5adc2fe95ff63dff1fe5a26da6c062da/c=0-63-800-513/local/-/media/PalmSprings/2014/02/24/-peterlorreisontherightjaykaslernextinthewagonaremariekasler.jpg?width=1200&disable=upscale&format=pjpg&auto=webp",
    "features": [
      "Rustic charm",
      "Historic homes",
      "Modern updates"
    ],
    "location": "Desert Hot Springs, CA",
    "coordinates": {
      "latitude": 33.9128,
      "longitude": -116.4832
    },
    "keywords": [
      "B-Bar-H Ranch homes for sale",
      "Living in B-Bar-H Ranch Desert Hot Springs",
      "Home prices in B-Bar-H Ranch"
    ],
    "slug": "b-bar-h-ranch"
  },
  {
    "id": 16,
    "name": "Hacienda Heights",
    "description": "Hacienda Heights is a community in Desert Hot Springs, CA, featuring spacious homes with modern designs and scenic mountain views. Known for its quiet streets and convenient location, the neighborhood provides easy access to local schools, shopping, and recreational activities. With its blend of comfort and accessibility, Hacienda Heights offers a welcoming environment for families and homeowners seeking a desert lifestyle.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20220324191805554334000000-o.jpg",
    "features": [
      "Spacious homes",
      "Mountain views",
      "Tranquil environment"
    ],
    "location": "Desert Hot Springs, CA",
    "coordinates": {
      "latitude": 33.9423,
      "longitude": -116.5109
    },
    "keywords": [
      "Hacienda Heights homes for sale",
      "Living in Hacienda Heights Desert Hot Springs",
      "Home prices in Hacienda Heights"
    ],
    "slug": "hacienda-heights"
  }
]