[
  {
    "id": 1,
    "name": "Terra Lago",
    "description": "Terra Lago is a vibrant and picturesque community nestled in the heart of Indio, California, offering stunning views of the surrounding mountains, a serene 20-acre lake, and resort-style amenities, including a championship golf course, clubhouse, pool, fitness center, and scenic walking trails; perfect for families, retirees, or vacationers seeking a peaceful yet activity-filled lifestyle in a safe and well-maintained neighborhood.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20221115000955797683000000-o.jpg",
    "features": [
      "Lakefront homes",
      "Golf course",
      "Clubhouse and amenities"
    ],
    "location": "Indio, CA",
    "coordinates": {
      "latitude": 33.7508,
      "longitude": -116.2104
    },
    "keywords": [
      "Terra Lago homes for sale",
      "Lakefront communities in Indio",
      "Golf course living in Indio"
    ],
    "slug": "terra-lago"
  },
  {
    "id": 2,
    "name": "Shadow Hills",
    "description": "Shadow Hills is a serene residential community nestled in the foothills of Los Angeles, offering a blend of equestrian-friendly properties, spacious single-family homes, and a tranquil rural atmosphere with convenient access to city amenities, making it an ideal haven for those seeking a peaceful lifestyle amidst natural beauty and a strong sense of community.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20221116232258088162000000-o.jpg",
    "features": [
      "Gated community",
      "Serene atmosphere",
      "Spacious homes"
    ],
    "location": "Indio, CA",
    "coordinates": {
      "latitude": 33.7693,
      "longitude": -116.2239
    },
    "keywords": [
      "Shadow Hills homes for sale",
      "Gated communities in Indio",
      "Luxury homes in Indio"
    ],
    "slug": "shadow-hills"
  },
  {
    "id": 3,
    "name": "Sun City Shadow Hills",
    "description": "Sun City Shadow Hills is an active adult community in Indio, California, offering a resort-style lifestyle with world-class amenities, including two championship golf courses, state-of-the-art fitness centers, pools, tennis courts, and vibrant social clubs; nestled in the Coachella Valley's picturesque desert landscape, it features beautifully designed homes with modern conveniences, perfect for retirees and active adults seeking luxurious, community-centered living.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20221018202515597911000000-o.jpg",
    "features": [
      "55+ active adult community",
      "Golf courses and pools",
      "Social and fitness amenities"
    ],
    "location": "Indio, CA",
    "coordinates": {
      "latitude": 33.7674,
      "longitude": -116.2121
    },
    "keywords": [
      "Sun City homes for sale",
      "55+ communities in Indio",
      "Active adult living in Indio"
    ],
    "slug": "sun-city-shadow-hills"
  },
  {
    "id": 4,
    "name": "Indian Palms Country Club",
    "description": "Indian Palms Country Club in Indio, CA, is a vibrant, gated community offering a blend of resort-style living and serene desert charm, featuring a 27-hole championship golf course, diverse real estate options from modern homes to charming condos, and an array of amenities including pools, tennis courts, fitness facilities, and a clubhouse with dining, all set amidst picturesque mountain views and lush landscaping, making it a sought-after destination for active lifestyles and tranquil retreats alike.",
    "photo": "https://boomtown-production-consumer-backup.s3.amazonaws.com/1238/files/2019/04/Indian-Palms-CC-7.jpg",
    "features": [
      "Historic golf community",
      "Clubhouse and pools",
      "Condos and single-family homes"
    ],
    "location": "Indio, CA",
    "coordinates": {
      "latitude": 33.7196,
      "longitude": -116.2304
    },
    "keywords": [
      "Indian Palms homes for sale",
      "Golf course living in Indio",
      "Resort-style communities in Indio"
    ],
    "slug": "indian-palms-country-club"
  },
  {
    "id": 5,
    "name": "Trilogy at The Polo Club",
    "description": "Trilogy at The Polo Club in Indio, CA, is a premier 55+ active adult community offering a vibrant lifestyle with resort-style amenities, including a stunning clubhouse, pools, fitness center, gourmet dining, and a calendar filled with social events and activities. Nestled in the heart of Coachella Valley, this gated community boasts luxurious homes with modern designs, surrounded by scenic desert landscapes, championship golf courses, and convenient access to shopping, dining, and entertainment.",
    "photo": "https://boomtown-production-consumer-backup.s3.amazonaws.com/1238/files/2019/03/trilogy-polo-club-indio-041.jpg",
    "features": [
      "Gated community",
      "Resort-style amenities",
      "Modern homes"
    ],
    "location": "Indio, CA",
    "coordinates": {
      "latitude": 33.6932,
      "longitude": -116.2328
    },
    "keywords": [
      "Trilogy homes for sale",
      "Active adult communities in Indio",
      "Luxury gated neighborhoods in Indio"
    ],
    "slug": "trilogy-at-the-polo-club"
  },
  {
    "id": 6,
    "name": "Montage at Santa Rosa",
    "description": "Montage at Santa Rosa in Indio, CA, is a premier gated community offering luxurious, spacious homes with stunning desert landscapes, exceptional privacy, and resort-style amenities, catering to a lifestyle of relaxation and entertainment; located near world-class golf courses, dining, shopping, and cultural attractions, this vibrant neighborhood blends modern living with the charm of the Coachella Valley, making it a perfect destination for families, retirees, and vacation homeowners.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20220608200150513026000000-o.jpg",
    "features": [
      "Family-friendly",
      "Spacious homes",
      "Close to local attractions"
    ],
    "location": "Indio, CA",
    "coordinates": {
      "latitude": 33.6914,
      "longitude": -116.2172
    },
    "keywords": [
      "Montage homes for sale",
      "Family neighborhoods in Indio",
      "Spacious homes in Indio"
    ],
    "slug": "montage-at-santa-rosa"
  },
  {
    "id": 7,
    "name": "Desert Collection",
    "description": "Desert Collection in Indio, CA, is a vibrant and inviting real estate community offering a blend of modern homes and tranquil desert charm, conveniently located near premier golf courses, shopping centers, and outdoor recreational opportunities, making it ideal for families, retirees, and professionals seeking a relaxed lifestyle with a touch of sophistication in the heart of the Coachella Valley, complete with scenic views, friendly neighbors, and a strong sense of community.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20230228013347709417000000-o.jpg",
    "features": [
      "Gated community",
      "Modern homes",
      "Community amenities"
    ],
    "location": "Indio, CA",
    "coordinates": {
      "latitude": 33.7512,
      "longitude": -116.2118
    },
    "keywords": [
      "Desert Collection homes for sale",
      "Gated neighborhoods in Indio",
      "Modern homes in Indio"
    ],
    "slug": "desert-collection"
  },
  {
    "id": 8,
    "name": "Foxstone",
    "description": "Foxstone in Indio, CA, is a vibrant gated community offering a serene residential environment characterized by well-maintained landscapes, spacious single-family homes, and a welcoming neighborhood atmosphere, making it an ideal choice for families, professionals, and retirees seeking modern conveniences and a close-knit lifestyle; located near schools, shopping, dining, and recreational opportunities, this community blends tranquility with easy access to Indio's rich cultural and entertainment offerings.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20240327211123977431000000-o.jpg",
    "features": [
      "Family-friendly",
      "Well-maintained homes",
      "Proximity to schools and parks"
    ],
    "location": "Indio, CA",
    "coordinates": {
      "latitude": 33.7501,
      "longitude": -116.2134
    },
    "keywords": [
      "Foxstone homes for sale",
      "Family neighborhoods in Indio",
      "Suburban living in Indio"
    ],
    "slug": "foxstone"
  },
  {
    "id": 9,
    "name": "Talavera",
    "description": "Talavera, a gated community in Indio, CA, offers a blend of modern comfort and family-friendly living, featuring spacious homes with contemporary designs, lush landscaping, and scenic views of the surrounding desert and mountains; conveniently located near top-rated schools, shopping, dining, and outdoor recreational activities, Talavera provides a safe and welcoming environment for residents seeking tranquility, community spirit, and access to the vibrant lifestyle of the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20220719000941574445000000-o.jpg",
    "features": [
      "Family-friendly",
      "Gated community",
      "Parks and playgrounds"
    ],
    "location": "Indio, CA",
    "coordinates": {
      "latitude": 33.7505,
      "longitude": -116.2007
    },
    "keywords": [
      "Talavera homes for sale",
      "Family neighborhoods in Indio",
      "Gated communities in Indio"
    ],
    "slug": "talavera"
  },
  {
    "id": 10,
    "name": "Las Brisas",
    "description": "Las Brisas in Indio, CA, is a vibrant and family-friendly community known for its tranquil suburban setting, offering a harmonious blend of modern convenience and natural beauty. Nestled within the Coachella Valley, this community features spacious homes, well-maintained landscapes, and close proximity to schools, parks, shopping centers, and recreational opportunities. Residents enjoy a peaceful atmosphere, a welcoming neighborhood spirit, and easy access to nearby cultural and entertainment venues, making it an ideal place to call home.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20220701003342820140000000-o.jpg",
    "features": [
      "Gated community",
      "Variety of home styles",
      "Proximity to schools and shopping"
    ],
    "location": "Indio, CA",
    "coordinates": {
      "latitude": 33.7154,
      "longitude": -116.2233
    },
    "keywords": [
      "Las Brisas homes for sale",
      "Gated neighborhoods in Indio",
      "Peaceful communities in Indio"
    ],
    "slug": "las-brisas"
  },
  {
    "id": 11,
    "name": "Bella Vida",
    "description": "Bella Vida in Indio, CA, is a vibrant and family-friendly real estate community offering a perfect blend of modern living and serene surroundings, with beautifully designed homes, resort-style amenities, lush landscapes, and a welcoming atmosphere that fosters connection and relaxation. Ideally located near top-rated schools, shopping, dining, and outdoor recreation, Bella Vida provides residents with an exceptional lifestyle in the heart of the Coachella Valley, perfect for families and individuals alike.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20220519015632719320000000-o.jpg",
    "features": [
      "Gated community",
      "Modern single-family homes",
      "Family-friendly"
    ],
    "location": "Indio, CA",
    "coordinates": {
      "latitude": 33.7473,
      "longitude": -116.2208
    },
    "keywords": [
      "Bella Vida homes for sale",
      "Family neighborhoods in Indio",
      "Modern homes in Indio"
    ],
    "slug": "bella-vida"
  },
  {
    "id": 12,
    "name": "Heritage Palms",
    "description": "Heritage Palms in Indio, CA, is a vibrant 55+ gated community that blends luxurious living with a strong sense of community, featuring an 18-hole championship golf course, a welcoming clubhouse with fitness and recreational facilities, swimming pools, tennis courts, and numerous social clubs and activities, all set amidst beautifully landscaped grounds and a serene desert backdrop, offering residents an exceptional lifestyle tailored to active adults seeking comfort, leisure, and camaraderie.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20221025183256995537000000-o.jpg",
    "features": [
      "55+ active adult community",
      "Golf course",
      "Resort-style amenities"
    ],
    "location": "Indio, CA",
    "coordinates": {
      "latitude": 33.7516,
      "longitude": -116.2302
    },
    "keywords": [
      "Heritage Palms homes for sale",
      "55+ communities in Indio",
      "Active adult living in Indio"
    ],
    "slug": "heritage-palms"
  },
  {
    "id": 13,
    "name": "Indian Springs Country Club",
    "description": "Indian Springs Country Club in Indio, CA, offers an exceptional real estate community defined by stunning golf course views, meticulously maintained landscapes, and luxurious amenities. Residents enjoy a lifestyle of comfort and recreation with access to a championship golf course, resort-style pools, fitness centers, and a vibrant social scene, all set within a gated, serene neighborhood. Ideal for families, retirees, and vacationers, this community blends elegance, convenience, and a true sense of home.",
    "photo": "https://images.squarespace-cdn.com/content/v1/5fd00e261f2070683497a965/2840ef7c-64ae-45f8-971f-afb26d0f8235/Indian+Springs+Country+Club",
    "features": [
      "Gated community",
      "Golf course living",
      "Resort-style amenities"
    ],
    "location": "Indio, CA",
    "coordinates": {
      "latitude": 33.7409,
      "longitude": -116.2163
    },
    "keywords": [
      "Indian Springs homes for sale",
      "Golf course communities in Indio",
      "Gated neighborhoods in Indio"
    ],
    "slug": "indian-springs-country-club"
  },
  {
    "id": 14,
    "name": "Sandhurst Cove",
    "description": "Sandhurst Cove in Indio, CA, is a serene and exclusive residential community offering spacious homes with modern amenities, scenic mountain views, and proximity to top-tier shopping, dining, and entertainment options, making it an ideal place for families and retirees alike to enjoy a peaceful, convenient lifestyle in the heart of the Coachella Valley, with easy access to outdoor recreational activities, golf courses, and cultural attractions, ensuring a perfect balance of comfort and leisure.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20220831040609439461000000-o.jpg",
    "features": [
      "Boutique gated community",
      "Spacious homes",
      "Modern designs"
    ],
    "location": "Indio, CA",
    "coordinates": {
      "latitude": 33.7198,
      "longitude": -116.2286
    },
    "keywords": [
      "Sandhurst Cove homes for sale",
      "Quiet neighborhoods in Indio",
      "Boutique communities in Indio"
    ],
    "slug": "sandhurst-cove"
  },
  {
    "id": 15,
    "name": "Madison Ranch",
    "description": "Madison Ranch in Indio, CA offers an upscale, gated community with beautifully designed homes, spacious lots, and scenic views of the surrounding desert landscape, providing a peaceful and luxurious living experience. The neighborhood features modern amenities, including a community pool, fitness center, and walking trails, perfect for families and individuals seeking comfort and convenience. With easy access to shopping, dining, and entertainment, Madison Ranch is the ideal place to call home in the heart of the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20220519015754372939000000-o.jpg",
    "features": [
      "Custom-built homes",
      "Large lots",
      "Luxury gated community"
    ],
    "location": "Indio, CA",
    "coordinates": {
      "latitude": 33.7012,
      "longitude": -116.2157
    },
    "keywords": [
      "Madison Ranch homes for sale",
      "Luxury neighborhoods in Indio",
      "Custom homes in Indio"
    ],
    "slug": "madison-ranch"
  },
  {
    "id": 16,
    "name": "Four Seasons at Terra Lago",
    "description": "Four Seasons at Terra Lago in Indio, CA, is a vibrant 55+ active adult community offering resort-style living with stunning mountain views, an array of amenities including a clubhouse, fitness center, golf course, and tennis courts, and a variety of social activities that foster a sense of camaraderie and engagement. Residents enjoy an exceptional lifestyle with well-designed homes, lush landscapes, and proximity to shopping, dining, and entertainment in the heart of the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20221015165045542686000000-o.jpg",
    "features": [
      "55+ community",
      "Modern homes",
      "Resort-style amenities"
    ],
    "location": "Indio, CA",
    "coordinates": {
      "latitude": 33.7532,
      "longitude": -116.2081
    },
    "keywords": [
      "Four Seasons homes for sale",
      "55+ communities in Indio",
      "Active adult living in Indio"
    ],
    "slug": "four-seasons-at-terra-lago"
  },
  {
    "id": 18,
    "name": "Palazzo",
    "description": "Palazzo in Indio, CA, offers a vibrant and luxurious community with modern homes, scenic views, and a prime location, providing residents with access to world-class amenities, parks, and recreational facilities, while being just minutes away from shopping, dining, and entertainment options, making it an ideal place for those seeking a high-quality lifestyle in the heart of the Coachella Valley, blending comfort, convenience, and sophistication in a serene desert setting.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20220701180947423379000000-o.jpg",
    "features": [
      "Modern single-family homes",
      "Family-friendly",
      "Proximity to amenities"
    ],
    "location": "Indio, CA",
    "coordinates": {
      "latitude": 33.7357,
      "longitude": -116.2179
    },
    "keywords": [
      "Palazzo homes for sale",
      "Family neighborhoods in Indio",
      "Modern homes in Indio"
    ],
    "slug": "palazzo"
  },
  {
    "id": 19,
    "name": "Tierra Del Sol",
    "description": "Tierra Del Sol is a tranquil, master-planned community located in Indio, CA, offering a blend of modern homes with scenic views of the desert landscape, convenient access to major highways, and close proximity to shopping, dining, and entertainment. This peaceful neighborhood is ideal for families, retirees, and those seeking a serene lifestyle, featuring spacious homes with private yards, a community pool, and well-maintained parks, making it a perfect blend of comfort, convenience, and natural beauty.",
    "photo": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/369937233.jpg?k=460cae093ab9258691d7a12ee4b7df72f9d021f3cacc8cf0e7479a8133a90cb6&o=&hp=1",
    "features": [
      "Gated community",
      "Large lots",
      "Contemporary designs"
    ],
    "location": "Indio, CA",
    "coordinates": {
      "latitude": 33.7452,
      "longitude": -116.2204
    },
    "keywords": [
      "Tierra Del Sol homes for sale",
      "Gated neighborhoods in Indio",
      "Spacious homes in Indio"
    ],
    "slug": "tierra-del-sol"
  },
  {
    "id": 20,
    "name": "Sonora Wells",
    "description": "Sonora Wells in Indio, CA, is a vibrant, family-friendly community offering spacious homes with modern amenities, picturesque desert landscapes, and a close-knit atmosphere, ideal for those seeking a peaceful lifestyle with easy access to local attractions, shopping, dining, and outdoor activities, including golf courses and hiking trails, making it a perfect place for residents to enjoy both relaxation and adventure in the heart of the Coachella Valley.",
    "photo": "https://images.squarespace-cdn.com/content/v1/5fd00e261f2070683497a965/1666665606229-WM4F0QCDV2QXI3RFMEHE/Sonora-Wells-homes-for-sale-36.jpeg",
    "features": [
      "Family-friendly",
      "Gated community",
      "Community pool and parks"
    ],
    "location": "Indio, CA",
    "coordinates": {
      "latitude": 33.7508,
      "longitude": -116.2023
    },
    "keywords": [
      "Sonora Wells homes for sale",
      "Family neighborhoods in Indio",
      "Gated communities in Indio"
    ],
    "slug": "sonora-wells"
  },
  {
    "id": 21,
    "name": "La Morada",
    "description": "La Morada in Indio, CA, is a vibrant and family-friendly gated community offering a mix of modern homes, lush green spaces, and convenient amenities, located near shopping, dining, and entertainment options, making it an ideal choice for those seeking a peaceful yet connected lifestyle in the heart of the Coachella Valley. With its close proximity to major highways and breathtaking mountain views, La Morada provides residents with a perfect balance of comfort, accessibility, and tranquility in a desirable location.",
    "photo": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/562534879.jpg?k=d8d4040869669d88d750a560afaeebf33437f915400447f43e6e0b4a147ed04e&o=&hp=1",
    "features": [
      "Spacious homes",
      "Family-friendly",
      "Central location"
    ],
    "location": "Indio, CA",
    "coordinates": {
      "latitude": 33.7391,
      "longitude": -116.2182
    },
    "keywords": [
      "La Morada homes for sale",
      "Family-friendly neighborhoods in Indio",
      "Modern homes in Indio"
    ],
    "slug": "la-morada"
  },
  {
    "id": 22,
    "name": "Shadow Ranch",
    "description": "Shadow Ranch in Indio, CA is a vibrant and family-friendly community offering spacious homes with stunning desert views, providing residents with a tranquil suburban lifestyle while being conveniently close to shopping, dining, and recreational amenities. This well-established neighborhood boasts wide streets, beautiful landscaping, and a strong sense of community. Its prime location in the Coachella Valley allows easy access to local events, outdoor activities, and year-round sunshine, making it an ideal place to call home.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20220723224814384848000000-o.jpg",
    "features": [
      "Gated community",
      "Modern homes",
      "Convenient location"
    ],
    "location": "Indio, CA",
    "coordinates": {
      "latitude": 33.7442,
      "longitude": -116.2215
    },
    "keywords": [
      "Shadow Ranch homes for sale",
      "Gated neighborhoods in Indio",
      "Stylish homes in Indio"
    ],
    "slug": "shadow-ranch"
  },
  {
    "id": 23,
    "name": "Vista Escondida",
    "description": "Vista Escondida in Indio, CA, is a tranquil, family-friendly community offering stunning desert views, spacious homes, and a welcoming environment with easy access to local amenities, schools, parks, and shopping centers, making it an ideal place for those seeking comfort, convenience, and a peaceful lifestyle in the heart of the Coachella Valley, with modern residences, a sense of privacy, and a close-knit neighborhood that embraces the charm of California's desert living.",
    "photo": "https://media-production.lp-cdn.com/cdn-cgi/image/format=auto,quality=85,fit=scale-down,width=1280/https://media-production.lp-cdn.com/media/frgkdrkanjxtzqxdxk8c",
    "features": [
      "Gated community",
      "Contemporary designs",
      "Large lots"
    ],
    "location": "Indio, CA",
    "coordinates": {
      "latitude": 33.7483,
      "longitude": -116.2194
    },
    "keywords": [
      "Vista Escondida homes for sale",
      "Quiet neighborhoods in Indio",
      "Contemporary homes in Indio"
    ],
    "slug": "vista-escondida"
  },
  {
    "id": 24,
    "name": "Haciendas at Indio",
    "description": "Haciendas at Indio is a vibrant, gated community in Indio, CA, offering spacious homes with modern amenities, lush landscaping, and a family-friendly environment, perfect for those seeking comfort and tranquility in the heart of the Coachella Valley. With convenient access to local shopping, dining, entertainment, and outdoor activities, residents enjoy a relaxed lifestyle while being just minutes away from the area's top attractions, making it an ideal choice for homebuyers and investors alike.",
    "photo": "https://resource.rentcafe.com/image/upload/w_1920,h_1440,c_crop/q_auto,f_auto,c_limit,w_1200/s3/2/35048/d9d830d8-2dba-483f-9301-7ed6a66b7969_rw_1920%20(1).jpg",
    "features": [
      "Affordable homes",
      "Family-friendly",
      "Proximity to schools and parks"
    ],
    "location": "Indio, CA",
    "coordinates": {
      "latitude": 33.7378,
      "longitude": -116.2202
    },
    "keywords": [
      "Haciendas homes for sale",
      "Affordable neighborhoods in Indio",
      "Family homes in Indio"
    ],
    "slug": "haciendas-at-indio"
  },
  {
    "id": 26,
    "name": "Parkside Ranch",
    "description": "Parkside Ranch in Indio, CA, is a serene, family-friendly community offering a perfect blend of modern homes, spacious lots, and abundant amenities. With its scenic views, well-maintained parks, and easy access to shopping, dining, and entertainment, Parkside Ranch is ideal for those seeking a peaceful yet connected lifestyle. The neighborhood features a variety of home styles, creating a welcoming environment for first-time buyers, growing families, and retirees alike.",
    "photo": "https://images1.apartments.com/i2/BPzDm1vFeFzKS52rw3Q8O6fs6pt0Jg-6UGJqM7r1gh0/111/parkside-estates-canonsburg-pa-building-photo.jpg",
    "features": [
      "Spacious homes",
      "Family-friendly",
      "Proximity to amenities"
    ],
    "location": "Indio, CA",
    "coordinates": {
      "latitude": 33.7405,
      "longitude": -116.2187
    },
    "keywords": [
      "Parkside Ranch homes for sale",
      "Family neighborhoods in Indio",
      "Affordable homes in Indio"
    ],
    "slug": "parkside-estates"
  },
  {
    "id": 27,
    "name": "Indian Wells Village",
    "description": "Indian Wells Village in Indio, CA, is a charming, serene community offering a mix of residential properties surrounded by stunning desert landscapes, featuring spacious homes, well-maintained streets, and a welcoming atmosphere. Known for its proximity to world-class golf courses, upscale shopping, and fine dining, this neighborhood provides residents with a tranquil, family-friendly environment while still being conveniently close to the vibrant amenities of the Coachella Valley. A perfect blend of comfort and convenience.",
    "photo": "https://images.squarespace-cdn.com/content/v1/5b343827e7494005a09267fb/1531107217990-0FMR442QP8UCMSJ0FOIO/PANO_20180629_123444.jpg",
    "features": [
      "Non-HOA community",
      "Large lots",
      "Proximity to shopping and dining"
    ],
    "location": "Indio, CA",
    "coordinates": {
      "latitude": 33.7453,
      "longitude": -116.2225
    },
    "keywords": [
      "Indian Wells Village homes for sale",
      "Non-HOA neighborhoods in Indio",
      "Quiet communities in Indio"
    ],
    "slug": "indian-wells-village"
  },
  {
    "id": 28,
    "name": "Villa Montego",
    "description": "Villa Montego in Indio, CA is a serene and upscale residential community offering modern amenities, spacious homes, lush landscapes, and a relaxed desert lifestyle, perfect for those seeking tranquility and convenience in the heart of the Coachella Valley, with easy access to shopping, dining, entertainment, and outdoor recreational activities, making it an ideal location for families, retirees, and professionals looking for a vibrant yet peaceful living environment.",
    "photo": "https://www.dreamexoticrentals.com/images/Caribbean/Jamaica/VillaSweetVilla/3.jpg",
    "features": [
      "Affordable homes",
      "Family-friendly",
      "Proximity to schools and parks"
    ],
    "location": "Indio, CA",
    "coordinates": {
      "latitude": 33.7396,
      "longitude": -116.2201
    },
    "keywords": [
      "Villa Montego homes for sale",
      "Family neighborhoods in Indio",
      "Affordable homes in Indio"
    ],
    "slug": "villa-montego"
  },
  {
    "id": 29,
    "name": "Indian Palms Villas",
    "description": "Indian Palms Villas in Indio, CA is a serene and exclusive residential community offering a variety of beautifully designed homes nestled amidst stunning desert landscapes, providing a perfect blend of comfort, luxury, and modern amenities. With access to top-tier golf courses, tennis courts, a resort-style pool, and a clubhouse, residents enjoy an active and social lifestyle while being conveniently located near shopping, dining, and entertainment, making it the ideal place to call home in the Coachella Valley.",
    "photo": "https://underpar-files.imgix.net/Images/Courses/Raw/d9221bc42dcb4b4e873dcd38290cdb72.jpg?auto=format&fit=crop&fm=jpg&h=540&q=70&w=970&s=d90cc41b8eb1cf8650fee675b03af542",
    "features": [
      "Gated community",
      "Condos and townhomes",
      "Community pools and clubhouse"
    ],
    "location": "Indio, CA",
    "coordinates": {
      "latitude": 33.7201,
      "longitude": -116.2304
    },
    "keywords": [
      "Indian Palms Villas homes for sale",
      "Condos in Indio",
      "Gated neighborhoods in Indio"
    ],
    "slug": "indian-palms-villas"
  },
  {
    "id": 30,
    "name": "Bella Tierra",
    "description": "Bella Tierra in Indio, CA, is a serene and vibrant residential community offering spacious homes, lush landscaping, and modern amenities, ideal for families and individuals seeking a tranquil yet connected living environment. With its prime location near major highways, shopping centers, and recreational areas, Bella Tierra provides residents with easy access to both relaxation and convenience. The neighborhood fosters a welcoming atmosphere with well-maintained streets, parks, and a variety of nearby services, making it a perfect place to call home.",
    "photo": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/297582060.jpg?k=3e2624c1692c02b106a827c2a9b49010e9560385d626811d1c8486a388513c28&o=&hp=1",
    "features": [
      "Gated community",
      "Stylish homes",
      "Family-friendly"
    ],
    "location": "Indio, CA",
    "coordinates": {
      "latitude": 33.7382,
      "longitude": -116.2236
    },
    "keywords": [
      "Bella Tierra homes for sale",
      "Gated communities in Indio",
      "Stylish neighborhoods in Indio"
    ],
    "slug": "bella-tierra"
  },
  {
    "id": 31,
    "name": "Desert Grove",
    "description": "Desert Grove in Indio, CA is a vibrant and peaceful residential community offering a blend of modern amenities and serene desert landscapes, featuring well-maintained homes, spacious lots, and a welcoming atmosphere, perfect for families, retirees, and those seeking a tranquil escape. Located in the heart of the Coachella Valley, residents enjoy close proximity to shopping, dining, outdoor recreational activities, and the natural beauty of the desert, making Desert Grove an ideal place to call home.",
    "photo": "https://assets.simpleviewinc.com/simpleview/image/upload/crm/yumaaz/Desert-Grove-4_596BF20D-5056-A36F-23A3016CE18DCB72-596bedf45056a36_596bfaf1-5056-a36f-23015d91cc9fdb7c.png",
    "features": [
      "Gated community",
      "Modern homes",
      "Convenient location"
    ],
    "location": "Indio, CA",
    "coordinates": {
      "latitude": 33.7471,
      "longitude": -116.2194
    },
    "keywords": [
      "Desert Grove homes for sale",
      "Modern neighborhoods in Indio",
      "Gated communities in Indio"
    ],
    "slug": "desert-grove"
  }
]