[
  {
    "id": 1,
    "name": "PGA WEST",
    "description": "PGA WEST in La Quinta, CA, is a premier real estate community nestled in the scenic Coachella Valley, offering luxury living with world-class golf courses, stunning mountain views, resort-style amenities, and diverse properties ranging from elegant condominiums to custom estate homes, ideal for those seeking an active, upscale lifestyle in a vibrant and serene desert setting renowned for its year-round sunshine, outdoor recreation, and proximity to cultural events like the Coachella Valley Music and Arts Festival.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20220426152141530297000000-o.jpg",
    "features": [
      "Six championship golf courses",
      "Luxury estates",
      "Multiple clubhouses"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6349,
      "longitude": -116.2566
    },
    "keywords": [
      "PGA WEST homes for sale",
      "Living in PGA WEST La Quinta",
      "Luxury golf communities in La Quinta"
    ],
    "slug": "pga-west"
  },
  {
    "id": 2,
    "name": "The Madison Club",
    "description": "The Madison Club in La Quinta, CA, is an exclusive and luxurious private residential community that epitomizes refined living, offering a harmonious blend of world-class amenities, architecturally stunning homes, and an unparalleled lifestyle experience amidst breathtaking desert landscapes, featuring an acclaimed Tom Fazio-designed golf course, a state-of-the-art wellness center, gourmet dining options, and a welcoming, close-knit atmosphere that fosters connections among discerning residents.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230315174239281865000000-o.jpg",
    "features": [
      "Tom Fazio-designed golf course",
      "Private spa and fitness center",
      "Custom homes and estate lots"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6347,
      "longitude": -116.2459
    },
    "keywords": [
      "The Madison Club homes for sale",
      "Living in The Madison Club La Quinta",
      "Exclusive communities in La Quinta"
    ],
    "slug": "the-madison-club"
  },
  {
    "id": 3,
    "name": "The Hideaway Golf Club",
    "description": "The Hideaway Golf Club in La Quinta, CA, is an exclusive residential community offering luxurious custom-built homes and villas surrounded by two award-winning golf courses, stunning desert landscapes, and world-class amenities, including a state-of-the-art fitness center, elegant clubhouse, fine dining, and a vibrant social scene. Designed for discerning individuals seeking a private retreat, the club blends exceptional service, sophisticated living, and unparalleled golf experiences in the heart of Coachella Valley.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230425212331854428000000-o.jpg",
    "features": [
      "Two private golf courses",
      "Luxury estates",
      "Elegant clubhouse"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6353,
      "longitude": -116.2498
    },
    "keywords": [
      "The Hideaway homes for sale",
      "Living in The Hideaway La Quinta",
      "Luxury communities in La Quinta"
    ],
    "slug": "the-hideaway-golf-club"
  },
  {
    "id": 4,
    "name": "Tradition Golf Club",
    "description": "Tradition Golf Club in La Quinta, CA, is a premier real estate community nestled at the base of the Santa Rosa Mountains, offering luxury living with world-class golf, fine dining, and breathtaking desert landscapes. Featuring custom-built estates, contemporary villas, and hacienda-style homes, the community provides exclusive amenities, including a championship golf course designed by Arnold Palmer, an elegant clubhouse, fitness facilities, and a serene, private ambiance for discerning homeowners.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230121030918726734000000-o.jpg",
    "features": [
      "Arnold Palmer Signature Course",
      "Custom homes",
      "Historic clubhouse"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6742,
      "longitude": -116.2839
    },
    "keywords": [
      "Tradition Golf Club homes for sale",
      "Living in Tradition La Quinta",
      "Exclusive golf communities in La Quinta"
    ],
    "slug": "tradition-golf-club"
  },
  {
    "id": 5,
    "name": "La Quinta Country Club",
    "description": "La Quinta Country Club in La Quinta, CA, is a prestigious gated community renowned for its luxurious lifestyle, offering world-class golf courses, elegant homes, stunning mountain views, and a warm, inviting ambiance that fosters a close-knit, vibrant neighborhood. Residents enjoy a range of high-end amenities, including fine dining, social events, fitness facilities, and proximity to the Coachella Valley's premier attractions, making it an ideal haven for sophisticated living and recreation.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230109232213654903000000-o.jpg",
    "features": [
      "Historic golf course",
      "Custom homes and condos",
      "Vibrant social atmosphere"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6834,
      "longitude": -116.3036
    },
    "keywords": [
      "La Quinta Country Club homes for sale",
      "Living in La Quinta Country Club",
      "Historic communities in La Quinta"
    ],
    "slug": "la-quinta-country-club"
  },
  {
    "id": 6,
    "name": "Andalusia Country Club",
    "description": "Andalusia Country Club in La Quinta, CA, is a premier luxury community offering breathtaking views of the Santa Rosa Mountains, world-class amenities, and a vibrant lifestyle. It features stunning Mediterranean-style architecture, an 18-hole championship golf course, a state-of-the-art fitness center, tennis and pickleball courts, fine dining, and beautifully designed homes. Residents enjoy a blend of serene desert landscapes, elegant social gatherings, and active outdoor living in a prestigious setting.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230612185317646885000000-o.jpg",
    "features": [
      "Rees Jones-designed golf course",
      "Custom homes",
      "Resort-style living"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6479,
      "longitude": -116.2516
    },
    "keywords": [
      "Andalusia homes for sale",
      "Living in Andalusia La Quinta",
      "Luxury golf communities in La Quinta"
    ],
    "slug": "andalusia-country-club"
  },
  {
    "id": 7,
    "name": "The Quarry at La Quinta",
    "description": "The Quarry at La Quinta in La Quinta, CA, is an exclusive, masterfully designed real estate community nestled against the Santa Rosa Mountains, offering luxurious custom homes and unparalleled privacy. Renowned for its world-class Tom Fazio-designed golf course, this prestigious enclave combines natural beauty with modern elegance, providing residents with exceptional amenities, breathtaking views, and a serene desert lifestyle. Perfect for golf enthusiasts and those seeking an upscale, tranquil living environment.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20210728221127820009000000-o.jpg",
    "features": [
      "Tom Fazio-designed golf course",
      "Custom homes and villas",
      "Dramatic desert landscapes"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6265,
      "longitude": -116.2701
    },
    "keywords": [
      "The Quarry homes for sale",
      "Living in The Quarry La Quinta",
      "Exclusive golf clubs in La Quinta"
    ],
    "slug": "the-quarry-at-la-quinta"
  },
  {
    "id": 8,
    "name": "Mountain View Country Club",
    "description": "Mountain View Country Club in La Quinta, CA, is an exclusive gated community offering luxury living with an array of premium amenities, including a stunning 18-hole Arnold Palmer Signature golf course, a beautifully designed clubhouse with fine dining options, a state-of-the-art fitness center, a full-service spa, tennis courts, and scenic walking trails. This prestigious neighborhood features elegant custom homes and stylish villas with breathtaking views of the Santa Rosa Mountains, lush fairways, and serene lakes, creating an idyllic environment for residents seeking a vibrant, active, and relaxed lifestyle in the heart of California's Coachella Valley.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20231007203814560371000000-o.jpg",
    "features": [
      "Arnold Palmer-designed golf course",
      "Luxurious homes",
      "Recreational facilities"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6398,
      "longitude": -116.2537
    },
    "keywords": [
      "Mountain View Country Club homes for sale",
      "Living in Mountain View La Quinta",
      "Family-friendly communities in La Quinta"
    ],
    "slug": "mountain-view-country-club"
  },
  {
    "id": 9,
    "name": "Rancho La Quinta Country Club",
    "description": "Rancho La Quinta Country Club in La Quinta, CA, is a prestigious gated community offering a luxurious desert lifestyle, blending elegant homes, world-class golf courses, and resort-style amenities amidst stunning mountain views, lush landscaping, and a vibrant social atmosphere, perfect for discerning residents seeking relaxation, recreation, and an unparalleled sense of community in the heart of the Coachella Valley.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230511172315606839000000-o.jpg",
    "features": [
      "Two championship courses",
      "Elegant homes",
      "Clubhouse and tennis courts"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6782,
      "longitude": -116.2855
    },
    "keywords": [
      "Rancho La Quinta homes for sale",
      "Luxury communities in La Quinta",
      "Golf clubs in La Quinta"
    ],
    "slug": "rancho-la-quinta-country-club"
  },
  {
    "id": 10,
    "name": "The Palms Golf Club",
    "description": "The Palms Golf Club in La Quinta, CA, offers an exclusive, gated community surrounded by pristine desert landscapes, featuring luxury homes with breathtaking mountain and golf course views, world-class amenities, a private 18-hole championship golf course, a state-of-the-art clubhouse, and exceptional recreational facilities, providing residents with an unparalleled lifestyle of comfort, privacy, and elegance in one of the most sought-after locations in the Coachella Valley.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230111231332450595000000-o.jpg",
    "features": [
      "Fred Couples-designed course",
      "Custom homes and villas",
      "Intimate golf-focused community"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6289,
      "longitude": -116.2182
    },
    "keywords": [
      "The Palms homes for sale",
      "Boutique golf communities in La Quinta",
      "Fred Couples golf courses"
    ],
    "slug": "the-palms-golf-club"
  },
  {
    "id": 11,
    "name": "Griffin Ranch",
    "description": "Griffin Ranch in La Quinta, CA is an exclusive, gated luxury community offering spacious, contemporary homes with stunning desert and mountain views, exceptional amenities including a clubhouse, resort-style pool, fitness center, and meticulously maintained landscaping, providing a serene and private environment perfect for those seeking an upscale desert lifestyle with convenient access to world-class golf courses, shopping, dining, and the vibrant cultural scene of the Coachella Valley.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20221006171652088386000000-o.jpg",
    "features": [
      "Tuscan-style homes",
      "Equestrian facilities",
      "Resort-style amenities"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6361,
      "longitude": -116.2334
    },
    "keywords": [
      "Griffin Ranch homes for sale",
      "Luxury living in La Quinta",
      "Equestrian communities in La Quinta"
    ],
    "slug": "griffin-ranch"
  },
  {
    "id": 12,
    "name": "The Citrus Club",
    "description": "The Citrus Club in La Quinta, CA, is an exclusive, upscale residential community nestled in the heart of the Coachella Valley, offering luxurious homes with stunning mountain views, world-class amenities such as a championship golf course, tennis courts, a fitness center, and a clubhouse, all set amidst meticulously landscaped grounds, providing residents with a serene, resort-style lifestyle in close proximity to top shopping, dining, entertainment, and outdoor activities for a truly exceptional living experience.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230413184609035751000000-o.jpg",
    "features": [
      "Pete Dye-designed course",
      "Luxury homes and casitas",
      "Access to La Quinta Resort amenities"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6829,
      "longitude": -116.2783
    },
    "keywords": [
      "The Citrus Club homes for sale",
      "Luxury golf communities in La Quinta",
      "La Quinta Resort access"
    ],
    "slug": "the-citrus-club"
  },
  {
    "id": 13,
    "name": "Coral Mountain Golf Club",
    "description": "Coral Mountain Golf Club in La Quinta, CA, offers an exclusive desert oasis with breathtaking views of the San Jacinto and Coral Mountains, world-class golfing facilities, luxurious homes, and a serene environment, making it the ideal destination for golf enthusiasts, nature lovers, and those seeking a vibrant, upscale lifestyle. The community features meticulously designed homes, fine dining, spa services, and numerous recreational amenities, creating a truly exceptional living experience in the heart of the Coachella Valley.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230102182516520426000000-o.jpg",
    "features": [
      "Gary Panks-designed course",
      "Resort-style amenities",
      "Modern single-family homes"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6334,
      "longitude": -116.2188
    },
    "keywords": [
      "Coral Mountain homes for sale",
      "Golf communities in La Quinta",
      "Resort-style living in La Quinta"
    ],
    "slug": "coral-mountain-golf-club"
  },
  {
    "id": 14,
    "name": "Heritage Palms Country Club",
    "description": "Heritage Palms Country Club in La Quinta, CA, offers an exclusive 55+ active adult community featuring stunning golf course views, resort-style amenities, and a vibrant social atmosphere, providing residents with luxurious homes, a championship golf course, fitness center, clubhouse, dining options, tennis courts, and a variety of recreational activities, all nestled in the picturesque Coachella Valley with access to outdoor adventures and close proximity to shopping, dining, and entertainment.",
   "photo": null,
    "features": [
      "Arthur Hills-designed golf course",
      "55+ active adult community",
      "Clubhouse and fitness center"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6767,
      "longitude": -116.2834
    },
    "keywords": [
      "Heritage Palms homes for sale",
      "55+ communities in La Quinta",
      "Golf clubs in La Quinta"
    ],
    "slug": "heritage-palms-country-club"
  },
  {
    "id": 15,
    "name": "Santa Rosa Cove",
    "description": "Santa Rosa Cove in La Quinta, CA, is a prestigious, gated community offering luxury living with stunning mountain views, spacious villas, and access to world-class golf courses, resort amenities, and serene desert landscapes, making it an ideal location for those seeking a tranquil yet vibrant lifestyle in the heart of the Coachella Valley. Residents enjoy exceptional privacy, well-maintained grounds, and a central location near shopping, dining, and entertainment, perfect for both full-time living and seasonal retreats.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20220301154908737659000000-o.jpg",
    "features": [
      "Spanish-style homes",
      "Access to La Quinta Resort",
      "Scenic mountain views"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6812,
      "longitude": -116.2968
    },
    "keywords": [
      "Santa Rosa Cove homes for sale",
      "Resort living in La Quinta",
      "Gated communities in La Quinta"
    ],
    "slug": "santa-rosa-cove"
  },
  {
    "id": 16,
    "name": "The Cove at La Quinta",
    "description": "The Cove at La Quinta is a premier, gated real estate community nestled in the scenic desert of La Quinta, CA, offering luxurious homes with breathtaking views of the Santa Rosa Mountains, world-class amenities such as a private golf course, pools, and tennis courts, and a tranquil atmosphere perfect for those seeking a resort-style living experience, while being conveniently located near fine dining, shopping, and outdoor recreation, making it an ideal retreat for families and retirees alike.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20211113182935926943000000-o.jpg",
    "features": [
      "No HOA fees",
      "Eclectic mix of homes",
      "Proximity to Old Town La Quinta"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6595,
      "longitude": -116.3082
    },
    "keywords": [
      "The Cove homes for sale",
      "Non-HOA neighborhoods in La Quinta",
      "Mountain view homes in La Quinta"
    ],
    "slug": "the-cove-at-la-quinta"
  },
  {
    "id": 17,
    "name": "Capistrano at La Quinta",
    "description": "Capistrano at La Quinta is a serene, gated community nestled in the heart of La Quinta, CA, offering luxury homes with breathtaking views of the Santa Rosa Mountains, pristine golf courses, and lush landscapes. Residents enjoy a relaxed, upscale lifestyle with access to world-class amenities, including pools, spas, fitness centers, and walking trails, all while being conveniently located near fine dining, shopping, entertainment, and top-rated golf resorts in the vibrant Coachella Valley.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20220906010707965784000000-o.jpg",
    "features": [
      "Gated community",
      "Contemporary homes",
      "Family-friendly"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6684,
      "longitude": -116.3035
    },
    "keywords": [
      "Capistrano homes for sale",
      "Family-friendly neighborhoods in La Quinta",
      "Gated communities in La Quinta"
    ],
    "slug": "capistrano-at-la-quinta"
  },
  {
    "id": 18,
    "name": "Lake La Quinta",
    "description": "Lake La Quinta in La Quinta, CA, is an exclusive, picturesque community offering luxury waterfront living with stunning lake views, private docks, and access to world-class amenities, including a private clubhouse, fitness center, and resort-style pool. The serene environment, surrounded by lush landscaping and beautifully designed homes, provides residents with a peaceful retreat while still being close to shopping, dining, golf courses, and top-rated schools, making it a perfect place to call home.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230109232302393658000000-o.jpg",
    "features": [
      "Private lake",
      "Waterfront homes",
      "Recreational activities"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6873,
      "longitude": -116.2971
    },
    "keywords": [
      "Lake La Quinta homes for sale",
      "Waterfront homes in La Quinta",
      "Luxury neighborhoods in La Quinta"
    ],
    "slug": "lake-la-quinta"
  },
  {
    "id": 19,
    "name": "Desert Club Estates",
    "description": "Desert Club Estates in La Quinta, CA, offers a serene and upscale community with stunning desert views, luxurious homes, and a relaxed atmosphere, perfect for those seeking a blend of comfort and elegance. Residents enjoy close proximity to world-class golf courses, recreational activities, and vibrant cultural experiences, making it an ideal location for both full-time living and seasonal escapes. This prestigious neighborhood provides a sense of privacy and tranquility, coupled with modern amenities and easy access to shopping, dining, and entertainment options.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20231016220149817775000000-o.jpg",
    "features": [
      "No HOA fees",
      "Large lots",
      "Close to Old Town La Quinta"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6781,
      "longitude": -116.3033
    },
    "keywords": [
      "Desert Club Estates homes for sale",
      "Non-HOA neighborhoods in La Quinta",
      "Spacious lots in La Quinta"
    ],
    "slug": "desert-club-estates"
  },
  {
    "id": 20,
    "name": "Montero Estates",
    "description": "Montero Estates in La Quinta, CA, offers an exclusive, serene community nestled in the heart of the Coachella Valley, featuring luxurious, custom-built homes with stunning mountain views, sprawling lawns, and resort-style amenities such as private pools, tennis courts, and scenic walking trails, providing residents with a sophisticated lifestyle in close proximity to world-class golf courses, shopping, dining, and entertainment, making it the perfect destination for those seeking both tranquility and convenience.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20220423144511555800000000-o.jpg",
    "features": [
      "Gated community",
      "Private yards",
      "Community pool and tennis courts"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6764,
      "longitude": -116.2957
    },
    "keywords": [
      "Montero Estates homes for sale",
      "Small gated communities in La Quinta",
      "Affordable homes in La Quinta"
    ],
    "slug": "montero-estates"
  },
  {
    "id": 21,
    "name": "Carmela",
    "description": "Carmela in La Quinta, CA is an exclusive, upscale residential community nestled in the picturesque Coachella Valley, offering luxurious homes with stunning desert and mountain views, world-class amenities such as a golf course, fitness center, and resort-style pools, along with close proximity to premier shopping, dining, and outdoor recreational activities, making it the perfect destination for those seeking a serene and vibrant lifestyle in the heart of Southern California.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230902184058662402000000-o.jpg",
    "features": [
      "Gated community",
      "Luxury homes",
      "Proximity to Polo Grounds"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6399,
      "longitude": -116.2422
    },
    "keywords": [
      "Carmela homes for sale",
      "Luxury gated communities in La Quinta",
      "Polo Grounds adjacent neighborhoods"
    ],
    "slug": "carmela"
  },
  {
    "id": 22,
    "name": "Esplanade",
    "description": "Esplanade in La Quinta, CA, is an exclusive, vibrant, and upscale real estate community offering luxurious homes nestled against the stunning Santa Rosa Mountains, featuring spacious properties, exceptional amenities such as golf courses, resort-style pools, and walking trails, all within a serene, gated environment that provides privacy, security, and breathtaking views, making it an ideal destination for those seeking comfort, convenience, and a sophisticated lifestyle in one of Southern California's most desirable locations.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230812025554953603000000-o.jpg",
    "features": [
      "Gated community",
      "Family-friendly",
      "Spacious single-family homes"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6732,
      "longitude": -116.2568
    },
    "keywords": [
      "Esplanade homes for sale",
      "Family neighborhoods in La Quinta",
      "Gated communities in La Quinta"
    ],
    "slug": "esplanade"
  },
  {
    "id": 23,
    "name": "Puerta Azul",
    "description": "Puerta Azul in La Quinta, CA, is a prestigious, gated community offering luxury living with stunning desert views, resort-style amenities, spacious homes, and access to championship golf courses, ideal for those seeking tranquility, security, and convenience, located near the vibrant lifestyle of Old Town La Quinta and popular attractions, providing residents a perfect blend of relaxation and recreation in one of Southern California's most desirable locations.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230306225657930232000000-o.jpg",
    "features": [
      "Spanish-style villas",
      "Resort-style amenities",
      "Gated community"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6488,
      "longitude": -116.2675
    },
    "keywords": [
      "Puerta Azul homes for sale",
      "Boutique communities in La Quinta",
      "Spanish-style neighborhoods in La Quinta"
    ],
    "slug": "puerta-azul"
  },
  {
    "id": 24,
    "name": "Sonrisa",
    "description": "Sonrisa is a charming and serene gated community nestled in the heart of La Quinta, CA, offering a peaceful desert oasis with stunning mountain views, spacious homes, and a blend of modern amenities and classic architecture. Residents enjoy access to lush landscaping, well-maintained streets, and proximity to the world-renowned golf courses, fine dining, shopping, and outdoor recreational opportunities that La Quinta has to offer, making it an ideal place for both relaxation and active living.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20220909201318310452000000-o.jpg",
    "features": [
      "Modern single-family homes",
      "Family-friendly",
      "Central location"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6684,
      "longitude": -116.2635
    },
    "keywords": [
      "Sonrisa homes for sale",
      "Family neighborhoods in La Quinta",
      "Affordable homes in La Quinta"
    ],
    "slug": "sonrisa"
  },
  {
    "id": 25,
    "name": "Aliso",
    "description": "The Aliso community in La Quinta, CA, offers a serene desert lifestyle with stunning mountain views, modern amenities, and a family-friendly atmosphere. Its prime location provides easy access to golf courses, hiking trails, and the vibrant shopping and dining options in nearby Old Town La Quinta, making it an ideal place for those seeking a peaceful retreat with convenient access to recreational activities, excellent schools, and a tight-knit, welcoming neighborhood feel.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20220515015710353571000000-o.jpg",
    "features": [
      "Gated community",
      "Contemporary homes",
      "Proximity to schools and parks"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6712,
      "longitude": -116.2565
    },
    "keywords": [
      "Aliso homes for sale",
      "Living in Aliso La Quinta",
      "Quiet neighborhoods in La Quinta"
    ],
    "slug": "aliso"
  },
  {
    "id": 26,
    "name": "Vista Santa Rosa",
    "description": "Vista Santa Rosa in La Quinta, CA is an exclusive, serene residential community offering stunning views of the Santa Rosa Mountains, beautifully designed homes, and easy access to golf courses, hiking trails, and upscale amenities. Known for its quiet, family-friendly atmosphere, the community provides residents with a luxurious lifestyle, featuring spacious homes with modern finishes, private pools, and beautifully landscaped surroundings. Perfect for those seeking a peaceful retreat while being close to shopping, dining, and entertainment options.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20211110224943482982000000-o.jpg",
    "features": [
      "Large lots",
      "Custom homes",
      "Equestrian-friendly"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6354,
      "longitude": -116.2431
    },
    "keywords": [
      "Vista Santa Rosa homes for sale",
      "Non-HOA neighborhoods in La Quinta",
      "Equestrian properties in La Quinta"
    ],
    "slug": "vista-santa-rosa"
  },
  {
    "id": 27,
    "name": "Laguna De La Paz",
    "description": "Laguna De La Paz in La Quinta, CA, offers a serene, gated community with picturesque views of the Santa Rosa Mountains, pristine lakes, and meticulously landscaped grounds, providing residents with a resort-like atmosphere. This upscale neighborhood features elegant homes, an array of recreational amenities including tennis courts, a clubhouse, a fitness center, and a private lake for boating and fishing, all within close proximity to shopping, dining, golf courses, and the vibrant culture of La Quinta, making it the perfect blend of luxury and convenience.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20220108001747566491000000-o.jpg",
    "features": [
      "Waterfront homes",
      "Gated community",
      "Community lake and amenities"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6803,
      "longitude": -116.2837
    },
    "keywords": [
      "Laguna De La Paz homes for sale",
      "Waterfront living in La Quinta",
      "Gated neighborhoods in La Quinta"
    ],
    "slug": "laguna-de-la-paz"
  },
  {
    "id": 28,
    "name": "Piazza Serena",
    "description": "Piazza Serena in La Quinta, CA is an exclusive, tranquil residential community offering luxurious living with picturesque desert views, stylish modern homes, world-class amenities, and proximity to renowned golf courses, shopping, dining, and outdoor recreation, providing an ideal location for those seeking both relaxation and convenience in one of Southern California's most desirable destinations.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20211216231837833139000000-o.jpg",
    "features": [
      "Tuscan-inspired homes",
      "Exclusive gated community",
      "Mountain views"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6407,
      "longitude": -116.2415
    },
    "keywords": [
      "Piazza Serena homes for sale",
      "Luxury homes in La Quinta",
      "Gated communities in La Quinta"
    ],
    "slug": "piazza-serena"
  },
  {
    "id": 29,
    "name": "Monticello",
    "description": "Monticello in La Quinta, CA, is an exclusive, luxury real estate community nestled in the scenic Coachella Valley, offering stunning views of the surrounding mountains and pristine desert landscapes. This upscale neighborhood features spacious, custom-designed homes, lush golf course fairways, and resort-style amenities, providing residents with unparalleled comfort, privacy, and convenience. With its prime location, Monticello offers a tranquil retreat while being close to shopping, dining, entertainment, and outdoor recreation.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230829224313270493000000-o.jpg",
    "features": [
      "Single-story homes",
      "Spacious lots",
      "Family-friendly"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6672,
      "longitude": -116.2678
    },
    "keywords": [
      "Monticello homes for sale",
      "Family neighborhoods in La Quinta",
      "Affordable homes in La Quinta"
    ],
    "slug": "monticello"
  },
  {
    "id": 30,
    "name": "Desert Pride",
    "description": "Desert Pride in La Quinta, CA, is a tranquil and scenic residential community offering stunning desert landscapes, upscale homes, and a peaceful atmosphere, making it the perfect destination for those seeking a quiet retreat with easy access to nearby amenities such as golf courses, restaurants, and shopping centers. With a variety of properties ranging from modern villas to spacious estates, Desert Pride combines luxurious living with the beauty of the Coachella Valley, creating an ideal environment for families, retirees, and seasonal residents alike.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230630044826665772000000-o.jpg",
    "features": [
      "Non-HOA community",
      "Modern single-family homes",
      "Proximity to schools and shopping"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6767,
      "longitude": -116.2654
    },
    "keywords": [
      "Desert Pride homes for sale",
      "Affordable neighborhoods in La Quinta",
      "Non-HOA homes in La Quinta"
    ],
    "slug": "desert-pride"
  },
  {
    "id": 31,
    "name": "Rancho Santana",
    "description": "Rancho Santana in La Quinta, CA, offers an exclusive desert oasis with luxurious homes, stunning mountain views, and world-class amenities, blending modern elegance with natural beauty. This gated community features expansive properties, lush landscapes, and close proximity to top golf courses, shopping, and dining, providing residents with an unparalleled lifestyle of comfort, privacy, and relaxation in one of Southern California's most desirable locations.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230929151602654040000000-o.jpg",
    "features": [
      "Luxury homes",
      "Gated community",
      "Proximity to Polo Grounds"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6393,
      "longitude": -116.2387
    },
    "keywords": [
      "Rancho Santana homes for sale",
      "Luxury communities in La Quinta",
      "Gated neighborhoods in La Quinta"
    ],
    "slug": "rancho-santana"
  },
  {
    "id": 32,
    "name": "Haciendas at La Quinta",
    "description": "Haciendas at La Quinta is an exclusive, upscale gated community nestled in the heart of La Quinta, CA, offering luxurious homes with stunning desert views, resort-style amenities, private pools, and access to world-renowned golf courses, all within a serene and secure environment, perfect for those seeking tranquility and elegance in the picturesque Coachella Valley, with close proximity to fine dining, shopping, and entertainment venues.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230301210806214375000000-o.jpg",
    "features": [
      "Spanish-inspired homes",
      "Private pools",
      "Gated community"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6785,
      "longitude": -116.2942
    },
    "keywords": [
      "Haciendas at La Quinta homes for sale",
      "Luxury neighborhoods in La Quinta",
      "Gated communities in La Quinta"
    ],
    "slug": "haciendas-at-la-quinta"
  },
  {
    "id": 33,
    "name": "Duna La Quinta",
    "description": "Duna La Quinta in La Quinta, CA, is a serene, upscale community nestled within the stunning desert landscape, offering luxurious homes with spectacular mountain and golf course views, meticulously landscaped surroundings, and a range of world-class amenities, including a private country club, golf course, tennis courts, and resort-style pools, providing residents with an exclusive, peaceful lifestyle, ideal for those seeking both relaxation and active living in one of California's most sought-after desert retreats.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20221026060103824653000000-o.jpg",
    "features": [
      "Fairway homes",
      "Gated community",
      "Golf course views"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6821,
      "longitude": -116.2928
    },
    "keywords": [
      "Duna La Quinta homes for sale",
      "Golf course living in La Quinta",
      "Luxury communities in La Quinta"
    ],
    "slug": "duna-la-quinta"
  },
  {
    "id": 34,
    "name": "Pintura",
    "description": "Pintura is an upscale, gated community located in La Quinta, CA, offering luxury homes with stunning mountain views, contemporary architectural designs, and resort-style amenities such as a private pool, fitness center, and walking trails. This exclusive neighborhood provides residents with a peaceful, secure environment while being close to top-tier golf courses, fine dining, and entertainment options, making it an ideal place for those seeking a sophisticated and serene desert lifestyle.",
   "photo": null,
    "features": [
      "Tuscan-inspired homes",
      "Boutique gated community",
      "Tranquil environment"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6845,
      "longitude": -116.2733
    },
    "keywords": [
      "Pintura homes for sale",
      "Luxury homes in La Quinta",
      "Boutique communities in La Quinta"
    ],
    "slug": "pintura"
  },
  {
    "id": 35,
    "name": "Cove Oasis",
    "description": "Cove Oasis in La Quinta, CA, offers a serene and upscale desert lifestyle, nestled at the base of the breathtaking San Jacinto Mountains, featuring modern homes with stunning mountain views, beautifully landscaped gardens, and a tranquil atmosphere, making it an ideal retreat for those seeking luxury living in a peaceful and scenic environment with easy access to world-class golf courses, upscale dining, shopping, and the vibrant attractions of the Coachella Valley.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230801215857449638000000-o.jpg",
    "features": [
      "Non-HOA community",
      "Custom homes",
      "Scenic mountain views"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6612,
      "longitude": -116.3099
    },
    "keywords": [
      "Cove Oasis homes for sale",
      "Non-HOA communities in La Quinta",
      "Mountain view homes in La Quinta"
    ],
    "slug": "cove-oasis"
  },
  {
    "id": 36,
    "name": "Aliso II",
    "description": "Aliso II in La Quinta, CA, offers an exclusive, tranquil desert living experience, featuring luxurious homes with stunning mountain views, upscale amenities, and a close-knit community atmosphere. Residents enjoy access to world-class golf courses, resort-style pools, and a prime location near shopping, dining, and outdoor recreation, making it an ideal destination for those seeking both relaxation and adventure in the heart of the Coachella Valley.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230126212256760653000000-o.jpg",
    "features": [
      "Modern homes",
      "Gated community",
      "Proximity to schools"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6725,
      "longitude": -116.2583
    },
    "keywords": [
      "Aliso II homes for sale",
      "Family neighborhoods in La Quinta",
      "Gated communities in La Quinta"
    ],
    "slug": "aliso-ii"
  },
  {
    "id": 37,
    "name": "La Quinta Highlands",
    "description": "La Quinta Highlands in La Quinta, CA, is a prestigious and serene community offering expansive desert views, luxurious homes, and a peaceful atmosphere, ideal for those seeking a blend of modern amenities and natural beauty, with proximity to world-class golf courses, hiking trails, and the vibrant cultural scene of the Coachella Valley, making it a sought-after location for residents and investors looking for a perfect blend of comfort, style, and tranquility in the desert landscape.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20231102141349314435000000-o.jpg",
    "features": [
      "Non-HOA community",
      "Affordable homes",
      "Spacious backyards"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6794,
      "longitude": -116.2667
    },
    "keywords": [
      "La Quinta Highlands homes for sale",
      "Affordable neighborhoods in La Quinta",
      "Non-HOA homes in La Quinta"
    ],
    "slug": "la-quinta-highlands"
  },
  {
    "id": 38,
    "name": "Quinterra",
    "description": "Quinterra in La Quinta, CA, is an exclusive, upscale community offering stunning desert views, luxurious homes, and a serene, gated environment with resort-style amenities, including a clubhouse, pool, and tennis courts, ideal for those seeking a peaceful yet vibrant lifestyle in one of the most desirable locations in the Coachella Valley, blending privacy with proximity to world-class golf courses, dining, shopping, and entertainment options for a truly exceptional living experience.",
   "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20220802054322822079000000-o.jpg",
    "features": [
      "Family-friendly",
      "Private yards",
      "Proximity to amenities"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6748,
      "longitude": -116.2573
    },
    "keywords": [
      "Quinterra homes for sale",
      "Family neighborhoods in La Quinta",
      "Quiet neighborhoods in La Quinta"
    ],
    "slug": "quinterra"
  },
  {
    "id": 39,
    "name": "Sunburst",
    "description": "Sunburst in La Quinta, CA is a vibrant, gated community offering luxurious, spacious homes with breathtaking mountain views, top-tier amenities, and a family-friendly atmosphere, perfect for those seeking a serene yet active lifestyle, with proximity to renowned golf courses, shopping centers, dining options, and recreational activities, making it an ideal destination for both relaxation and adventure in the heart of the Coachella Valley.",
   "photo": null,
    "features": [
      "Gated community",
      "Modern single-family homes",
      "Proximity to shopping and schools"
    ],
    "location": "La Quinta, CA",
    "coordinates": {
      "latitude": 33.6759,
      "longitude": -116.2643
    },
    "keywords": [
      "Sunburst homes for sale",
      "Living in Sunburst La Quinta",
      "Gated neighborhoods in La Quinta"
    ],
    "slug": "sunburst"
  }
]