[
  {
    "id": 1,
    "name": "Old Las Palmas",
    "description": "Old Las Palmas is one of Palm Springs' most storied and sought-after neighborhoods, celebrated for its historic charm and luxurious lifestyle. Established in the 1920s, it became a haven for Hollywood’s elite, including Cary Grant and Elizabeth Taylor, drawn by its privacy, beauty, and proximity to the San Jacinto Mountains. The neighborhood is home to a few hundred properties, showcasing a blend of Spanish Colonial Revival and Mid-Century Modern architecture. These residences, set on expansive lots with gated entries and lush landscaping, offer a harmonious blend of old-world elegance and modern luxury. Streets lined with towering palm trees and vibrant citrus groves enhance the community's oasis-like ambiance. Nestled near downtown Palm Springs, Old Las Palmas provides convenient access to world-class dining and shopping while maintaining an air of exclusivity. Its rich history, stunning mountain views, and enduring appeal make it a highly desirable address and a sound investment in the Coachella Valley's real estate market.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20200320164115567937000000-o.jpg",
    "price_range": "$2,000,000 - $8,000,000",
    "features": [
      "Celebrity homes",
      "Spanish Colonial Revival architecture",
      "Lush landscaping"
    ],
    "location": "Central Palm Springs",
    "coordinates": {
      "latitude": 33.8361,
      "longitude": -116.5433
    },
    "keywords": [
      "Old Las Palmas homes for sale",
      "Home prices in Old Las Palmas Palm Springs",
      "Moving to Old Las Palmas Palm Springs"
    ],
    "slug": "old-las-palmas"
  },
  {
    "id": 2,
    "name": "The Movie Colony",
    "description": "The Movie Colony is one of Palm Springs’ most celebrated and historically significant neighborhoods, known for its storied past and classic elegance. Originally developed in the 1930s, this area quickly became a retreat for Hollywood’s brightest stars, who sought refuge from the city’s hustle under the desert sun. Legends such as Frank Sinatra, Cary Grant, and Marilyn Monroe once called this neighborhood home, solidifying its reputation as a glamorous haven for the elite. Nestled just east of downtown Palm Springs, The Movie Colony boasts a prime location that offers the perfect balance of tranquility and accessibility. Residents enjoy peaceful, palm-lined streets set against the dramatic backdrop of the San Jacinto Mountains, while being just moments away from the vibrant dining, shopping, and cultural scene of the city center. This historic enclave is home to a few hundred properties, each showcasing a distinctive charm. Architectural styles range from Spanish Colonial Revival to Mid-Century Modern, with homes featuring signature design elements such as stucco exteriors, red tile roofs, expansive glass walls, and lushly landscaped courtyards. Many properties also include resort-style amenities like pools, guest casitas, and outdoor living spaces, perfect for embracing the indoor-outdoor lifestyle synonymous with Palm Springs. The Movie Colony’s rich history and architectural beauty have made it a sought-after neighborhood for those seeking a blend of old Hollywood glamour and modern luxury. It is also highly regarded for its walkability and proximity to iconic Palm Springs landmarks, such as the Uptown Design District and Ruth Hardy Park. Whether drawn by its historical significance, stunning natural surroundings, or enduring charm, The Movie Colony continues to be a premier address in the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20200619162952193693000000-o.jpg",
    "price_range": "$1,500,000 - $5,000,000",
    "features": [
      "Spanish Revival homes",
      "Mid-century modern architecture",
      "Proximity to downtown"
    ],
    "location": "Central Palm Springs",
    "coordinates": {
      "latitude": 33.8295,
      "longitude": -116.5455
    },
    "keywords": [
      "The Movie Colony homes for sale",
      "Home prices in The Movie Colony Palm Springs",
      "Moving to The Movie Colony Palm Springs"
    ],
    "slug": "the-movie-colony"
  },
  {
    "id": 3,
    "name": "Vista Las Palmas",
    "description": "Vista Las Palmas is one of the most iconic neighborhoods in Palm Springs, celebrated for its Mid-Century Modern architecture and rich connection to Hollywood's Golden Age. Developed primarily in the late 1950s and early 1960s, the neighborhood quickly gained fame as a glamorous desert retreat for celebrities and socialites. Stars like Dean Martin, Peter Lawford, and Debbie Reynolds once graced this area with their presence, earning it the nickname “The Rat Pack Playground.” Nestled against the base of the San Jacinto Mountains, Vista Las Palmas offers breathtaking mountain views that frame its meticulously designed homes. The dramatic desert landscape provides a stunning contrast to the clean, modern lines of the architecture, creating a visual harmony that has made this neighborhood world-famous. Many homes were designed by the legendary architect William Krisel and built by the Alexander Construction Company, whose work defined the Mid-Century Modern aesthetic in Palm Springs. The homes in Vista Las Palmas are celebrated for their timeless elegance and innovative design. Signature features include post-and-beam construction, expansive walls of glass, butterfly roofs, and seamless indoor-outdoor living spaces. Many properties also feature private pools, lush landscaping, and spacious patios, perfect for entertaining and enjoying the desert’s year-round sunshine. These elements make the neighborhood a living showcase of architectural innovation and effortless luxury. Located just northwest of downtown Palm Springs, Vista Las Palmas combines a serene residential atmosphere with easy access to the city’s vibrant cultural and social scene. Its proximity to dining, shopping, and entertainment ensures that residents enjoy both privacy and convenience. The neighborhood’s architectural significance and enduring charm have also made it a magnet for design enthusiasts and those seeking to own a piece of Palm Springs’ storied history. Today, Vista Las Palmas continues to captivate homeowners and visitors alike with its unique blend of history, architecture, and natural beauty. Whether drawn by the allure of its celebrity past, the iconic Mid-Century Modern homes, or the stunning mountain backdrop, Vista Las Palmas remains one of the most sought-after neighborhoods in Palm Springs.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20200701182514789823000000-o.jpg",
    "price_range": "$2,500,000 - $7,000,000",
    "features": [
      "Architectural significance",
      "Alexander-built homes",
      "Close to downtown"
    ],
    "location": "Northwest Palm Springs",
    "coordinates": {
      "latitude": 33.8428,
      "longitude": -116.5524
    },
    "keywords": [
      "Vista Las Palmas homes for sale",
      "Home prices in Vista Las Palmas Palm Springs",
      "Moving to Vista Las Palmas Palm Springs"
    ],
    "slug": "vista-las-palmas"
  },
  {
    "id": 4,
    "name": "Deepwell Estates",
    "description": "Deepwell Estates is a cherished neighborhood in Palm Springs, celebrated for its rich history, architectural beauty, and serene residential charm. Developed in the late 1940s and 1950s, this community began as a private estate owned by Henry Pearson, who dug an exceptionally deep well on the property, giving the area its name. Over time, the estate was subdivided, and Deepwell Estates became one of the most sought-after neighborhoods in the city. Nestled in South Palm Springs, Deepwell Estates is renowned for its tranquil streets lined with mature palm trees and impeccably landscaped properties. The neighborhood is home to more than a few hundred homes, many of which were designed in the Mid-Century Modern style by acclaimed architects. These residences feature signature elements such as clean lines, expansive glass windows, and open floor plans that invite the desert light into every room. Alongside Mid-Century Modern gems, there are also Spanish Revival and Ranch-style homes, offering a mix of architectural styles that contribute to the neighborhood’s unique character. Deepwell Estates has a storied past as a favorite destination for Hollywood’s elite during the mid-20th century. Luminaries such as Jerry Lewis, William Holden, and Elizabeth Taylor once resided here, drawn by the neighborhood’s exclusivity and picturesque surroundings. The area’s proximity to the San Jacinto Mountains provides stunning views and a sense of seclusion, while its location near downtown Palm Springs ensures easy access to world-class dining, shopping, and cultural attractions. The neighborhood’s enduring appeal lies in its seamless blend of history, style, and convenience. Deepwell Estates offers residents a quiet, upscale lifestyle with all the amenities of Palm Springs just moments away. Whether for its iconic Mid-Century Modern homes, rich Hollywood history, or stunning natural backdrop, Deepwell Estates remains one of the most desirable neighborhoods in the Coachella Valley."
,
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20200210042409508169000000-o.jpg",
    "price_range": "$1,000,000 - $3,500,000",
    "features": [
      "Tree-lined streets",
      "Private pools",
      "Large lots"
    ],
    "location": "South Palm Springs",
    "coordinates": {
      "latitude": 33.8106,
      "longitude": -116.5437
    },
    "keywords": [
      "Deepwell Estates homes for sale",
      "Home prices in Deepwell Estates Palm Springs",
      "Moving to Deepwell Estates Palm Springs"
    ],
    "slug": "deepwell-estates"
  },
  {
    "id": 5,
    "name": "Indian Canyons",
    "description": "Indian Canyons is a premier neighborhood in South Palm Springs, renowned for its luxurious homes, golf-centric lifestyle, and breathtaking natural surroundings. Nestled against the San Jacinto Mountains, the neighborhood takes its name from the nearby Indian Canyons, a series of picturesque desert oases that hold deep cultural and historical significance for the Agua Caliente Band of Cahuilla Indians. Developed primarily in the 1960s and 1970s, Indian Canyons showcases a stunning collection of Mid-Century Modern and contemporary homes. Many of these residences were designed by renowned architects and feature hallmark design elements such as clean lines, open floor plans, and large windows that frame the dramatic mountain vistas. Homes often include spacious outdoor living areas, private pools, and meticulously landscaped yards, perfect for embracing Palm Springs’ indoor-outdoor lifestyle. The neighborhood is also home to some striking examples of Spanish Revival and Ranch-style architecture, adding to its diverse aesthetic appeal. At the heart of Indian Canyons lies the iconic Indian Canyons Golf Resort, featuring two 18-hole championship golf courses surrounded by lush fairways and towering palm trees. This world-class golfing destination has drawn players and enthusiasts for decades and provides a vibrant social hub for the community. Beyond the golf courses, residents enjoy proximity to some of Palm Springs’ best hiking trails, including those in the nearby Tahquitz and Andreas Canyons, where scenic desert landscapes and tranquil streams await exploration. Indian Canyons offers a peaceful, upscale atmosphere while being just minutes away from downtown Palm Springs. Its location provides easy access to fine dining, boutique shopping, and cultural attractions, making it a perfect blend of natural beauty and urban convenience. Whether for its architectural significance, stunning mountain backdrop, or vibrant golfing culture, Indian Canyons remains a highly sought-after address in the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20200818163647389959000000-o.jpg",
    "price_range": "$1,500,000 - $4,000,000",
    "features": [
      "Golf courses",
      "Mountain views",
      "Upscale homes"
    ],
    "location": "South Palm Springs",
    "coordinates": {
      "latitude": 33.8008,
      "longitude": -116.5323
    },
    "keywords": [
      "Indian Canyons homes for sale",
      "Home prices in Indian Canyons Palm Springs",
      "Moving to Indian Canyons Palm Springs"
    ],
    "slug": "indian-canyons"
  },
  {
    "id": 6,
    "name": "Twin Palms",
    "description": "Twin Palms is a historic neighborhood in Palm Springs that stands as a cornerstone of Mid-Century Modern architecture. Developed in the late 1940s and early 1950s, Twin Palms was the first large-scale residential project by the Alexander Construction Company, a name synonymous with the modernist movement in the Coachella Valley. This neighborhood marked the beginning of Palm Springs’ transformation into a hub for cutting-edge architectural design and stylish desert living. Located in South Palm Springs, Twin Palms features more than a few hundred homes, many of which were designed by famed architect William Krisel. These homes are celebrated for their iconic butterfly roofs, clerestory windows, and post-and-beam construction, which emphasize simplicity and functionality while seamlessly integrating with the surrounding desert landscape. The neighborhood’s name comes from the twin palm trees often planted in the front yards of these properties, a signature detail that has become a hallmark of the community. Twin Palms offers a tranquil, residential vibe while remaining conveniently close to downtown Palm Springs. Residents enjoy easy access to the city’s vibrant dining, shopping, and cultural scene, as well as nearby hiking trails in the surrounding mountains. The streets of Twin Palms are lined with mature palm trees and well-maintained homes, many of which have been lovingly restored to preserve their original character while incorporating modern upgrades. The neighborhood’s rich history and architectural significance have made it a favorite among Mid-Century Modern enthusiasts and those seeking a slice of Palm Springs’ storied past. With its iconic design, scenic mountain views, and proximity to local amenities, Twin Palms remains one of the most desirable neighborhoods for those who appreciate the timeless appeal of modernist desert living.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20200723195119441806000000-o.jpg",
    "price_range": "$1,000,000 - $3,000,000",
    "features": [
      "Butterfly rooflines",
      "William Krisel designs",
      "Proximity to amenities"
    ],
    "location": "South Palm Springs",
    "coordinates": {
      "latitude": 33.8069,
      "longitude": -116.5439
    },
    "keywords": [
      "Twin Palms homes for sale",
      "Home prices in Twin Palms Palm Springs",
      "Moving to Twin Palms Palm Springs"
    ],
    "slug": "twin-palms"
  },
  {
    "id": 7,
    "name": "The Mesa",
    "description": "The Mesa is one of Palm Springs’ most exclusive and enchanting neighborhoods, renowned for its eclectic architecture, storied history, and secluded charm. Nestled at the base of the San Jacinto Mountains in South Palm Springs, this neighborhood offers a tranquil retreat while being just moments from the vibrant downtown area. Dating back to the 1920s, The Mesa began as a favored enclave for Hollywood stars and wealthy elites seeking privacy and breathtaking surroundings. Over the decades, it has attracted a mix of influential residents, including Clark Gable, Sonny Bono, and Suzanne Somers, who were drawn to its picturesque setting and unique character. Today, The Mesa remains a haven for those seeking luxury and individuality in the Coachella Valley. The Mesa is home to a mix of architectural styles, from Spanish Revival and Mid-Century Modern to contemporary masterpieces. Many properties are tucked into the hillside, offering stunning views of the desert floor and surrounding mountains. Homes often feature distinctive details such as adobe walls, red tile roofs, expansive glass windows, and lush, landscaped grounds. Gated estates with private pools and terraces are common, creating an intimate oasis for residents to enjoy Palm Springs’ year-round sunshine. The neighborhood’s winding streets and mature palm trees enhance its serene atmosphere, making it feel like a hidden gem. Residents enjoy proximity to iconic local attractions such as the Tahquitz Canyon hiking trails and the Indian Canyons Golf Resort. The Mesa’s combination of natural beauty, architectural diversity, and rich history has made it one of Palm Springs’ most sought-after addresses. Whether for its celebrity legacy, scenic mountain backdrop, or diverse range of homes, The Mesa offers an unparalleled lifestyle that captures the essence of Palm Springs. It’s a neighborhood where history and modern luxury coexist, providing a truly unique living experience in the desert.",
    "photo": "https://tse2.mm.bing.net/th?id=OIP.BWl-ADtct8VqhHi82wU-PgHaE7&pid=Api",
    "price_range": "$1,500,000 - $5,000,000",
    "features": [
      "Spanish Revival homes",
      "Panoramic views",
      "Secluded feel"
    ],
    "location": "Southwest Palm Springs",
    "coordinates": {
      "latitude": 33.8066,
      "longitude": -116.5484
    },
    "keywords": [
      "The Mesa homes for sale",
      "Home prices in The Mesa Palm Springs",
      "Moving to The Mesa Palm Springs"
    ],
    "slug": "the-mesa"
  },
  {
    "id": 8,
    "name": "Sunrise Park",
    "description": "Sunrise Park is a vibrant and centrally located neighborhood in Palm Springs, celebrated for its Mid-Century Modern homes, mature landscaping, and proximity to the city’s amenities. Developed primarily in the 1950s and 1960s, this residential area has become a showcase of the architectural innovation that defines Palm Springs, offering a mix of timeless design and contemporary living. Situated in the heart of Palm Springs, Sunrise Park is known for its collection of Mid-Century Modern homes, many of which were designed by prominent architects such as William Krisel and Donald Wexler. These homes are characterized by their clean lines, open floor plans, and large windows that emphasize natural light and indoor-outdoor living. Many properties feature private pools, lush gardens, and spacious patios, ideal for entertaining or relaxing in the desert sunshine. The neighborhood also includes a mix of Ranch-style and contemporary homes, adding to its architectural diversity. Sunrise Park offers a tranquil residential atmosphere while being just minutes from downtown Palm Springs. Its central location provides convenient access to the city’s renowned dining, shopping, and cultural attractions. Residents also enjoy proximity to local parks, including Sunrise Park itself, which offers open green spaces, tennis courts, and community facilities. The neighborhood’s tree-lined streets and walkable layout create a welcoming environment, attracting both full-time residents and seasonal homeowners. The blend of history, design, and convenience has made Sunrise Park a sought-after address for those looking to experience the best of Palm Springs. Whether for its iconic architecture, central location, or peaceful ambiance, Sunrise Park continues to embody the timeless appeal of desert living.",
    "photo": "https://tse2.mm.bing.net/th?id=OIP.AA0AjX3tn9-_ZOMuEK8I1AHaHa&pid=Api",
    "price_range": "$900,000 - $2,500,000",
    "features": [
      "Spacious lots",
      "Close to downtown",
      "Family-friendly"
    ],
    "location": "Central Palm Springs",
    "coordinates": {
      "latitude": 33.8235,
      "longitude": -116.5302
    },
    "keywords": [
      "Sunrise Park homes for sale",
      "Home prices in Sunrise Park Palm Springs",
      "Moving to Sunrise Park Palm Springs"
    ],
    "slug": "sunrise-park"
  },
  {
    "id": 9,
    "name": "Little Tuscany",
    "description": "Little Tuscany is a picturesque and prestigious neighborhood in Palm Springs, renowned for its hillside location, iconic architecture, and breathtaking views of the Coachella Valley. Situated in North Palm Springs at the base of the San Jacinto Mountains, Little Tuscany offers a unique blend of seclusion and convenience, making it one of the city’s most sought-after addresses. This historic neighborhood traces its origins back to the 1930s and 1940s, when it began to attract notable residents, including Hollywood elites and visionaries of modern design. Its name reflects the Mediterranean-inspired charm of the area, characterized by homes perched along winding streets that follow the natural contours of the landscape. Over the years, Little Tuscany has become a haven for architectural enthusiasts, with homes designed by luminaries such as Albert Frey and E. Stewart Williams. The neighborhood features an eclectic mix of architectural styles, including Mid-Century Modern masterpieces, Spanish Revival villas, and contemporary estates. Many properties are nestled into the hillside, offering unparalleled views of the valley below, while others are framed by lush landscaping and natural desert flora. Homes in Little Tuscany are often designed to maximize privacy, with expansive patios, pools, and walls of glass that seamlessly blend indoor and outdoor living spaces. Little Tuscany’s location provides a tranquil retreat while remaining just minutes from the vibrant downtown Palm Springs area. Residents enjoy easy access to world-class dining, shopping, and entertainment, as well as nearby hiking trails that wind through the stunning desert and mountain terrain. The neighborhood’s storied history, architectural significance, and dramatic natural setting make it a favorite among those seeking an elevated Palm Springs lifestyle. Whether for its celebrity legacy, striking architectural diversity, or breathtaking mountain and valley views, Little Tuscany captures the essence of luxury desert living and continues to captivate homeowners and visitors alike.",
    "photo": "https://tse3.mm.bing.net/th?id=OIP.lmI3QmbeCBTLhDlKua5ekwHaEv&pid=Api",
    "price_range": "$1,500,000 - $4,500,000",
    "features": [
      "Hillside homes",
      "Luxury estates",
      "Stunning mountain views"
    ],
    "location": "Northwest Palm Springs",
    "coordinates": {
      "latitude": 33.8424,
      "longitude": -116.5544
    },
    "keywords": [
      "Little Tuscany homes for sale",
      "Home prices in Little Tuscany Palm Springs",
      "Moving to Little Tuscany Palm Springs"
    ],
    "slug": "little-tuscany"
  },
  {
    "id": 10,
    "name": "Warm Sands",
    "description": "Warm Sands is a vibrant and historic neighborhood in Palm Springs, cherished for its eclectic charm, central location, and welcoming community spirit. Situated just southeast of downtown, Warm Sands is one of the city’s oldest neighborhoods, dating back to the early 20th century. It is known for its diverse architectural styles, rich history, and unique character that sets it apart as a one-of-a-kind enclave in the Coachella Valley. The neighborhood features a mix of Spanish Revival, Mid-Century Modern, and contemporary homes, as well as a variety of boutique resorts and vacation rentals. Many of the residences and inns retain their original charm, with adobe-style walls, colorful tilework, and lushly landscaped courtyards that reflect the desert's vibrant aesthetic. Warm Sands has long been a haven for creativity and individuality, attracting artists, visionaries, and those seeking a relaxed yet lively lifestyle. Warm Sands offers a sense of tranquility while being just a short stroll from downtown Palm Springs, with its renowned dining, shopping, and cultural attractions. Its location also provides easy access to the Tahquitz Canyon hiking trails and other outdoor activities. The neighborhood’s tree-lined streets and walkable layout make it a favorite for both full-time residents and visitors who want to experience the best of Palm Springs. In addition to its architectural and historical appeal, Warm Sands is known for its friendly and inclusive atmosphere. The neighborhood has been a cornerstone of Palm Springs’ LGBTQ+ community for decades, hosting events and gatherings that celebrate diversity and foster connection. Whether drawn by its history, central location, or vibrant sense of community, Warm Sands continues to charm those who discover it. Its unique blend of heritage and modern-day appeal makes it a treasured part of Palm Springs' landscape.",
    "photo": "https://tse3.mm.bing.net/th?id=OIP.XOXFGkpfmGwO0wTSDj00RgHaE8&pid=Api",
    "price_range": "$800,000 - $2,000,000",
    "features": [
      "Boutique hotels",
      "Spanish-style homes",
      "Walkable"
    ],
    "location": "Central Palm Springs",
    "coordinates": {
      "latitude": 33.8148,
      "longitude": -116.5437
    },
    "keywords": [
      "Warm Sands homes for sale",
      "Home prices in Warm Sands Palm Springs",
      "Moving to Warm Sands Palm Springs"
    ],
    "slug": "warm-sands"
  },
  {
    "id": 11,
    "name": "Baristo Neighborhood",
    "description": "The Baristo Neighborhood is a historic and diverse district in Palm Springs, celebrated for its rich architectural heritage, vibrant community, and central location. Situated near the heart of downtown, Baristo offers residents and visitors a unique blend of old-world charm and modern convenience, making it one of the city's most dynamic areas. Dating back to the early 20th century, the Baristo Neighborhood played a key role in Palm Springs' development. Many of its homes reflect the architectural evolution of the region, featuring Spanish Revival, Mid-Century Modern, and contemporary designs. Charming bungalows, adobe-style residences, and sleek modernist homes line the streets, creating a visually captivating mix that embodies the essence of Palm Springs. One of the neighborhood’s defining features is its proximity to downtown Palm Springs. Residents enjoy walking distance to an array of dining, shopping, and cultural attractions, including art galleries, theaters, and the bustling Palm Springs VillageFest. This central location also provides easy access to local landmarks such as the Palm Springs Convention Center and the Agua Caliente Cultural Plaza. Baristo is known for its friendly and inclusive atmosphere, attracting a diverse range of residents, from full-time homeowners to seasonal visitors. The neighborhood is also home to several boutique hotels and vacation rentals, contributing to its lively and welcoming vibe. Mature palm trees, well-maintained streets, and stunning mountain views further enhance the neighborhood's appeal. Whether drawn by its historical significance, architectural variety, or unbeatable location, the Baristo Neighborhood offers a quintessential Palm Springs experience. Its unique blend of history, culture, and convenience makes it a cherished part of the Coachella Valley.",
    "photo": "https://tse4.mm.bing.net/th?id=OIP.OmZbJ8TfnlK-LR1lVNG11wAAAA&pid=Api",
    "price_range": "$850,000 - $2,200,000",
    "features": [
      "Historic homes",
      "Modern condos",
      "Proximity to downtown"
    ],
    "location": "Central Palm Springs",
    "coordinates": {
      "latitude": 33.8194,
      "longitude": -116.5468
    },
    "keywords": [
      "Baristo Neighborhood homes for sale",
      "Home prices in Baristo Palm Springs",
      "Moving to Baristo Neighborhood Palm Springs"
    ],
    "slug": "baristo-neighborhood"
  },
  {
    "id": 12,
    "name": "Desert Park Estates",
    "description": "Desert Park Estates is a vibrant and expansive neighborhood in North Palm Springs, known for its diverse range of homes, spacious lots, and relaxed desert living. Situated just minutes from downtown Palm Springs, this area offers a unique blend of affordability, accessibility, and a strong sense of community, making it an attractive option for full-time residents and second-home buyers alike. Developed primarily in the 1960s and 1970s, Desert Park Estates features a mix of architectural styles, including Mid-Century Modern, Ranch-style, and contemporary designs. Many homes have been updated or rebuilt to reflect modern tastes, offering sleek interiors, open floor plans, and amenities like private pools and outdoor entertaining spaces. The larger lot sizes are a hallmark of the neighborhood, providing ample space for landscaping, additions, or creating personalized outdoor retreats. The neighborhood’s location provides convenient access to the best of Palm Springs while maintaining a tranquil, residential atmosphere. Residents enjoy proximity to local parks, hiking trails, and recreational opportunities, as well as the vibrant dining and shopping options in downtown Palm Springs. Its position north of the city center also offers easy access to nearby desert cities and attractions. Desert Park Estates has grown increasingly popular among buyers looking for value and versatility. The neighborhood’s mix of older homes with character and newer builds with modern amenities offers options for a wide range of preferences. With stunning views of the San Jacinto Mountains and a welcoming, laid-back vibe, Desert Park Estates captures the essence of casual desert living. Whether drawn by its variety of homes, larger lot sizes, or excellent location, Desert Park Estates remains a favorite among those seeking a balance of comfort, style, and practicality in the Coachella Valley.",
    "photo": "https://tse3.mm.bing.net/th?id=OIP.r2O6TJs4g4EXe6CgQzj2GgAAAA&pid=Api",
    "price_range": "$750,000 - $1,800,000",
    "features": [
      "Spacious lots",
      "Affordable housing",
      "Family-friendly"
    ],
    "location": "Northeast Palm Springs",
    "coordinates": {
      "latitude": 33.8505,
      "longitude": -116.5281
    },
    "keywords": [
      "Desert Park Estates homes for sale",
      "Home prices in Desert Park Estates Palm Springs",
      "Moving to Desert Park Estates Palm Springs"
    ],
    "slug": "desert-park-estates"
  },
  {
    "id": 13,
    "name": "Chino Canyon",
    "description": "Chino Canyon is a strikingly beautiful and historically rich neighborhood in Palm Springs, known for its dramatic hillside location, eclectic architecture, and breathtaking views of the Coachella Valley. Situated in North Palm Springs, Chino Canyon offers a unique blend of seclusion and accessibility, making it an ideal retreat for those seeking privacy while remaining close to the city’s vibrant attractions. This neighborhood has long been a favorite among artists, architects, and visionaries drawn to its rugged natural surroundings and stunning vistas. Homes in Chino Canyon range from iconic Mid-Century Modern designs to contemporary estates and rustic hillside retreats. Many properties are perched on the canyon slopes, providing panoramic views of the desert floor, the San Jacinto Mountains, and the distant city lights. Architectural features such as open floor plans, expansive glass walls, and private outdoor spaces emphasize harmony with the natural environment. Chino Canyon is also home to the historic Albert Frey House II, a masterpiece of modernist architecture that seamlessly blends into the rugged landscape. The neighborhood’s connection to Palm Springs’ architectural legacy has made it a magnet for design enthusiasts and those seeking homes with character and history. The location of Chino Canyon provides both tranquility and convenience. It is just minutes from downtown Palm Springs, offering easy access to world-class dining, shopping, and cultural attractions. The neighborhood’s proximity to the Tramway makes it a gateway to the cooler climates and scenic trails of Mount San Jacinto State Park, adding to its outdoor appeal. Whether for its architectural significance, stunning natural setting, or serene atmosphere, Chino Canyon captures the essence of luxury desert living. Its combination of dramatic landscapes, rich history, and close-knit community makes it one of Palm Springs’ most sought-after neighborhoods.",
    "photo": "https://tse1.mm.bing.net/th?id=OIP.CIVhXcfW47R1T3wc3YEewgHaFj&pid=Api",
    "price_range": "$1,000,000 - $3,000,000",
    "features": [
      "Mountain views",
      "Elevated terrain",
      "Secluded atmosphere"
    ],
    "location": "North Palm Springs",
    "coordinates": {
      "latitude": 33.8453,
      "longitude": -116.5471
    },
    "keywords": [
      "Chino Canyon homes for sale",
      "Home prices in Chino Canyon Palm Springs",
      "Moving to Chino Canyon Palm Springs"
    ],
    "slug": "chino-canyon"
  },
  {
    "id": 14,
    "name": "Ruth Hardy Park / Movie Colony East",
    "description": "Ruth Hardy Park, often referred to as Movie Colony East, is a charming and historic neighborhood in Palm Springs, celebrated for its central location, welcoming atmosphere, and diverse architectural styles. Situated just east of the iconic Movie Colony neighborhood, this area shares much of its storied history and appeal, offering a quieter yet equally desirable residential experience. The neighborhood traces its roots to the mid-20th century, a time when Palm Springs was becoming a retreat for Hollywood’s elite. While its sister neighborhood, The Movie Colony, attracted high-profile stars, Movie Colony East became a haven for artists, writers, and professionals seeking the relaxed desert lifestyle. The neighborhood’s proximity to Ruth Hardy Park—a beloved community park with tennis courts, playgrounds, and open green spaces—has been a defining feature, making it a hub for recreation and social gatherings. Homes in Movie Colony East reflect the architectural diversity of Palm Springs, with a mix of Mid-Century Modern, Spanish Revival, and Ranch-style designs. Many properties feature private pools, lush landscaping, and large windows that frame views of the San Jacinto Mountains. The tree-lined streets and well-maintained homes create a picturesque setting, ideal for full-time residents and seasonal visitors alike. The neighborhood’s central location offers unparalleled convenience, with downtown Palm Springs just minutes away. Residents enjoy easy access to world-class dining, boutique shopping, and cultural attractions, including art galleries and theaters. The nearby Ruth Hardy Park adds a community-focused element to the area, providing opportunities for outdoor activities and events. Movie Colony East has become a sought-after address for those seeking a balance of history, style, and modern amenities. Its inviting atmosphere, scenic mountain views, and proximity to Palm Springs’ vibrant downtown make it a quintessential desert neighborhood that continues to capture the hearts of homeowners and visitors alike.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20200902200642546352000000-o.jpg",
    "price_range": "$750,000 - $2,000,000",
    "features": [
      "Proximity to parks",
      "Historic homes",
      "Affordable options"
    ],
    "location": "Central Palm Springs",
    "coordinates": {
      "latitude": 33.8308,
      "longitude": -116.5327
    },
    "keywords": [
      "Ruth Hardy Park homes for sale",
      "Home prices in Ruth Hardy Park Palm Springs",
      "Moving to Ruth Hardy Park Palm Springs"
    ],
    "slug": "ruth-hardy-park-movie-colony-east"
  },
  {
    "id": 15,
    "name": "Andreas Hills",
    "description": "Andreas Hills is a prestigious neighborhood in South Palm Springs, renowned for its luxurious homes, serene atmosphere, and breathtaking mountain views. Often referred to as the 'Bel Air of Palm Springs,' Andreas Hills offers a tranquil retreat surrounded by the rugged beauty of the San Jacinto Mountains and the lush greenery of the Indian Canyons. Developed primarily in the 1970s and 1980s, Andreas Hills is home to a collection of custom-built residences and estates that reflect a blend of Mid-Century Modern, contemporary, and Mediterranean architectural styles. These homes are characterized by their spacious layouts, high-end finishes, and seamless integration with the natural desert landscape. Many properties feature private pools, expansive patios, and floor-to-ceiling windows that frame the stunning mountain vistas and allow for abundant natural light. The neighborhood is known for its larger lot sizes, which provide privacy and a sense of exclusivity. Gated communities and meticulously maintained streets add to the area’s upscale appeal, making it a sought-after destination for discerning buyers. Andreas Hills’ location at the southern end of Palm Springs provides residents with easy access to some of the best hiking trails in the Coachella Valley, including the Indian Canyons and the nearby Murray Canyon. The area is also close to the Indian Canyons Golf Resort, a premier destination for golfers seeking championship courses set amidst spectacular desert scenery. Despite its serene and secluded setting, Andreas Hills is just a short drive from downtown Palm Springs, where residents can enjoy world-class dining, boutique shopping, and cultural attractions. The neighborhood’s combination of natural beauty, architectural elegance, and convenient location makes it one of the most desirable areas in the Coachella Valley. Whether for its dramatic landscapes, luxurious homes, or peaceful ambiance, Andreas Hills embodies the pinnacle of desert living in Palm Springs.",
    "photo": "https://tse3.mm.bing.net/th?id=OIP.b-KSLZRg0nnQnKflDFi3hAHaE7&pid=Api",
    "price_range": "$2,000,000 - $6,000,000",
    "features": [
      "Luxury homes",
      "Large lots",
      "Mountain views"
    ],
    "location": "South Palm Springs",
    "coordinates": {
      "latitude": 33.7853,
      "longitude": -116.5131
    },
    "keywords": [
      "Andreas Hills homes for sale",
      "Home prices in Andreas Hills Palm Springs",
      "Moving to Andreas Hills Palm Springs"
    ],
    "slug": "andreas-hills"
  },
  {
    "id": 16,
    "name": "Melody Ranch",
    "description": "Melody Ranch is a historic and picturesque neighborhood in Palm Springs, cherished for its old Hollywood charm, unique architectural character, and serene desert ambiance. Located in South Palm Springs, Melody Ranch offers a delightful mix of mid-20th-century homes and modern updates, creating a neighborhood that feels both timeless and vibrant. The neighborhood’s origins are deeply tied to the golden age of Palm Springs as a retreat for Hollywood stars. Many of the homes in Melody Ranch were built in the 1940s and 1950s, showcasing traditional Ranch-style architecture that reflects the casual yet sophisticated lifestyle of the era. Over the years, many properties have been lovingly restored or updated, blending classic design elements with contemporary amenities like private pools, outdoor entertainment areas, and modern interiors. Set against the stunning backdrop of the San Jacinto Mountains, Melody Ranch offers breathtaking views and an intimate, residential atmosphere. Tree-lined streets and beautifully landscaped yards create a sense of tranquility that attracts both full-time residents and seasonal visitors. The neighborhood’s larger lots and spacious homes provide ample room for entertaining and enjoying the desert’s year-round sunshine. Melody Ranch is ideally situated just minutes from downtown Palm Springs, giving residents convenient access to world-class dining, boutique shopping, and cultural attractions. The nearby Tahquitz Canyon and Indian Canyons also offer outdoor enthusiasts easy access to hiking trails and the area’s natural beauty. Known for its rich history and welcoming vibe, Melody Ranch continues to be a sought-after neighborhood for those seeking a blend of heritage, charm, and modern comfort. Its peaceful environment, architectural variety, and prime location make it a hidden gem in the Coachella Valley.",
    "photo": "https://tse3.mm.bing.net/th?id=OIP.0dgpF45cGxXUBjZv58ibYgHaEq&pid=Api",
    "price_range": "$850,000 - $1,800,000",
    "features": [
      "Mid-century homes",
      "Suburban atmosphere",
      "Close to downtown"
    ],
    "location": "Central Palm Springs",
    "coordinates": {
      "latitude": 33.8246,
      "longitude": -116.5322
    },
    "keywords": [
      "Melody Ranch homes for sale",
      "Home prices in Melody Ranch Palm Springs",
      "Moving to Melody Ranch Palm Springs"
    ],
    "slug": "melody-ranch"
  },
  {
    "id": 17,
    "name": "Tahquitz River Estates",
    "description": "Tahquitz River Estates is one of Palm Springs’ most charming and historic neighborhoods, known for its rich architectural heritage, scenic location, and vibrant community. Situated just south of downtown Palm Springs, this neighborhood is bordered by the iconic Tahquitz Creek, which inspired its name and adds to its natural beauty and tranquility. Developed primarily in the 1930s through the 1960s, Tahquitz River Estates showcases a diverse range of architectural styles, from Spanish Revival and Mid-Century Modern to traditional Ranch-style homes. Many of these residences feature signature elements such as stucco exteriors, red tile roofs, and large picture windows that embrace the abundant desert light and stunning views of the San Jacinto Mountains. The neighborhood has seen a resurgence in popularity, with many homes thoughtfully restored or upgraded to blend vintage charm with modern amenities. The tree-lined streets of Tahquitz River Estates are framed by lush landscaping and vibrant desert flora, creating a serene and inviting atmosphere. Larger lots and private yards with pools and outdoor entertaining spaces are common, making it a favorite among those seeking a quintessential Palm Springs lifestyle. The neighborhood’s proximity to downtown ensures convenient access to world-class dining, shopping, and cultural attractions, while still offering a peaceful retreat from the city’s energy. Tahquitz River Estates has long been appreciated for its sense of community, with many full-time residents and vacation homeowners drawn to its walkable streets and welcoming vibe. Its historic character, architectural diversity, and stunning natural surroundings make it one of Palm Springs’ most desirable neighborhoods. Whether for its timeless appeal, central location, or scenic charm, Tahquitz River Estates continues to captivate homeowners and visitors alike, offering an ideal blend of history, style, and desert living.",
    "photo": "https://ssl.cdn-redfin.com/photo/40/islphoto/343/genIslnoResize.24-469343_1_1.jpg",
    "price_range": "$900,000 - $2,800,000",
    "features": [
      "Tree-lined streets",
      "Historic homes",
      "Large lots"
    ],
    "location": "Central Palm Springs",
    "coordinates": {
      "latitude": 33.8123,
      "longitude": -116.5367
    },
    "keywords": [
      "Tahquitz River Estates homes for sale",
      "Home prices in Tahquitz River Estates Palm Springs",
      "Moving to Tahquitz River Estates Palm Springs"
    ],
    "slug": "tahquitz-river-estates"
  },
  {
    "id": 18,
    "name": "Racquet Club Estates",
    "description": "Racquet Club Estates is a historic and architecturally significant neighborhood in Palm Springs, renowned for its iconic Mid-Century Modern homes, vibrant community, and rich connection to the city’s Golden Age. Situated in North Palm Springs, this neighborhood traces its roots to the 1950s when it was developed by the Alexander Construction Company in collaboration with renowned architect William Krisel. Racquet Club Estates played a pivotal role in shaping the modernist movement that has become synonymous with Palm Springs. The neighborhood’s hallmark is its collection of classic Mid-Century Modern homes, featuring clean lines, butterfly and flat roofs, clerestory windows, and open floor plans that blur the boundaries between indoor and outdoor spaces. Many of these homes have been thoughtfully restored, showcasing their original character while incorporating modern updates to suit contemporary lifestyles. Private pools, spacious yards, and stunning views of the San Jacinto Mountains enhance the appeal of these residences, making them perfect for entertaining and enjoying the desert’s year-round sunshine. Racquet Club Estates’ history is intertwined with the glamour of Palm Springs’ Hollywood past. Located near the iconic Racquet Club Resort, a favored destination for stars like Marilyn Monroe and Frank Sinatra, the neighborhood became a hub for those seeking a modern yet relaxed desert lifestyle. Today, Racquet Club Estates is a vibrant community that attracts both full-time residents and seasonal homeowners. Its central location offers easy access to downtown Palm Springs, with its world-class dining, shopping, and cultural attractions, as well as nearby hiking trails and recreational opportunities. The neighborhood also hosts events and gatherings that celebrate its Mid-Century Modern heritage, fostering a strong sense of community among residents. Whether for its architectural significance, historic charm, or convenient location, Racquet Club Estates continues to be a beloved neighborhood that embodies the timeless allure of Palm Springs.",
    "photo": "https://tse1.mm.bing.net/th?id=OIP.5EwjheTH_7Y9zzCu-AZzhgHaE7&pid=Api",
    "price_range": "$800,000 - $2,000,000",
    "features": [
      "Mid-century modern homes",
      "Post-and-beam construction",
      "Historic significance"
    ],
    "location": "North Palm Springs",
    "coordinates": {
      "latitude": 33.8542,
      "longitude": -116.5438
    },
    "keywords": [
      "Racquet Club Estates homes for sale",
      "Home prices in Racquet Club Estates Palm Springs",
      "Moving to Racquet Club Estates Palm Springs"
    ],
    "slug": "racquet-club-estates"
  },
  {
    "id": 19,
    "name": "El Mirador",
    "description": "El Mirador is a historic and picturesque neighborhood in Palm Springs, celebrated for its old-world charm, architectural elegance, and central location. Situated near the heart of the city, this neighborhood takes its name from the iconic El Mirador Hotel, a glamorous desert retreat built in the 1920s that attracted Hollywood stars and international visitors. Although the original hotel structure no longer stands, the legacy of its grandeur lives on in the surrounding community. The homes in El Mirador reflect a rich architectural heritage, with styles ranging from Spanish Revival to Mid-Century Modern and contemporary designs. Many residences feature classic details such as red tile roofs, arched doorways, and stucco exteriors, blending seamlessly with the lush desert landscaping and mature palm trees that line the streets. Larger estate homes and charming bungalows offer a mix of luxury and intimacy, catering to a wide range of lifestyles. El Mirador’s central location makes it one of the most convenient neighborhoods in Palm Springs. Residents are within walking or biking distance to downtown, where they can enjoy the city’s renowned dining, shopping, and cultural attractions. Nearby landmarks include Ruth Hardy Park, with its tennis courts, open green spaces, and playgrounds, and the Palm Springs Convention Center, which hosts events and gatherings throughout the year. The neighborhood’s tranquil setting, combined with its rich history and architectural diversity, has made it a favorite among full-time residents, vacation homeowners, and those seeking an authentic Palm Springs experience. El Mirador offers a harmonious blend of historic charm and modern convenience, embodying the timeless allure of desert living. Whether drawn by its storied past, convenient location, or unique homes, El Mirador continues to captivate those looking for a vibrant and elegant lifestyle in Palm Springs.",
    "photo": "https://tse2.mm.bing.net/th?id=OIP.oNPn2FOkyy-FMQMck5rGQAHaEr&pid=Api",
    "price_range": "$1,200,000 - $3,500,000",
    "features": [
      "Custom homes",
      "Historic charm",
      "Close to downtown"
    ],
    "location": "Central Palm Springs",
    "coordinates": {
      "latitude": 33.8321,
      "longitude": -116.5432
    },
    "keywords": [
      "El Mirador homes for sale",
      "Home prices in El Mirador Palm Springs",
      "Moving to El Mirador Palm Springs"
    ],
    "slug": "el-mirador"
  },
  {
    "id": 20,
    "name": "Araby Commons",
    "description": "Araby Commons is a charming and exclusive neighborhood in South Palm Springs, known for its tranquil ambiance, architectural diversity, and proximity to the stunning natural beauty of the surrounding desert landscape. Situated near the iconic Araby Cove and nestled against the base of the San Jacinto Mountains, this neighborhood offers a blend of seclusion and convenience, making it a sought-after destination for homeowners seeking a serene retreat. Developed primarily in the mid-20th century, Araby Commons features a variety of home styles, including Mid-Century Modern, Ranch-style, and contemporary designs. Many properties are set on spacious lots, offering privacy and room for lush landscaping, private pools, and outdoor entertaining spaces. Homes in this neighborhood often highlight the indoor-outdoor living that Palm Springs is famous for, with large windows and open floor plans that frame breathtaking views of the mountains and desert. The location of Araby Commons provides easy access to some of Palm Springs’ best hiking trails, including those in the nearby Araby Trail, which offers panoramic views of the valley. The neighborhood is also conveniently located near premier shopping and dining destinations, including Smoke Tree Village and the bustling downtown Palm Springs area. Residents enjoy the perfect balance of a peaceful residential environment and the amenities of city living. Araby Commons has a reputation for its friendly community atmosphere and understated elegance. Its unique combination of natural beauty, architectural variety, and close proximity to both outdoor recreation and urban conveniences makes it a treasured neighborhood in Palm Springs. Whether for its serene setting, striking views, or architectural charm, Araby Commons captures the essence of desert living and remains a favorite for those seeking a private yet connected lifestyle in the Coachella Valley.",
    "photo": "https://tse1.mm.bing.net/th?id=OIP.0r2_x5WWc1z9s74mtLtllgHaFx&pid=Api",
    "price_range": "$950,000 - $2,500,000",
    "features": [
      "Hiking trails",
      "Outdoor recreation",
      "Scenic surroundings"
    ],
    "location": "South Palm Springs",
    "coordinates": {
      "latitude": 33.8045,
      "longitude": -116.5296
    },
    "keywords": [
      "Araby Commons homes for sale",
      "Home prices in Araby Commons Palm Springs",
      "Moving to Araby Commons Palm Springs"
    ],
    "slug": "araby-commons"
  },
  {
    "id": 21,
    "name": "Little Beverly Hills",
    "description": "Little Beverly Hills is a delightful and historic neighborhood in Palm Springs, known for its Mid-Century Modern charm, quiet streets, and welcoming community vibe. Situated in South Palm Springs near the Tahquitz Creek Golf Resort, this neighborhood offers a blend of classic desert architecture and a serene residential setting, making it a sought-after destination for homeowners and vacationers alike. Developed in the 1950s and 1960s, Little Beverly Hills features a collection of Mid-Century Modern homes, many of which were built by the iconic Alexander Construction Company. These homes are characterized by their clean lines, open floor plans, and distinctive rooflines, all designed to harmonize with the desert environment. Large windows and sliding glass doors create a seamless connection between indoor and outdoor spaces, allowing residents to enjoy the stunning mountain views and year-round sunshine. The neighborhood’s quiet streets are lined with mature palm trees and vibrant desert landscaping, creating a peaceful and picturesque environment. Homes are situated on spacious lots, many featuring private pools and outdoor entertaining areas that embrace the indoor-outdoor lifestyle for which Palm Springs is renowned. Little Beverly Hills enjoys a prime location just minutes from downtown Palm Springs, providing easy access to the city’s renowned dining, shopping, and cultural attractions. The neighborhood is also adjacent to the Tahquitz Creek Golf Resort, offering residents the opportunity to enjoy two championship golf courses and scenic walking trails. Known for its friendly and welcoming atmosphere, Little Beverly Hills attracts a mix of full-time residents, seasonal homeowners, and architecture enthusiasts. Its combination of iconic design, natural beauty, and convenient location makes it a beloved neighborhood in the Coachella Valley. Whether for its architectural significance, tranquil ambiance, or proximity to local amenities, Little Beverly Hills captures the essence of classic Palm Springs living and continues to be a cherished community in the desert.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20210222210209232642000000-o.jpg",
    "price_range": "$800,000 - $1,500,000",
    "features": [
        "Iconic mid-century modern architecture",
        "Proximity to downtown Palm Springs",
        "Adjacent to Mesquite Golf & Country Club",
        "Scenic mountain views",
        "Walkable streets and central location"
    ],
    "location": "Central Palm Springs",
    "coordinates": {
        "latitude": 33.8116,
        "longitude": -116.5241
    },
    "keywords": [
        "Little Beverly Hills homes for sale",
        "Home prices in Little Beverly Hills Palm Springs",
        "Moving to Little Beverly Hills Palm Springs"
    ],
    "slug": "little-beverly-hills"
}
]