[
  {
    "id": 1,
    "name": "Bighorn Golf Club",
    "description": "Bighorn Golf Club, located in Palm Desert, CA, is an exclusive residential community renowned for its luxurious lifestyle and exceptional golf experiences. The community features two championship golf courses designed to challenge players of all skill levels while showcasing breathtaking views of the Santa Rosa Mountains and the Coachella Valley. Bighorn offers an array of upscale amenities, including a state-of-the-art clubhouse, a spa and wellness center, fine dining options, and concierge services. The community's homes are architecturally distinct, offering contemporary designs and high-end finishes that cater to a sophisticated clientele. Residents enjoy a vibrant social calendar, access to hiking trails, and close proximity to Palm Desert's shopping and cultural attractions. Bighorn Golf Club embodies the pinnacle of desert living, combining world-class recreation with a sense of exclusivity and refinement.",
    "photo": "https://imageio.forbes.com/specials-images/imageserve/5d06bba64c687b000859c58d/BIGHORN-s-Clubhouse-and-Penthouse-residences/960x0.jpg?format=jpg&width=960",
    "features": [
      "Luxury homes",
      "Championship golf courses",
      "Private clubhouse"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.6872,
      "longitude": -116.4008
    },
    "keywords": [
      "Bighorn Golf Club homes for sale",
      "Living in Bighorn Golf Club",
      "Luxury real estate in Palm Desert"
    ],
    "slug": "bighorn-golf-club"
  },
  {
    "id": 2,
    "name": "Cahuilla Hills",
    "description": "Cahuilla Hills is a secluded neighborhood in Palm Desert, CA, offering expansive properties and a serene desert environment. Nestled in the foothills of the Santa Rosa Mountains, this area is known for its large lots, unique custom homes, and breathtaking views of the surrounding landscape. Cahuilla Hills provides a blend of rural tranquility and convenient access to Palm Desert's shopping, dining, and cultural attractions. With nearby hiking trails and natural open spaces, it appeals to outdoor enthusiasts and those seeking a private retreat. The neighborhood's distinctive charm lies in its blend of natural beauty, spacious properties, and proximity to city amenities, making it a sought-after enclave in the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20230419191742538873000000-o.jpg",
    "features": [
      "Large lots",
      "Equestrian properties",
      "Proximity to nature"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.705,
      "longitude": -116.4083
    },
    "keywords": [
      "Cahuilla Hills homes for sale",
      "Living in Cahuilla Hills",
      "Equestrian properties in Palm Desert"
    ],
    "slug": "cahuilla-hills"
  },
  {
    "id": 3,
    "name": "Hidden Palms",
    "description": "Hidden Palms is a gated condominium community featuring four swimming pools, tennis courts, and a picturesque lake. Its close proximity to the El Paseo shopping district makes it a convenient location for those seeking a vibrant lifestyle.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20230128004104818694000000-o.jpg",
    "features": [
      "Gated community",
      "Swimming pools",
      "Tennis courts"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.7225,
      "longitude": -116.373
    },
    "keywords": [
      "Hidden Palms condos for sale",
      "Living in Hidden Palms",
      "Palm Desert gated communities"
    ],
    "slug": "hidden-palms"
  },
  {
    "id": 4,
    "name": "Lantana",
    "description": "Lantana is a centrally located neighborhood comprising 64 homes nestled on four cul-de-sacs. Many homes feature private swimming pools, and the community right next to Palm Desert High School, making it ideal for families with kids in High School.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20230502012131313902000000-o.jpg",
    "features": [
      "Family-friendly",
      "Private swimming pools",
      "Central location"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.7348,
      "longitude": -116.361
    },
    "keywords": [
      "Lantana homes for sale",
      "Living in Lantana",
      "Family neighborhoods in Palm Desert"
    ],
    "slug": "lantana"
  },
  {
    "id": 5,
    "name": "Chaparral Country Club",
    "description": "Chaparral Country Club is known as one of the best-kept secrets in the valley, offering an executive golf course, tennis courts, clubhouse, and 21 swimming pools. It's within walking distance to local schools and offers a range of condominiums.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20230413184931810462000000-o.jpg",
    "features": [
      "Golf course",
      "Tennis courts",
      "Multiple swimming pools"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.7512,
      "longitude": -116.3587
    },
    "keywords": [
      "Chaparral Country Club condos for sale",
      "Living in Chaparral Country Club",
      "Golf communities in Palm Desert"
    ],
    "slug": "chaparral-country-club"
  },
  {
    "id": 6,
    "name": "Ironwood Country Club",
    "description": "Ironwood Country Club is an exclusive, gated community located in Palm Desert, CA, offering a luxurious lifestyle and world-class amenities. Nestled against the Santa Rosa Mountains, the club features two premier golf courses designed to challenge and inspire players of all levels. Ironwood also provides top-tier facilities, including a state-of-the-art fitness center, a spa, tennis courts, and fine dining venues. The community boasts a range of architectural styles, from elegant condominiums to expansive custom homes, many offering stunning views of the surrounding mountains and golf courses. Its prime location provides residents with convenient access to Palm Desert’s shopping, dining, and cultural attractions. Ironwood Country Club combines natural beauty, upscale living, and a vibrant social scene, making it one of the Coachella Valley's most sought-after residential communities.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20230307195111959221000000-o.jpg",
    "features": [
      "Private golf courses",
      "Gated community",
      "Diverse housing options"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.6998,
      "longitude": -116.3825
    },
    "keywords": [
      "Ironwood Country Club homes for sale",
      "Living in Ironwood Country Club",
      "Palm Desert golf communities"
    ],
    "slug": "ironwood-country-club"
  },
  {
    "id": 7,
    "name": "Indian Ridge Country Club",
    "description": "Indian Ridge Country Club, located in Palm Desert, CA, is a premier gated community known for its exceptional amenities and active lifestyle. This community features two Arnold Palmer-designed championship golf courses, providing stunning views and a rewarding experience for golf enthusiasts. Indian Ridge also offers an array of luxury amenities, including a fitness and wellness center, a full-service spa, tennis and pickleball courts, and multiple dining options. The residences range from stylish condominiums to spacious custom homes, many overlooking the golf courses or the surrounding desert landscape. With a vibrant social calendar and a welcoming atmosphere, Indian Ridge Country Club is ideal for those seeking an upscale, community-focused lifestyle in the heart of the Coachella Valley.",
    "photo": "https://www.indianridgecc.com/images/dynamic/getImage.gif?ID=100002824",
    "features": [
      "World-class golf courses",
      "Tennis club",
      "Fitness facilities"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.7489,
      "longitude": -116.3332
    },
    "keywords": [
      "Indian Ridge Country Club homes for sale",
      "Living in Indian Ridge",
      "Luxury communities in Palm Desert"
    ],
    "slug": "indian-ridge-country-club"
  },
  {
    "id": 8,
    "name": "South Palm Desert",
    "description": "South Palm Desert is a highly sought-after area known for its scenic surroundings, upscale living, and convenient location near El Paseo, the region’s premier shopping and dining district. This community offers a mix of mid-century modern homes, custom estates, and contemporary properties, many with spacious lots and stunning views of the Santa Rosa Mountains. Residents enjoy easy access to hiking trails, world-class golf courses, and local parks, making it ideal for those seeking an active desert lifestyle. With its blend of natural beauty and proximity to amenities, South Palm Desert provides a desirable setting for homeowners in the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20231102160336932774000000-o.jpg",
    "features": [
      "Spacious lots",
      "Top-rated schools",
      "Mountain views"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.7153,
      "longitude": -116.3745
    },
    "keywords": [
      "South Palm Desert homes for sale",
      "Living in South Palm Desert",
      "No HOA neighborhoods in Palm Desert"
    ],
    "slug": "south-palm-desert"
  },
  {
    "id": 9,
    "name": "Sun City Palm Desert",
    "description": "Sun City Palm Desert is a renowned 55+ active adult community located in Palm Desert, CA, designed for those seeking an active and social lifestyle. Spanning over 1,600 acres, the community features nearly 5,000 homes, two championship golf courses, multiple swimming pools, fitness centers, tennis courts, and over 80 clubs and activities. Residents enjoy beautifully landscaped grounds, a full calendar of events, and convenient access to nearby shopping, dining, and entertainment in the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20230201174755573084000000-o.jpg",
    "features": [
      "55+ community",
      "Golf courses",
      "Clubhouses"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.7726,
      "longitude": -116.2859
    },
    "keywords": [
      "Sun City Palm Desert homes for sale",
      "Living in Sun City Palm Desert",
      "Active adult communities in Palm Desert"
    ],
    "slug": "sun-city-palm-desert"
  },
  {
    "id": 11,
    "name": "The Summit",
    "description": "The Summit is an upscale residential neighborhood in Palm Desert, CA, known for its custom homes, spacious lots, and breathtaking views of the surrounding mountains. Situated in a desirable hillside location, The Summit offers a serene and private environment while remaining conveniently close to the heart of Palm Desert. The neighborhood provides easy access to El Paseo, the city’s premier shopping and dining district, as well as renowned golf courses, hiking trails, and cultural attractions. With its blend of luxury and proximity to amenities, The Summit is a sought-after community in the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20221223190216704886000000-o.jpg",
    "features": [
      "Custom-built homes",
      "Panoramic views",
      "Spacious lots"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.6999,
      "longitude": -116.4082
    },
    "keywords": [
      "The Summit homes for sale",
      "Living in The Summit Palm Desert",
      "Luxury homes in Palm Desert"
    ],
    "slug": "the-summit"
  },
  {
    "id": 13,
    "name": "Silver Spur Ranch",
    "description": "Silver Spur Ranch is a charming residential community located in Palm Desert, CA, known for its mid-century architecture, spacious lots, and tranquil desert ambiance. Nestled near the base of the Santa Rosa Mountains, the neighborhood offers stunning views and easy access to hiking trails in the surrounding natural areas. Its location places residents close to The Living Desert Zoo and Gardens, El Paseo shopping district, and a variety of dining and entertainment options. Silver Spur Ranch combines vintage appeal with modern convenience, making it a sought-after area in the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20220925034836847637000000-o.jpg",
    "features": [
      "Mid-century homes",
      "Proximity to hiking",
      "Tranquil environment"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.7098,
      "longitude": -116.3764
    },
    "keywords": [
      "Silver Spur Ranch homes for sale",
      "Living in Silver Spur Ranch Palm Desert",
      "Historic neighborhoods in Palm Desert"
    ],
    "slug": "silver-spur-ranch"
  },
  {
    "id": 15,
    "name": "Desert Falls Country Club",
    "description": "Desert Falls Country Club is a premier gated community in Palm Desert, CA, offering an exceptional blend of resort-style living and recreational amenities. At its heart lies an 18-hole championship golf course, designed by Ron Fream, known for its challenging layout and stunning views of the surrounding desert landscape. The community features a mix of single-family homes, condos, and townhomes, many with golf course or mountain views. Residents enjoy access to a clubhouse, fitness center, tennis and pickleball courts, swimming pools, and a vibrant social calendar. Conveniently located near shopping, dining, and cultural attractions, Desert Falls Country Club provides an ideal setting for an active and luxurious lifestyle in the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20231013181724452407000000-o.jpg",
    "features": [
      "Championship golf",
      "Fitness center",
      "Tennis courts"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.7484,
      "longitude": -116.3582
    },
    "keywords": [
      "Desert Falls Country Club homes for sale",
      "Living in Desert Falls Palm Desert",
      "Golf communities in Palm Desert"
    ],
    "slug": "desert-falls-country-club"
  },
  {
    "id": 16,
    "name": "Palm Valley Country Club",
    "description": "Palm Valley Country Club, located in Palm Desert, CA, is a vibrant gated community renowned for its outstanding amenities and active lifestyle. The community features two Ted Robinson-designed golf courses—a challenging championship course and a shorter executive course—offering options for golfers of all skill levels. Palm Valley’s excellent fitness club includes modern equipment, group classes, and wellness services, complementing its premier recreational offerings. Residents and guests enjoy access to multiple swimming pools, tennis and pickleball courts, and a luxurious clubhouse with dining and social events. Notably, Palm Valley allows short-term rentals, making it a popular choice for seasonal visitors and investment opportunities. With its resort-style living and convenient location near Palm Desert’s attractions, Palm Valley Country Club is a standout in the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20230818004520039243000000-o.jpg",
    "features": [
      "Resort-style living",
      "Championship golf courses",
      "Gated community"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.7537,
      "longitude": -116.3379
    },
    "keywords": [
      "Palm Valley Country Club homes for sale",
      "Living in Palm Valley Country Club",
      "Luxury living in Palm Desert"
    ],
    "slug": "palm-valley-country-club"
  },
  {
    "id": 18,
    "name": "The Lakes Country Club",
    "description": "The Lakes Country Club, located in Palm Desert, CA, is a prestigious gated community known for its scenic beauty, active lifestyle, and world-class amenities. The community features 27 holes of championship golf designed by Ted Robinson, offering lush fairways, challenging water features, and stunning mountain views. Residents enjoy an extensive range of amenities, including a state-of-the-art fitness center, tennis and pickleball courts, and a luxurious clubhouse with fine dining and social activities. The Lakes also boasts 44 pools and spas, ensuring relaxation and recreation are always within reach. Conveniently situated near Palm Desert’s shopping, dining, and entertainment, The Lakes Country Club combines resort-style living with a warm and welcoming community atmosphere.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20230223034201629162000000-o.jpg",
    "features": [
      "27-hole golf course",
      "Lush landscaping",
      "Sparkling lakes"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.7476,
      "longitude": -116.3618
    },
    "keywords": [
      "The Lakes Country Club homes for sale",
      "Living in The Lakes Palm Desert",
      "Golf communities in Palm Desert"
    ],
    "slug": "the-lakes-country-club"
  },
  {
    "id": 20,
    "name": "Vista Paseo",
    "description": "Vista Paseo is an exclusive residential community located in Palm Desert, CA, offering a mix of custom homes and modern architectural designs. Nestled against the Santa Rosa Mountains, the neighborhood provides breathtaking views and a serene desert ambiance. Vista Paseo is known for its spacious lots, privacy, and proximity to outdoor recreation, including hiking trails and nature reserves. The community's location places it just minutes from El Paseo, Palm Desert’s premier shopping and dining district, as well as top-tier schools and cultural attractions. With its blend of luxury, natural beauty, and convenience, Vista Paseo is a sought-after destination for discerning homebuyers in the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20230921021554305802000000-o.jpg",
    "features": [
      "Custom homes",
      "Spacious lots",
      "Mountain views"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.6972,
      "longitude": -116.4032
    },
    "keywords": [
      "Vista Paseo homes for sale",
      "Living in Vista Paseo Palm Desert",
      "Luxury homes in Palm Desert"
    ],
    "slug": "vista-paseo"
  },
  {
    "id": 21,
    "name": "Montecito Estates",
    "description": "Montecito Estates is a private gated community in Palm Desert, CA, known for its luxurious homes, spacious lots, and tranquil setting. The neighborhood features contemporary and Mediterranean-style residences, many offering high-end finishes and stunning views of the surrounding mountains. Montecito Estates is conveniently located near the renowned El Paseo shopping district, providing easy access to fine dining, boutique shopping, and entertainment options. Residents also enjoy proximity to top-rated schools, golf courses, and outdoor recreation, including hiking trails and parks. With its combination of elegance, privacy, and prime location, Montecito Estates offers an exceptional lifestyle in the heart of the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20230113221259669162000000-o.jpg",
    "features": [
      "Contemporary homes",
      "Private yards",
      "Boutique gated community"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.7346,
      "longitude": -116.3759
    },
    "keywords": [
      "Montecito Estates homes for sale",
      "Living in Montecito Estates Palm Desert",
      "Modern homes in Palm Desert"
    ],
    "slug": "montecito-estates"
  },
  {
    "id": 22,
    "name": "Desert Willow",
    "description": "Desert Willow is an upscale community in Palm Desert, CA, celebrated for its luxurious resort-style living and prime location. The neighborhood is centered around the Desert Willow Golf Resort, featuring two acclaimed championship golf courses designed to challenge and delight players of all skill levels. Residents enjoy access to the community’s state-of-the-art amenities, including a clubhouse, dining options, and a fitness center. Desert Willow’s location provides easy access to Palm Desert’s premier attractions, including El Paseo, shopping, dining, and cultural venues. With stunning mountain views, meticulously maintained landscapes, and a serene desert ambiance, Desert Willow is a sought-after destination for those seeking an elegant and active lifestyle in the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20230217054002920397000000-o.jpg",
    "features": [
      "Luxury homes",
      "Golf resort access",
      "World-class amenities"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.7442,
      "longitude": -116.3539
    },
    "keywords": [
      "Desert Willow homes for sale",
      "Living in Desert Willow Palm Desert",
      "Luxury golf communities in Palm Desert"
    ],
    "slug": "desert-willow"
  },
  {
    "id": 23,
    "name": "The Gallery",
    "description": "The Gallery is a gated community in Palm Desert, CA, offering modern homes with stylish designs and high-end finishes. Known for its well-manicured landscaping and family-friendly atmosphere, The Gallery features spacious single-family residences, many with private pools and outdoor living spaces. Conveniently located near shopping, dining, and entertainment options, the community provides easy access to popular destinations such as El Paseo and top-rated schools. With its blend of contemporary living, community charm, and proximity to Coachella Valley attractions, The Gallery is an ideal neighborhood for homeowners seeking both comfort and convenience.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20220720043832362042000000-o.jpg",
    "features": [
      "Modern homes",
      "Energy-efficient designs",
      "Stylish community"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.7467,
      "longitude": -116.3643
    },
    "keywords": [
      "The Gallery homes for sale",
      "Living in The Gallery Palm Desert",
      "Modern communities in Palm Desert"
    ],
    "slug": "the-gallery"
  },
  
  {
    "id": 26,
    "name": "Villa Portofino",
    "description": "Villa Portofino is a premier 55+ active adult community located in Palm Desert, CA, offering a luxurious and maintenance-free lifestyle. The community features elegant, Mediterranean-inspired condominiums and villas with modern amenities and beautiful architectural details. Residents enjoy access to a grand clubhouse, complete with a fitness center, movie theater, bistro, and fine dining restaurant. Villa Portofino also offers a resort-style pool, walking trails, and a full calendar of social activities and events. Conveniently located near shopping, dining, and cultural attractions, including the El Paseo district, Villa Portofino combines sophistication, convenience, and a vibrant social environment in the heart of the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20230224201320453738000000-o.jpg",
    "features": [
      "55+ community",
      "Resort-style amenities",
      "Luxury condos"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.7471,
      "longitude": -116.3613
    },
    "keywords": [
      "Villa Portofino homes for sale",
      "Living in Villa Portofino Palm Desert",
      "Luxury 55+ communities in Palm Desert"
    ],
    "slug": "villa-portofino"
  },
  {
    "id": 28,
    "name": "Whitehawk",
    "description": "Whitehawk is a peaceful gated community located in Palm Desert, CA, known for its well-maintained homes, spacious layouts, and welcoming atmosphere. The neighborhood features single-family residences with a variety of architectural styles, many offering private pools and lush landscaping. Residents can purchase a golf membership at Desert Willow Golf Resort, located just south of the community, and conveniently access it through a private golf cart gate in the south section of Whitehawk. The community also boasts lower HOA fees, adding to its appeal. Ideally situated near shopping, dining, and entertainment, including the El Paseo shopping district and top-rated schools, Whitehawk combines comfort, convenience, and affordability, making it a sought-after choice in the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20230214145418287696000000-o.jpg",
    "features": [
      "Gated community",
      "Spacious yards",
      "Quiet streets"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.7392,
      "longitude": -116.3509
    },
    "keywords": [
      "Whitehawk homes for sale",
      "Living in Whitehawk Palm Desert",
      "Gated communities in Palm Desert"
    ],
    "slug": "whitehawk"
  },
  {
    "id": 29,
    "name": "Brenna at Capri",
    "description": "Brenna at Capri is a gated community in Palm Desert, CA, featuring upscale single-family homes with spacious layouts and high-end finishes. Known for its Mediterranean-inspired architecture, the neighborhood offers residences with private pools, large yards, and mountain views. Brenna at Capri is conveniently located near top-rated schools, local parks, and premier attractions such as the Desert Willow Golf Resort and El Paseo shopping district. The community provides a quiet, family-friendly environment with no HOA fees, making it an attractive option for homeowners seeking luxury and value. With its prime location and elegant homes, Brenna at Capri is a standout neighborhood in the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1600x1200/true/20230519183015071969000000-o.jpg",
    "features": [
      "Modern homes",
      "Energy-efficient features",
      "Gated community"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.7462,
      "longitude": -116.3679
    },
    "keywords": [
      "Brenna at Capri homes for sale",
      "Living in Brenna at Capri Palm Desert",
      "Modern communities in Palm Desert"
    ],
    "slug": "brenna-at-capri"
  },
  {
    "id": 34,
    "name": "Belmonte Estates",
    "description": "Belmonte Estates is a charming community offering single-family homes with large yards and modern interiors. Known for its quiet streets and family-friendly atmosphere, it’s a favorite among locals.",
    "photo": "https://example.com/belmonte-estates.jpg",
    "features": [
      "Single-family homes",
      "Large yards",
      "Family-friendly"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.7356,
      "longitude": -116.3649
    },
    "keywords": [
      "Belmonte Estates homes for sale",
      "Living in Belmonte Estates Palm Desert",
      "Family neighborhoods in Palm Desert"
    ],
    "slug": "belmonte-estates"
  },
  {
    "id": 41,
    "name": "Villa Montego",
    "description": "Villa Montego is a tranquil community offering single-family homes with spacious layouts and private yards. Its peaceful streets and close proximity to local schools make it a great choice for families.",
    "photo": "https://example.com/villa-montego.jpg",
    "features": [
      "Single-family homes",
      "Private yards",
      "Family-friendly"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.7329,
      "longitude": -116.3702
    },
    "keywords": [
      "Villa Montego homes for sale",
      "Living in Villa Montego Palm Desert",
      "Family neighborhoods in Palm Desert"
    ],
    "slug": "villa-montego"
  },
  {
    "id": 46,
    "name": "Hacienda Del Sol",
    "description": "Hacienda Del Sol is a small, gated community featuring stylish homes with Spanish-inspired designs. The quiet atmosphere and beautiful surroundings make it a standout neighborhood.",
    "photo": "https://example.com/hacienda-del-sol.jpg",
    "features": [
      "Spanish-inspired homes",
      "Gated community",
      "Quiet atmosphere"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.7432,
      "longitude": -116.3587
    },
    "keywords": [
      "Hacienda Del Sol homes for sale",
      "Living in Hacienda Del Sol Palm Desert",
      "Spanish-style homes in Palm Desert"
    ],
    "slug": "hacienda-del-sol"
  },
  {
    "id": 49,
    "name": "Cahuilla Hills",
    "description": "Cahuilla Hills offers spacious lots and custom homes in a rural setting, perfect for buyers seeking privacy and stunning mountain views. It’s an ideal retreat close to nature.",
    "photo": "https://example.com/cahuilla-hills.jpg",
    "features": [
      "Spacious lots",
      "Custom homes",
      "Mountain views"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.703,
      "longitude": -116.407
    },
    "keywords": [
      "Cahuilla Hills homes for sale",
      "Living in Cahuilla Hills Palm Desert",
      "Custom homes in Palm Desert"
    ],
    "slug": "cahuilla-hills"
  },
  {
    "id": 52,
    "name": "Hidden Palms",
    "description": "Hidden Palms is a gated community featuring condos with access to pools, tennis courts, and walking paths. Its central location is perfect for those seeking convenience and a peaceful lifestyle.",
    "photo": "https://example.com/hidden-palms.jpg",
    "features": [
      "Gated community",
      "Community amenities",
      "Central location"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.723,
      "longitude": -116.371
    },
    "keywords": [
      "Hidden Palms homes for sale",
      "Living in Hidden Palms Palm Desert",
      "Condos in Palm Desert"
    ],
    "slug": "hidden-palms"
  },
  {
    "id": 56,
    "name": "Ironwood Heights",
    "description": "Ironwood Heights is a prestigious community nestled against the Santa Rosa Mountains, offering custom-built homes with stunning views and a private, gated setting.",
    "photo": "https://example.com/ironwood-heights.jpg",
    "features": [
      "Custom-built homes",
      "Mountain views",
      "Gated community"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.6989,
      "longitude": -116.3856
    },
    "keywords": [
      "Ironwood Heights homes for sale",
      "Living in Ironwood Heights Palm Desert",
      "Luxury homes in Palm Desert"
    ],
    "slug": "ironwood-heights"
  },
  {
    "id": 57,
    "name": "Lantana",
    "description": "Lantana is a peaceful neighborhood with modern homes and family-friendly cul-de-sacs. Residents enjoy private pools and easy access to schools and shopping.",
    "photo": "https://example.com/lantana.jpg",
    "features": [
      "Modern homes",
      "Private pools",
      "Family-friendly"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.7358,
      "longitude": -116.3741
    },
    "keywords": [
      "Lantana homes for sale",
      "Living in Lantana Palm Desert",
      "Family neighborhoods in Palm Desert"
    ],
    "slug": "lantana"
  },
  {
    "id": 63,
    "name": "Sunterrace",
    "description": "Sunterrace is a boutique gated community featuring custom homes with modern designs and private pools. Its quiet streets and lush landscaping make it a sought-after address.",
    "photo": "https://example.com/sunterrace.jpg",
    "features": [
      "Custom homes",
      "Private pools",
      "Quiet streets"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.7364,
      "longitude": -116.3672
    },
    "keywords": [
      "Sunterrace homes for sale",
      "Living in Sunterrace Palm Desert",
      "Luxury homes in Palm Desert"
    ],
    "slug": "sunterrace"
  },
  {
    "id": 64,
    "name": "The Grove",
    "description": "The Grove is a well-established neighborhood offering single-family homes with large lots and proximity to local parks and schools. It’s a perfect fit for families seeking space and convenience.",
    "photo": "https://example.com/the-grove.jpg",
    "features": [
      "Large lots",
      "Proximity to schools",
      "Family-friendly"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.7385,
      "longitude": -116.3629
    },
    "keywords": [
      "The Grove homes for sale",
      "Living in The Grove Palm Desert",
      "Family neighborhoods in Palm Desert"
    ],
    "slug": "the-grove"
  },
  {
    "id": 68,
    "name": "Oasis Country Club",
    "description": "Oasis Country Club is a gated golf community featuring condos and single-family homes with access to an executive golf course, pools, and a clubhouse for social events.",
    "photo": "https://example.com/oasis-country-club.jpg",
    "features": [
      "Gated golf community",
      "Executive golf course",
      "Clubhouse"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.7491,
      "longitude": -116.3442
    },
    "keywords": [
      "Oasis Country Club homes for sale",
      "Living in Oasis Country Club Palm Desert",
      "Golf communities in Palm Desert"
    ],
    "slug": "oasis-country-club"
  },
  {
    "id": 70,
    "name": "Shadow Mountain Golf Club",
    "description": "Shadow Mountain Golf Club is a historic community offering mid-century modern homes and condos, surrounded by lush fairways and mature landscaping. Perfect for golf enthusiasts and architecture lovers.",
    "photo": "https://example.com/shadow-mountain-golf.jpg",
    "features": [
      "Mid-century modern homes",
      "Golf course",
      "Historic community"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.7175,
      "longitude": -116.3741
    },
    "keywords": [
      "Shadow Mountain Golf Club homes for sale",
      "Living in Shadow Mountain Palm Desert",
      "Mid-century neighborhoods in Palm Desert"
    ],
    "slug": "shadow-mountain-golf-club"
  },
  {
    "id": 71,
    "name": "Palm Desert Country Club",
    "description": "Palm Desert Country Club is a classic neighborhood featuring a public golf course, affordable homes, and a welcoming community. Residents enjoy easy access to schools and shopping centers.",
    "photo": "https://example.com/palm-desert-cc.jpg",
    "features": [
      "Public golf course",
      "Affordable homes",
      "Welcoming community"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.7488,
      "longitude": -116.3617
    },
    "keywords": [
      "Palm Desert Country Club homes for sale",
      "Living in Palm Desert Country Club",
      "Affordable homes in Palm Desert"
    ],
    "slug": "palm-desert-country-club"
  },
  {
    "id": 74,
    "name": "Desert Horizons Country Club",
    "description": "Desert Horizons Country Club is a prestigious community featuring luxury homes and condos surrounding a championship golf course. Residents enjoy scenic fairways and world-class amenities.",
    "photo": "https://example.com/desert-horizons.jpg",
    "features": [
      "Luxury homes",
      "Championship golf course",
      "World-class amenities"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.7195,
      "longitude": -116.3612
    },
    "keywords": [
      "Desert Horizons Country Club homes for sale",
      "Living in Desert Horizons Palm Desert",
      "Golf communities in Palm Desert"
    ],
    "slug": "desert-horizons-country-club"
  },
  {
    "id": 76,
    "name": "The Summit",
    "description": "The Summit is an exclusive hillside community featuring custom-built homes with panoramic views of the Coachella Valley. Its tranquil setting offers luxury and privacy.",
    "photo": "https://example.com/the-summit.jpg",
    "features": [
      "Custom-built homes",
      "Panoramic views",
      "Tranquil setting"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.7034,
      "longitude": -116.4031
    },
    "keywords": [
      "The Summit homes for sale",
      "Living in The Summit Palm Desert",
      "Luxury homes in Palm Desert"
    ],
    "slug": "the-summit"
  },
  {
    "id": 78,
    "name": "Portola Country Club",
    "description": "Portola Country Club is a 55+ active adult community featuring manufactured homes, a private golf course, and a range of social activities for residents.",
    "photo": "https://example.com/portola-country-club.jpg",
    "features": [
      "55+ community",
      "Private golf course",
      "Social activities"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.7279,
      "longitude": -116.3752
    },
    "keywords": [
      "Portola Country Club homes for sale",
      "Living in Portola Country Club Palm Desert",
      "55+ communities in Palm Desert"
    ],
    "slug": "portola-country-club"
  },
  {
    "id": 81,
    "name": "Stone Eagle Golf Club",
    "description": "Stone Eagle Golf Club is a private golf club featuring a stunning Tom Doak-designed course set within the Santa Rosa and San Jacinto Mountains National Monument. Surrounded by thousands of acres of protected land, the club offers an exceptional golfing experience in a serene, natural setting.",
    "photo": "https://example.com/stone-eagle-golf-club.jpg",
    "features": [
      "Private golf club",
      "Tom Doak-designed course",
      "Mountainous terrain"
    ],
    "location": "Palm Desert, CA",
    "coordinates": {
      "latitude": 33.6945,
      "longitude": -116.4085
    },
    "keywords": [
      "Stone Eagle Golf Club membership",
      "Private golf clubs in Palm Desert",
      "Tom Doak golf courses"
    ],
    "slug": "stone-eagle-golf-club"
  }
]