[
  {
    "id": 1,
    "name": "Mirada Estates",
    "description": "Mirada Estates in Rancho Mirage, CA, is an exclusive, luxury gated community offering breathtaking desert views, spacious custom homes, and a serene lifestyle, perfect for those seeking privacy, tranquility, and modern living with access to world-class amenities such as golf courses, spas, and dining, all nestled in the heart of the Coachella Valley, making it an ideal retreat for discerning homeowners who value both comfort and sophistication in a prestigious desert location.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20240705213109702214000000-o.jpg",
    "features": [
      "Gated community",
      "Panoramic views",
      "Proximity to Ritz-Carlton"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7597,
      "longitude": -116.4078
    },
    "keywords": [
      "Mirada Estates homes for sale",
      "Living in Mirada Estates Rancho Mirage",
      "Home prices in Mirada Estates"
    ],
    "slug": "mirada-estates"
  },
  {
    "id": 2,
    "name": "Mission Ranch",
    "description": "Mission Ranch in Rancho Mirage, CA, is an upscale, gated community offering luxury living with beautifully designed homes, stunning mountain views, serene landscaping, and a prime location near world-class golf courses, shopping, dining, and entertainment, providing residents with an exceptional lifestyle of comfort, privacy, and convenience in the heart of the Coachella Valley, making it the perfect destination for those seeking a sophisticated, peaceful, and vibrant desert oasis.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20240124205612264820000000-o.jpg",
    "features": [
      "Gated community",
      "Elegant homes",
      "Close to golf courses"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7591,
      "longitude": -116.4312
    },
    "keywords": [
      "Mission Ranch homes for sale",
      "Living in Mission Ranch Rancho Mirage",
      "Home prices in Mission Ranch"
    ],
    "slug": "mission-ranch"
  },
  {
    "id": 3,
    "name": "St. Augustine",
    "description": "St. Augustine in Rancho Mirage, CA, is an exclusive and serene gated community offering luxurious, spacious homes nestled amidst lush landscapes, with breathtaking mountain views, world-class amenities including a golf course, clubhouse, and resort-style pool, all within a prime location near fine dining, shopping, and entertainment, providing residents with an exceptional lifestyle that blends tranquility with convenience in one of the most sought-after neighborhoods in the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230626174053943250000000-o.jpg",
    "features": [
      "Lakes and fountains",
      "Tennis courts",
      "Gated community"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7608,
      "longitude": -116.4284
    },
    "keywords": [
      "St. Augustine homes for sale",
      "Living in St. Augustine Rancho Mirage",
      "Home prices in St. Augustine"
    ],
    "slug": "st-augustine"
  },
  {
    "id": 4,
    "name": "Thunderbird Heights Estates",
    "description": "descThunderbird Heights Estates in Rancho Mirage, CA, offers an exclusive, serene desert lifestyle with luxurious custom homes, panoramic mountain views, and proximity to world-class golf courses, dining, shopping, and cultural attractions, making it the perfect destination for those seeking privacy, elegance, and a sophisticated, gated community in the heart of the Coachella Valley.riptions",
    "photo": null,
    "features": [
      "Historic charm",
      "Direct access to golf",
      "Luxurious homes"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7594,
      "longitude": -116.4389
    },
    "keywords": [
      "Thunderbird Heights homes for sale",
      "Living in Thunderbird Heights Rancho Mirage",
      "Home prices in Thunderbird Heights"
    ],
    "slug": "thunderbird-heights-estates"
  },
  {
    "id": 5,
    "name": "The Springs Country Club",
    "description": "The Springs Country Club in Rancho Mirage, CA, offers a luxurious, gated community with world-class amenities, including a golf course, tennis courts, a fitness center, and a clubhouse, providing residents with a serene desert lifestyle. Nestled in the Coachella Valley, this exclusive community combines breathtaking mountain views with top-tier recreational facilities, catering to those seeking a high-end living experience. A perfect blend of privacy, elegance, and access to local attractions and entertainment.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20240913161143854502000000-o.jpg",
    "features": [
      "Golf course",
      "Resort-style amenities",
      "Luxury homes"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7628,
      "longitude": -116.4143
    },
    "keywords": [
      "The Springs Country Club homes for sale",
      "Living in The Springs Rancho Mirage",
      "Home prices in The Springs"
    ],
    "slug": "the-springs-country-club"
  },
  {
    "id": 6,
    "name": "Mira Vista",
    "description": "Mira Vista in Rancho Mirage, CA, is a prestigious, gated community offering luxurious, contemporary homes with breathtaking mountain views, world-class amenities, and a prime location just minutes from the renowned Desert Willow Golf Resort, fine dining, shopping, and entertainment, making it an ideal destination for those seeking an exclusive and tranquil desert lifestyle with unparalleled comfort and convenience in one of the most desirable areas of the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230125214714944797000000-o.jpg",
    "features": [
      "Gated community",
      "Contemporary homes",
      "Mountain views"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7732,
      "longitude": -116.4158
    },
    "keywords": [
      "Mira Vista homes for sale",
      "Living in Mira Vista Rancho Mirage",
      "Home prices in Mira Vista"
    ],
    "slug": "mira-vista"
  },
  {
    "id": 7,
    "name": "Victoria Falls",
    "description": "Victoria Falls in Rancho Mirage, CA, is an exclusive, luxurious community that boasts stunning desert landscapes, meticulously designed homes, and unparalleled amenities, including resort-style pools, scenic walking trails, and private golf courses, all set against the backdrop of majestic mountain views; a perfect retreat for those seeking a blend of sophistication, tranquility, and an active lifestyle, offering easy access to world-class shopping, dining, entertainment, and recreational activities in the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20231211132722429412000000-o.jpg",
    "features": [
      "Gated community",
      "Tennis courts",
      "Elegant homes"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7635,
      "longitude": -116.4382
    },
    "keywords": [
      "Victoria Falls homes for sale",
      "Living in Victoria Falls Rancho Mirage",
      "Home prices in Victoria Falls"
    ],
    "slug": "victoria-falls"
  },
  {
    "id": 8,
    "name": "Tamarisk Country Club",
    "description": "Tamarisk Country Club in Rancho Mirage, CA, is an exclusive, renowned community offering an unparalleled living experience with luxurious homes nestled amidst lush fairways, private golf course views, and stunning desert landscapes, where residents enjoy a prestigious lifestyle with world-class amenities, including a historic golf course, tennis courts, and an active social scene, making it an ideal destination for those seeking sophistication, tranquility, and community in the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20240621160500583605000000-o.jpg",
    "features": [
      "Private golf course",
      "Historic community",
      "Luxury estates"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7681,
      "longitude": -116.4217
    },
    "keywords": [
      "Tamarisk Country Club homes for sale",
      "Living in Tamarisk Country Club Rancho Mirage",
      "Home prices in Tamarisk Country Club"
    ],
    "slug": "tamarisk-country-club"
  },
  {
    "id": 9,
    "name": "Clancy Lane",
    "description": "Clancy Lane in Rancho Mirage, CA offers an exclusive, serene community with luxurious homes nestled in a prestigious desert oasis, featuring spacious properties with panoramic mountain views, private pools, and beautiful landscaping, providing an ideal blend of tranquility, sophistication, and convenience for residents seeking a perfect balance of modern amenities and natural beauty, all within close proximity to renowned golf courses, upscale shopping, dining, and entertainment options in the heart of the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20240416234904504995000000-o.jpg",
    "features": [
      "Luxury estates",
      "Equestrian properties",
      "Prestigious address"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7602,
      "longitude": -116.4289
    },
    "keywords": [
      "Clancy Lane homes for sale",
      "Living in Clancy Lane Rancho Mirage",
      "Home prices in Clancy Lane"
    ],
    "slug": "clancy-lane"
  },
  {
    "id": 10,
    "name": "Mission Hills Country Club",
    "description": "Mission Hills Country Club in Rancho Mirage, CA, is an exclusive, gated community offering luxurious living with world-class amenities including championship golf courses, tennis courts, and a private clubhouse. Nestled in the scenic Coachella Valley, this prestigious community features stunning homes with breathtaking mountain views, elegant interiors, and a strong sense of community, perfect for those seeking a serene and upscale lifestyle in one of Southern California’s most sought-after locations.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20241010154334134067000000-o.jpg",
    "features": [
      "Golf and tennis",
      "Scenic lakes",
      "Luxury homes"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7625,
      "longitude": -116.4086
    },
    "keywords": [
      "Mission Hills homes for sale",
      "Living in Mission Hills Rancho Mirage",
      "Home prices in Mission Hills"
    ],
    "slug": "mission-hills-country-club"
  },
  {
    "id": 11,
    "name": "Sterling Estates",
    "description": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20231121213900104061000000-o.jpg",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20231121213900104061000000-o.jpg",
    "features": [
      "Custom homes",
      "Mountain views",
      "Gated community"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7695,
      "longitude": -116.4198
    },
    "keywords": [
      "Sterling Estates homes for sale",
      "Living in Sterling Estates Rancho Mirage",
      "Home prices in Sterling Estates"
    ],
    "slug": "sterling-estates"
  },
  {
    "id": 12,
    "name": "Waterford",
    "description": "The real estate community in Waterford, Rancho Mirage, CA offers a luxurious and tranquil desert oasis with stunning mountain views, expansive properties, high-end amenities, and a prime location close to world-class golf courses, shopping, dining, and cultural attractions, providing a perfect blend of privacy, elegance, and convenience for those seeking an exceptional lifestyle in one of the most sought-after areas of the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230131003435539294000000-o.jpg",
    "features": [
      "Contemporary estates",
      "Private pools",
      "Gated community"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7623,
      "longitude": -116.4225
    },
    "keywords": [
      "Waterford homes for sale",
      "Living in Waterford Rancho Mirage",
      "Home prices in Waterford"
    ],
    "slug": "waterford"
  },
  {
    "id": 13,
    "name": "Thunderbird Cove",
    "description": "Thunderbird Cove in Rancho Mirage, CA, is an exclusive, gated community offering luxurious, custom-designed homes nestled in the picturesque desert landscape, surrounded by stunning mountain views and lush greenery, providing a tranquil and private living experience with world-class amenities, including a private golf course, tennis courts, and easy access to upscale shopping, fine dining, and renowned resorts, making it an ideal destination for those seeking a blend of elegance, comfort, and serene desert living.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230119180309791734000000-o.jpg",
    "features": [
      "Gated community",
      "Luxurious homes",
      "Mountain views"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7615,
      "longitude": -116.4394
    },
    "keywords": [
      "Thunderbird Cove homes for sale",
      "Living in Thunderbird Cove Rancho Mirage",
      "Home prices in Thunderbird Cove"
    ],
    "slug": "thunderbird-cove"
  },
  {
    "id": 14,
    "name": "Ivy League Estates",
    "description": "Ivy League Estates in Rancho Mirage, CA, is an exclusive, upscale community offering luxurious, custom-built homes with stunning mountain and desert views, private amenities, and a serene atmosphere, making it an ideal location for those seeking sophisticated living, privacy, and tranquility in the heart of the Coachella Valley, while providing easy access to world-class golf courses, fine dining, shopping, and entertainment options, perfect for discerning homeowners looking for unparalleled comfort and prestige.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230908221327894965000000-o.jpg",
    "features": [
      "Gated community",
      "Classic designs",
      "Proximity to schools"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7654,
      "longitude": -116.4236
    },
    "keywords": [
      "Ivy League Estates homes for sale",
      "Living in Ivy League Estates Rancho Mirage",
      "Home prices in Ivy League Estates"
    ],
    "slug": "ivy-league-estates"
  },
  {
    "id": 15,
    "name": "The Renaissance",
    "description": "The Renaissance in Rancho Mirage, CA is a prestigious, gated community offering luxurious desert living with breathtaking mountain views, upscale amenities including a clubhouse, pool, and tennis courts, as well as spacious homes with contemporary designs, all set in a serene environment ideal for those seeking tranquility and sophistication. Residents enjoy proximity to world-class golf courses, dining, shopping, and entertainment options, making it a perfect blend of comfort, style, and convenience in the heart of the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20210311035159391961000000-o.jpg",
    "features": [
      "Custom-built homes",
      "Modern architecture",
      "Gated neighborhood"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7629,
      "longitude": -116.4213
    },
    "keywords": [
      "The Renaissance homes for sale",
      "Living in The Renaissance Rancho Mirage",
      "Home prices in The Renaissance"
    ],
    "slug": "the-renaissance"
  },
  {
    "id": 16,
    "name": "Escala",
    "description": "Escala in Rancho Mirage, CA is an exclusive, gated luxury community offering a tranquil desert oasis with stunning contemporary homes, panoramic mountain views, and world-class amenities, including a resort-style pool, fitness center, and tennis courts, providing residents with a perfect blend of privacy, modern living, and natural beauty, while being centrally located near top golf courses, shopping centers, fine dining, and entertainment options, making it an ideal place to call home for those seeking elegance and comfort.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20211013164921789347000000-o.jpg",
    "features": [
      "Estate-style homes",
      "Exclusive community",
      "Stunning designs"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7598,
      "longitude": -116.4302
    },
    "keywords": [
      "Escala homes for sale",
      "Living in Escala Rancho Mirage",
      "Home prices in Escala"
    ],
    "slug": "escala"
  },
  {
    "id": 17,
    "name": "Cypress Pointe",
    "description": "Cypress Pointe in Rancho Mirage, CA, is an exclusive, upscale gated community offering luxurious homes, scenic golf course views, resort-style amenities, and a tranquil desert atmosphere, ideal for those seeking a sophisticated yet serene living experience with easy access to nearby shopping, dining, and entertainment options, making it the perfect place to call home for those who appreciate privacy, elegance, and a vibrant lifestyle in the heart of the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20211223012251398974000000-o.jpg",
    "features": [
      "Contemporary homes",
      "Desert landscaping",
      "Quiet community"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7641,
      "longitude": -116.4257
    },
    "keywords": [
      "Cypress Pointe homes for sale",
      "Living in Cypress Pointe Rancho Mirage",
      "Home prices in Cypress Pointe"
    ],
    "slug": "cypress-pointe"
  },
  {
    "id": 18,
    "name": "The Villas of Mirada",
    "description": "The Villas of Mirada in Rancho Mirage, CA, is an exclusive, luxurious gated community offering spacious modern homes with stunning desert views, private pools, and high-end amenities. Nestled in the heart of the Coachella Valley, it provides residents with a serene and upscale lifestyle, complete with world-class golf courses, proximity to top-tier shopping, dining, and entertainment, all while maintaining a peaceful, secure, and intimate atmosphere perfect for relaxation and modern living.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20220510161124887775000000-o.jpg",
    "features": [
      "Adjacent to Ritz-Carlton",
      "Resort-style amenities",
      "Breathtaking views"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7589,
      "longitude": -116.4101
    },
    "keywords": [
      "The Villas of Mirada homes for sale",
      "Living in The Villas of Mirada Rancho Mirage",
      "Home prices in The Villas of Mirada"
    ],
    "slug": "the-villas-of-mirada"
  },
  {
    "id": 19,
    "name": "Rancho Estates",
    "description": "Nestled in the heart of the Coachella Valley, Rancho Estates in Rancho Mirage offers a luxurious and serene living experience, featuring upscale homes with stunning mountain views, spacious lawns, and private pools. The community is known for its peaceful ambiance, elegant architecture, and proximity to world-class golf courses, shopping, dining, and entertainment. Residents enjoy a lifestyle of comfort and exclusivity, making Rancho Estates an ideal place to call home in one of California’s most sought-after locations.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20210712230130403983000000-o.jpg",
    "features": [
      "Mid-century modern homes",
      "Lush surroundings",
      "Private enclave"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7632,
      "longitude": -116.4269
    },
    "keywords": [
      "Rancho Estates homes for sale",
      "Living in Rancho Estates Rancho Mirage",
      "Home prices in Rancho Estates"
    ],
    "slug": "rancho-estates"
  },
  {
    "id": 20,
    "name": "Del Webb Rancho Mirage",
    "description": "Del Webb Rancho Mirage is an active adult 55+ community located in the scenic Rancho Mirage, CA, offering resort-style living with a wide range of amenities including a clubhouse, fitness center, tennis courts, and walking trails, along with beautifully designed homes ideal for retirees seeking a vibrant lifestyle, close proximity to world-class shopping, dining, and entertainment, all within a peaceful and welcoming desert setting that fosters social engagement and an active, healthy lifestyle.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20240726190432030093000000-o.jpg",
    "features": [
      "55+ active adult community",
      "Resort-style living",
      "Social activities"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7661,
      "longitude": -116.4318
    },
    "keywords": [
      "Del Webb homes for sale",
      "Living in Del Webb Rancho Mirage",
      "Home prices in Del Webb"
    ],
    "slug": "del-webb-rancho-mirage"
  },
  {
    "id": 21,
    "name": "Santo Tomas",
    "description": "Santo Tomas in Rancho Mirage, CA, is a luxurious, gated real estate community offering breathtaking mountain views, spacious, modern homes, and a serene, upscale atmosphere with close proximity to world-class golf courses, fine dining, and shopping destinations, providing residents with a blend of tranquility and convenience in one of the most sought-after desert locales in Southern California.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20240212222840276115000000-o.jpg",
    "features": [
      "Mediterranean homes",
      "Lakefront views",
      "Gated community"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7587,
      "longitude": -116.4194
    },
    "keywords": [
      "Santo Tomas homes for sale",
      "Living in Santo Tomas Rancho Mirage",
      "Home prices in Santo Tomas"
    ],
    "slug": "santo-tomas"
  },
  {
    "id": 22,
    "name": "Casas de Seville",
    "description": "Casas de Seville in Rancho Mirage, CA, is an exclusive, serene, and picturesque gated community offering luxurious desert living with beautifully designed homes, lush landscapes, and stunning mountain views, all within close proximity to world-class golf courses, fine dining, shopping, and entertainment, providing residents a perfect blend of tranquility, convenience, and modern amenities for an exceptional lifestyle in the heart of the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230820194028364975000000-o.jpg",
    "features": [
      "Spanish-style homes",
      "Beautiful courtyards",
      "Lush landscaping"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7653,
      "longitude": -116.4241
    },
    "keywords": [
      "Casas de Seville homes for sale",
      "Living in Casas de Seville Rancho Mirage",
      "Home prices in Casas de Seville"
    ],
    "slug": "casas-de-seville"
  },
  {
    "id": 23,
    "name": "Lake Mirage",
    "description": "Lake Mirage in Rancho Mirage, CA, is an exclusive, gated community offering luxurious lakeside living with stunning mountain views, spacious homes, and resort-style amenities including tennis courts, a clubhouse, a private lake, and a pool. Residents enjoy a serene, peaceful environment, close proximity to world-class shopping, dining, and golf courses, along with easy access to the vibrant city of Palm Springs, making it an ideal destination for those seeking both tranquility and convenience in the heart of the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20210830155915686243000000-o.jpg",
    "features": [
      "Waterfront homes",
      "Private docks",
      "Lake views"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7649,
      "longitude": -116.4205
    },
    "keywords": [
      "Lake Mirage homes for sale",
      "Living in Lake Mirage Rancho Mirage",
      "Home prices in Lake Mirage"
    ],
    "slug": "lake-mirage"
  },
  {
    "id": 24,
    "name": "Morningside Country Club",
    "description": "Morningside Country Club in Rancho Mirage, CA, is an exclusive, luxury gated community offering elegant homes with breathtaking views of the San Jacinto Mountains, world-class amenities including a golf course, tennis courts, fitness center, and fine dining, providing residents with a serene desert lifestyle and close proximity to upscale shopping, dining, and entertainment, making it an ideal location for those seeking a refined, tranquil living experience in one of the Coachella Valley's most prestigious neighborhoods.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20240504235704664786000000-o.jpg",
    "features": [
      "Luxury homes",
      "Championship golf",
      "World-class amenities"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7691,
      "longitude": -116.4199
    },
    "keywords": [
      "Morningside homes for sale",
      "Living in Morningside Rancho Mirage",
      "Home prices in Morningside"
    ],
    "slug": "morningside-country-club"
  },
  {
    "id": 25,
    "name": "Villaggio on Sinatra",
    "description": "Villaggio on Sinatra in Rancho Mirage, CA, is an exclusive, gated residential community offering luxurious homes with breathtaking views of the San Jacinto Mountains, private pools, and modern amenities. Featuring Mediterranean-inspired architecture, this community is designed for those seeking tranquility, privacy, and an upscale lifestyle, with proximity to world-class golf courses, shopping, dining, and entertainment. Ideal for year-round living or seasonal retreats, Villaggio on Sinatra provides a perfect blend of comfort and elegance.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20210530165402294222000000-o.jpg",
    "features": [
      "Luxury estates",
      "Modern designs",
      "Exclusive community"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7627,
      "longitude": -116.4152
    },
    "keywords": [
      "Villaggio on Sinatra homes for sale",
      "Living in Villaggio Rancho Mirage",
      "Home prices in Villaggio"
    ],
    "slug": "villaggio-on-sinatra"
  },
  {
    "id": 27,
    "name": "Desert Island",
    "description": "Desert Island in Rancho Mirage, CA, is an exclusive, luxury real estate community offering serene desert landscapes, breathtaking mountain views, and upscale living with private golf courses, spacious estates, and world-class amenities, creating an oasis for those seeking tranquility, privacy, and exceptional quality of life in one of the most prestigious desert resort destinations in Southern California.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20231110214316113717000000-o.jpg",
    "features": [
      "Condos with lake views",
      "Private golf course",
      "Resort-style living"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7658,
      "longitude": -116.4167
    },
    "keywords": [
      "Desert Island homes for sale",
      "Living in Desert Island Rancho Mirage",
      "Home prices in Desert Island"
    ],
    "slug": "desert-island"
  },
  {
    "id": 28,
    "name": "The Club at Morningside",
    "description": "The Club at Morningside in Rancho Mirage, CA, is a prestigious, gated golf and country club community offering luxurious living with scenic mountain views, world-class amenities, including an 18-hole championship golf course, tennis courts, a clubhouse with dining options, and a state-of-the-art fitness center, all set within beautifully landscaped surroundings, providing an exclusive lifestyle for those seeking privacy, elegance, and an active, social environment in the heart of the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20220511152558233233000000-o.jpg",
    "features": [
      "Golf course",
      "Luxurious homes",
      "Active social scene"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7699,
      "longitude": -116.4191
    },
    "keywords": [
      "The Club at Morningside homes for sale",
      "Living in The Club at Morningside Rancho Mirage",
      "Home prices in The Club at Morningside"
    ],
    "slug": "the-club-at-morningside"
  },
  {
    "id": 29,
    "name": "Estilo at Rancho Mirage",
    "description": "Estilo at Rancho Mirage is an exclusive, luxurious gated community in Rancho Mirage, CA, offering elegant modern homes with breathtaking mountain views, spacious floor plans, and premium amenities, including a state-of-the-art fitness center, resort-style pool, and scenic walking trails, providing residents with a serene, upscale living experience in one of the Coachella Valley's most sought-after locations, blending tranquility, convenience, and sophistication for the ultimate desert lifestyle.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20220219202607159291000000-o.jpg",
    "features": [
      "Contemporary homes",
      "Large lots",
      "Modern interiors"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7612,
      "longitude": -116.4285
    },
    "keywords": [
      "Estilo homes for sale",
      "Living in Estilo Rancho Mirage",
      "Home prices in Estilo"
    ],
    "slug": "estilo-at-rancho-mirage"
  },
  {
    "id": 30,
    "name": "Legacy at Mission Hills",
    "description": "Legacy at Mission Hills in Rancho Mirage, CA is an exclusive, luxurious gated community offering spacious homes with stunning desert views, world-class amenities including a championship golf course, tennis courts, and a clubhouse, and an ideal location for those seeking privacy, comfort, and a resort-style living experience. Residents enjoy a peaceful, upscale atmosphere, with proximity to shopping, dining, entertainment, and the natural beauty of the Coachella Valley, making it an extraordinary place to live.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20220418222034428853000000-o.jpg",
    "features": [
      "Custom-built homes",
      "Golf access",
      "Top-tier amenities"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7594,
      "longitude": -116.4163
    },
    "keywords": [
      "Legacy homes for sale",
      "Living in Legacy Rancho Mirage",
      "Home prices in Legacy Mission Hills"
    ],
    "slug": "legacy-at-mission-hills"
  },
  {
    "id": 31,
    "name": "The Estates at Rancho Mirage",
    "description": "The Estates at Rancho Mirage in Rancho Mirage, CA, is an exclusive, gated community offering luxurious, contemporary homes with expansive floor plans, premium amenities, and breathtaking mountain views, designed for those seeking privacy, tranquility, and an exceptional living experience in the heart of the Coachella Valley, with easy access to world-class golf courses, fine dining, shopping, and entertainment, making it an ideal destination for discerning residents and seasonal homeowners alike.",
    "photo": null,
    "features": [
      "Elegant homes",
      "Mountain views",
      "Gated community"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7671,
      "longitude": -116.4214
    },
    "keywords": [
      "The Estates homes for sale",
      "Living in The Estates Rancho Mirage",
      "Home prices in The Estates"
    ],
    "slug": "the-estates-at-rancho-mirage"
  },
  {
    "id": 32,
    "name": "Coronado Rancho Mirage",
    "description": "Coronado Rancho Mirage is an upscale, gated community in Rancho Mirage, CA, offering luxurious desert living with stunning mountain views, meticulously landscaped grounds, and high-end amenities. Residents enjoy a serene and private atmosphere, with spacious homes featuring modern designs and private pools. The community is ideally located near world-class golf courses, shopping, dining, and entertainment options, providing a perfect blend of relaxation and convenience in the heart of the Coachella Valley.",
    "photo": null,
    "features": [
      "Luxury homes",
      "Private pools",
      "Exclusive community"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7659,
      "longitude": -116.4252
    },
    "keywords": [
      "Coronado homes for sale",
      "Living in Coronado Rancho Mirage",
      "Home prices in Coronado"
    ],
    "slug": "coronado-rancho-mirage"
  },
  {
    "id": 33,
    "name": "Rancho Paloma",
    "description": "Rancho Paloma in Rancho Mirage, CA is an exclusive, serene gated community offering luxurious homes with breathtaking mountain views, surrounded by lush landscapes and world-class amenities, perfect for those seeking a peaceful, upscale lifestyle with easy access to top-tier golf courses, dining, shopping, and entertainment, all within close proximity to major transportation routes and the vibrant desert city life, making it an ideal place for relaxation and sophisticated living.",
    "photo": null,
    "features": [
      "Charming homes",
      "Beautiful landscaping",
      "Central location"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7685,
      "longitude": -116.4173
    },
    "keywords": [
      "Rancho Paloma homes for sale",
      "Living in Rancho Paloma Rancho Mirage",
      "Home prices in Rancho Paloma"
    ],
    "slug": "rancho-paloma"
  },
  {
    "id": 34,
    "name": "Versailles",
    "description": "Versailles in Rancho Mirage, CA, is an exclusive, luxurious gated community offering stunning Mediterranean-inspired estates with expansive desert and mountain views, meticulously manicured landscapes, and world-class amenities, providing residents a serene, private, and sophisticated lifestyle ideal for those seeking elegance and tranquility in one of the most desirable locations in the Coachella Valley, just minutes away from golf courses, upscale dining, shopping, and entertainment options, creating a perfect desert retreat.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20210411171428087987000000-o.jpg",
    "features": [
      "Mediterranean-style homes",
      "Elegant designs",
      "Gated community"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7667,
      "longitude": -116.4267
    },
    "keywords": [
      "Versailles homes for sale",
      "Living in Versailles Rancho Mirage",
      "Home prices in Versailles"
    ],
    "slug": "versailles"
  },
  {
    "id": 35,
    "name": "The Reserve",
    "description": "The Reserve in Rancho Mirage, CA, is an exclusive, luxury gated community offering breathtaking desert views, world-class amenities, and custom-built estates, providing residents with the ultimate blend of privacy, comfort, and sophistication. With its pristine golf courses, tranquil surroundings, and exceptional service, The Reserve is a premier destination for those seeking a serene and opulent lifestyle in one of the most desirable locations in the Coachella Valley, close to shopping, dining, and entertainment options.",
    "photo": null,
    "features": [
      "Golf community",
      "Luxurious homes",
      "Private club amenities"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7622,
      "longitude": -116.4139
    },
    "keywords": [
      "The Reserve homes for sale",
      "Living in The Reserve Rancho Mirage",
      "Home prices in The Reserve"
    ],
    "slug": "the-reserve"
  },
  {
    "id": 36,
    "name": "Rancho Mirage Country Club",
    "description": "Rancho Mirage Country Club in Rancho Mirage, CA, offers a prestigious and serene community with lush landscapes, world-class amenities, and stunning golf course views, providing residents with an exclusive and luxurious living experience. Nestled in the heart of the Coachella Valley, the community features beautifully designed homes, top-notch facilities including tennis courts, a clubhouse, and swimming pools, and is conveniently located near shopping, dining, and entertainment, making it the perfect place for relaxation and recreation.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20241123001159027922000000-o.jpg",
    "features": [
      "Private golf course",
      "Clubhouse amenities",
      "Luxury condos"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.765,
      "longitude": -116.4238
    },
    "keywords": [
      "Rancho Mirage Country Club homes for sale",
      "Living in Rancho Mirage Country Club",
      "Home prices in Rancho Mirage Country Club"
    ],
    "slug": "rancho-mirage-country-club"
  },
  {
    "id": 37,
    "name": "The Renaissance at Clancy Lane",
    "description": "The Renaissance at Clancy Lane in Rancho Mirage, CA, is an exclusive, luxury community offering spacious, modern homes with stunning desert and mountain views, a peaceful atmosphere, and access to resort-style amenities, including a clubhouse, pool, spa, and fitness center, while being conveniently located near golf courses, shopping centers, and fine dining, making it an ideal retreat for those seeking a sophisticated desert lifestyle in one of the Coachella Valley's most prestigious neighborhoods.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230119232736663523000000-o.jpg",
    "features": [
      "Custom luxury homes",
      "Gated community",
      "Tranquil setting"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7614,
      "longitude": -116.4279
    },
    "keywords": [
      "Renaissance at Clancy Lane homes for sale",
      "Living in The Renaissance Rancho Mirage",
      "Home prices in The Renaissance"
    ],
    "slug": "the-renaissance-at-clancy-lane"
  },
  {
    "id": 38,
    "name": "Alicante Rancho Mirage",
    "description": "Alicante Rancho Mirage offers an exclusive, luxury living experience in the heart of the Coachella Valley, where modern elegance meets desert tranquility. This gated community features stunning Spanish-style homes with expansive floor plans, private pools, and breathtaking mountain views. Residents enjoy world-class amenities including a clubhouse, fitness center, and tennis courts, all within close proximity to upscale shopping, dining, and golf courses, making it the ideal location for those seeking a serene yet vibrant lifestyle.",
    "photo": null,
    "features": [
      "Contemporary homes",
      "Private outdoor spaces",
      "Boutique community"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7638,
      "longitude": -116.4182
    },
    "keywords": [
      "Alicante Rancho Mirage homes for sale",
      "Living in Alicante Rancho Mirage",
      "Home prices in Alicante Rancho Mirage"
    ],
    "slug": "alicante-rancho-mirage"
  },
  {
    "id": 39,
    "name": "Ivy League Estates",
    "description": "Ivy League Estates in Rancho Mirage, CA, is an exclusive, luxury community offering expansive, beautifully designed homes nestled against stunning mountain views, providing residents with a private oasis of peace, security, and comfort, complemented by world-class amenities including a championship golf course, upscale shopping, fine dining, and proximity to renowned cultural attractions, making it the perfect destination for those seeking elegance, tranquility, and a refined lifestyle in the heart of the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20210403201156438617000000-o.jpg",
    "features": [
      "Gated community",
      "Classic designs",
      "Lush landscaping"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7654,
      "longitude": -116.4236
    },
    "keywords": [
      "Ivy League Estates homes for sale",
      "Living in Ivy League Estates Rancho Mirage",
      "Home prices in Ivy League Estates"
    ],
    "slug": "ivy-league-estates"
  },
  {
    "id": 40,
    "name": "Los Cocos",
    "description": "Los Cocos in Rancho Mirage, CA, is an upscale, serene, and beautifully landscaped community offering luxurious living with stunning desert views, exclusive amenities including golf courses, pools, and fitness centers, and a close proximity to world-class dining, shopping, and entertainment in the Coachella Valley, making it an ideal destination for those seeking both relaxation and an active lifestyle in a prestigious location surrounded by natural beauty and tranquility.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230427173048695629000000-o.jpg",
    "features": [
      "Private patios",
      "Community pool",
      "Tennis courts"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7631,
      "longitude": -116.4247
    },
    "keywords": [
      "Los Cocos homes for sale",
      "Living in Los Cocos Rancho Mirage",
      "Home prices in Los Cocos"
    ],
    "slug": "los-cocos"
  },
  {
    "id": 41,
    "name": "The Villas of Mirada",
    "description": "The Villas of Mirada in Rancho Mirage, CA, is an exclusive, luxury residential community offering stunning modern homes with breathtaking mountain views, world-class amenities, and a serene desert atmosphere, providing residents with ultimate privacy, upscale living, and an unparalleled lifestyle. This gated community features spacious homes, beautifully landscaped grounds, private pools, fitness centers, and easy access to top golf courses, fine dining, and entertainment, making it the perfect retreat for those seeking comfort and sophistication.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230103220022088661000000-o.jpg",
    "features": [
      "Resort-style living",
      "Luxurious homes",
      "Proximity to Ritz-Carlton"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7589,
      "longitude": -116.4101
    },
    "keywords": [
      "The Villas of Mirada homes for sale",
      "Living in Villas of Mirada Rancho Mirage",
      "Home prices in Villas of Mirada"
    ],
    "slug": "the-villas-of-mirada"
  },
  {
    "id": 42,
    "name": "Villaggio on Sinatra",
    "description": "Villaggio on Sinatra in Rancho Mirage, CA is an exclusive gated community offering luxurious, modern homes with breathtaking mountain views, spacious layouts, private pools, and top-tier amenities, all within close proximity to world-class golf courses, shopping, dining, and entertainment, providing residents with a serene and sophisticated desert lifestyle in one of the most desirable areas of the Coachella Valley.",
    "photo": null,
    "features": [
      "Luxury estates",
      "Spacious layouts",
      "Modern designs"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7627,
      "longitude": -116.4152
    },
    "keywords": [
      "Villaggio on Sinatra homes for sale",
      "Living in Villaggio Rancho Mirage",
      "Home prices in Villaggio"
    ],
    "slug": "villaggio-on-sinatra"
  },
  {
    "id": 43,
    "name": "The Estates at Rancho Mirage",
    "description": "The Estates at Rancho Mirage in Rancho Mirage, CA, is an exclusive, upscale residential community offering luxurious homes with stunning desert views, expansive private estates, and world-class amenities, providing a serene and sophisticated lifestyle in the heart of the Coachella Valley, with close proximity to renowned golf courses, fine dining, high-end shopping, and vibrant cultural attractions, making it the ideal destination for those seeking privacy, comfort, and modern elegance in a desert oasis.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20220325140915109122000000-o.jpg",
    "features": [
      "Elegant designs",
      "Gated community",
      "Breathtaking views"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7671,
      "longitude": -116.4214
    },
    "keywords": [
      "The Estates at Rancho Mirage homes for sale",
      "Living in The Estates Rancho Mirage",
      "Home prices in The Estates"
    ],
    "slug": "the-estates-at-rancho-mirage"
  },
  {
    "id": 44,
    "name": "Thunderbird Villas",
    "description": "Thunderbird Villas in Rancho Mirage, CA, offers an exclusive, serene, and luxurious community of upscale homes surrounded by breathtaking desert landscapes, with world-class amenities such as golf courses, tennis courts, and private pools, all designed for the ultimate comfort and relaxation. This sought-after neighborhood provides a perfect blend of privacy, elegance, and convenience, making it ideal for those seeking a tranquil yet sophisticated lifestyle in the heart of the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20210930204316389091000000-o.jpg",
    "features": [
      "Mid-century modern homes",
      "Stunning views",
      "Close to Thunderbird Country Club"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7601,
      "longitude": -116.4352
    },
    "keywords": [
      "Thunderbird Villas homes for sale",
      "Living in Thunderbird Villas Rancho Mirage",
      "Home prices in Thunderbird Villas"
    ],
    "slug": "thunderbird-villas"
  },
  {
    "id": 45,
    "name": "Versailles",
    "description": "Versailles Mirage, CA, offers an exclusive and tranquil residential experience nestled amidst scenic views, with luxury homes featuring spacious interiors, modern amenities, and private outdoor spaces. The community is renowned for its serene atmosphere, providing residents with a perfect blend of comfort and sophistication. With convenient access to nearby shopping, dining, and entertainment options, Versailles Mirage is an ideal place to live for those seeking an upscale, peaceful lifestyle in the heart of California.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20210209083304788581000000-o.jpg",
    "features": [
      "Mediterranean-style homes",
      "Elegant designs",
      "Gated community"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7645,
      "longitude": -116.4302
    },
    "keywords": [
      "Versailles homes for sale",
      "Living in Versailles Rancho Mirage",
      "Home prices in Versailles"
    ],
    "slug": "versailles"
  },
  {
    "id": 46,
    "name": "The Springs Country Club",
    "description": "The Springs Country Club in Rancho Mirage, CA, offers an exclusive, gated community surrounded by scenic mountain views, boasting luxurious homes, world-class golf courses, tennis courts, a state-of-the-art fitness center, and a vibrant social atmosphere, making it an ideal haven for those seeking a sophisticated desert lifestyle with a rich blend of relaxation and recreation, all within close proximity to upscale dining, shopping, and entertainment venues in the heart of the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20210302035521748240000000-o.jpg",
    "features": [
      "Golf course",
      "World-class amenities",
      "Vibrant social scene"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.763,
      "longitude": -116.4175
    },
    "keywords": [
      "The Springs Country Club homes for sale",
      "Living in The Springs Rancho Mirage",
      "Home prices in The Springs"
    ],
    "slug": "the-springs-country-club"
  },
  {
    "id": 47,
    "name": "Del Webb Rancho Mirage",
    "description": "Del Webb Rancho Mirage is an active adult 55+ community located in Rancho Mirage, CA, offering resort-style living with stunning mountain views, a variety of recreational amenities, and beautifully designed homes. Residents enjoy a vibrant social atmosphere with golf courses, walking trails, fitness centers, and pools, alongside a clubhouse for gatherings and activities. The community is perfect for those seeking an active lifestyle in a serene, gated environment surrounded by the beauty of the desert.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20240726190401362345000000-o.jpg",
    "features": [
      "55+ community",
      "Resort-style amenities",
      "Social activities"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7672,
      "longitude": -116.4227
    },
    "keywords": [
      "Del Webb homes for sale",
      "Living in Del Webb Rancho Mirage",
      "Home prices in Del Webb"
    ],
    "slug": "del-webb-rancho-mirage"
  },
  {
    "id": 48,
    "name": "Thunderbird Heights",
    "description": "Nestled in the heart of the Coachella Valley, Rancho Mirage offers an exclusive community with breathtaking panoramic views of the majestic San Jacinto Mountains, sweeping desert landscapes, and lush fairways, providing an oasis of tranquility and luxury living. With world-class golf courses, elegant resorts, and upscale amenities, this prestigious location is perfect for those seeking an unparalleled lifestyle surrounded by nature's beauty and an abundance of year-round sunshine.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20240703010536179782000000-o.jpg",
    "features": [
      "Luxury homes",
      "Breathtaking views",
      "Historic neighborhood"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7583,
      "longitude": -116.4296
    },
    "keywords": [
      "Thunderbird Heights homes for sale",
      "Living in Thunderbird Heights Rancho Mirage",
      "Home prices in Thunderbird Heights"
    ],
    "slug": "thunderbird-heights"
  },
  {
    "id": 49,
    "name": "Mira Vista",
    "description": "Mira Vista in Rancho Mirage, CA, is an exclusive, upscale community offering luxurious homes with stunning mountain and golf course views, exceptional amenities, and a tranquil atmosphere, perfect for those seeking privacy, elegance, and a resort-style living experience. Nestled in the heart of the Coachella Valley, Mira Vista combines timeless architectural beauty with modern comforts, providing residents with access to fine dining, shopping, and world-class recreational activities, making it the ideal destination for affluent buyers.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20231208034128157558000000-o.jpg",
    "features": [
      "Modern homes",
      "Community amenities",
      "Gated community"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7658,
      "longitude": -116.4185
    },
    "keywords": [
      "Mira Vista homes for sale",
      "Living in Mira Vista Rancho Mirage",
      "Home prices in Mira Vista"
    ],
    "slug": "mira-vista"
  },
  {
    "id": 50,
    "name": "Lake Mirage Racquet Club",
    "description": "Lake Mirage Racquet Club in Rancho Mirage, CA, is a prestigious gated community featuring 238 residences nestled around a scenic 24-acre lake, offering a tranquil lifestyle with resort-like amenities, including 11 tennis courts, 10 pools, and spas, a clubhouse with fitness facilities, a racquetball court, and a vibrant social calendar; it is an ideal destination for active living and serene luxury, with picturesque surroundings, easy access to local attractions, and a welcoming atmosphere for all residents.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230903015731822235000000-o.jpg",
    "features": [
      "Waterfront living",
      "Tennis courts",
      "Lush landscaping"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7639,
      "longitude": -116.4261
    },
    "keywords": [
      "Lake Mirage homes for sale",
      "Living in Lake Mirage Rancho Mirage",
      "Home prices in Lake Mirage"
    ],
    "slug": "lake-mirage-racquet-club"
  },
  {
    "id": 51,
    "name": "Mission Hills Country Club",
    "description": "Mission Hills Country Club in Rancho Mirage, CA, is a prestigious and vibrant community known for its luxurious homes, world-class amenities, and breathtaking views of the San Jacinto Mountains, offering an unparalleled lifestyle with championship golf courses, tennis courts, a state-of-the-art fitness center, fine dining, and an active social scene, making it an ideal destination for those seeking a blend of elegance, recreation, and relaxation in the heart of the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230811232303855807000000-o.jpg",
    "features": [
      "Championship golf",
      "Tennis courts",
      "Luxury homes"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7605,
      "longitude": -116.4172
    },
    "keywords": [
      "Mission Hills homes for sale",
      "Living in Mission Hills Rancho Mirage",
      "Home prices in Mission Hills"
    ],
    "slug": "mission-hills-country-club"
  },
  {
    "id": 52,
    "name": "Clancy Lane Estates",
    "description": "Clancy Lane Estates in Rancho Mirage, CA, is a prestigious and exclusive gated community renowned for its luxurious estates, expansive lots, and stunning mountain views. Nestled in the heart of the Coachella Valley, it offers residents an unparalleled blend of privacy, sophistication, and convenience, with close proximity to upscale shopping, fine dining, world-class golf courses, and cultural attractions. This serene enclave embodies desert elegance, attracting discerning buyers seeking a tranquil yet vibrant lifestyle.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20221028193019362033000000-o.jpg",
    "features": [
      "Equestrian facilities",
      "Luxury estates",
      "Prestigious address"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7624,
      "longitude": -116.4249
    },
    "keywords": [
      "Clancy Lane Estates homes for sale",
      "Living in Clancy Lane Rancho Mirage",
      "Home prices in Clancy Lane Estates"
    ],
    "slug": "clancy-lane-estates"
  },
  {
    "id": 53,
    "name": "Tuscany",
    "description": "Nestled in the heart of Rancho Mirage, California, Tuscany is a premier gated community offering a blend of serene desert living and Mediterranean-inspired charm, featuring elegant single-family homes with modern amenities, lush landscapes, walking trails, and a private park, all set against the stunning backdrop of the Santa Rosa Mountains, providing residents with a tranquil yet sophisticated lifestyle, conveniently located near shopping, dining, golf courses, and world-class entertainment venues.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20240228181329612230000000-o.jpg",
    "features": [
      "Tuscan-inspired homes",
      "Community pool",
      "Tranquil atmosphere"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.764,
      "longitude": -116.4218
    },
    "keywords": [
      "Tuscany homes for sale",
      "Living in Tuscany Rancho Mirage",
      "Home prices in Tuscany"
    ],
    "slug": "tuscany"
  },
  {
    "id": 54,
    "name": "Las Palmas Heights",
    "description": "Las Palmas Heights in Rancho Mirage, CA, is a prestigious real estate community renowned for its luxurious homes, breathtaking desert views, and proximity to world-class golf courses, fine dining, and high-end shopping, offering a sophisticated lifestyle amidst the natural beauty of the Coachella Valley. With meticulously designed properties, scenic mountain backdrops, and a tranquil ambiance, it provides an unparalleled living experience, blending exclusivity with accessibility to vibrant cultural and recreational amenities.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20201214200731224942000000-o.jpg",
    "features": [
      "Luxury homes",
      "Panoramic views",
      "Gated community"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7627,
      "longitude": -116.4259
    },
    "keywords": [
      "Las Palmas Heights homes for sale",
      "Living in Las Palmas Heights Rancho Mirage",
      "Home prices in Las Palmas Heights"
    ],
    "slug": "las-palmas-heights"
  },
  {
    "id": 55,
    "name": "Ivy League Estates",
    "description": "Ivy League Estates in Rancho Mirage, CA, is an exclusive gated community offering luxurious residences with stunning architectural designs, nestled in the heart of the Coachella Valley; this upscale neighborhood provides a serene oasis with meticulously landscaped grounds, private pools, tennis courts, and close proximity to world-class golf courses, fine dining, premier shopping, and renowned cultural attractions, making it a perfect blend of elegance, privacy, and convenience for discerning homeowners.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20240210181751025732000000-o.jpg",
    "features": [
      "Gated community",
      "Spacious homes",
      "Lush greenery"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7653,
      "longitude": -116.4232
    },
    "keywords": [
      "Ivy League Estates homes for sale",
      "Living in Ivy League Estates Rancho Mirage",
      "Home prices in Ivy League Estates"
    ],
    "slug": "ivy-league-estates"
  },
  {
    "id": 56,
    "name": "Cielo",
    "description": "Cielo in Rancho Mirage, CA, is a prestigious real estate community renowned for its luxurious desert lifestyle, featuring a stunning array of modern and Mediterranean-inspired homes, panoramic views of the Coachella Valley, and proximity to world-class amenities such as golf courses, shopping, fine dining, and cultural attractions, making it an ideal destination for those seeking sophistication, comfort, and exclusivity in the heart of the California desert.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230804154029455803000000-o.jpg",
    "features": [
      "Modern homes",
      "Desert views",
      "Exclusive community"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7604,
      "longitude": -116.4247
    },
    "keywords": [
      "Cielo homes for sale",
      "Living in Cielo Rancho Mirage",
      "Home prices in Cielo"
    ],
    "slug": "cielo"
  },
  {
    "id": 57,
    "name": "Sunrise Country Club",
    "description": "Sunrise Country Club in Rancho Mirage, CA, offers a premier real estate community nestled in the heart of Coachella Valley, boasting over 700 homes with lush landscaping, 21 pools and spas, an 18-hole executive golf course, 13 tennis courts, and pickleball facilities. Residents enjoy a vibrant lifestyle with a clubhouse, dining options, fitness center, and social events, all set against the backdrop of stunning mountain views, creating an ideal blend of luxury, leisure, and community living.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20230523051310508573000000-o.jpg",
    "features": [
      "Golf community",
      "Scenic landscapes",
      "Active lifestyle"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7621,
      "longitude": -116.4184
    },
    "keywords": [
      "Sunrise Country Club homes for sale",
      "Living in Sunrise Country Club Rancho Mirage",
      "Home prices in Sunrise Country Club"
    ],
    "slug": "sunrise-country-club"
  },
  {
    "id": 58,
    "name": "Mission Shores",
    "description": "Mission Shores in Rancho Mirage, CA, is a vibrant, gated lakefront community offering a luxurious lifestyle with stunning mountain views, modern homes, and beautifully landscaped surroundings. This prestigious neighborhood features spacious residences with contemporary designs, premium amenities, and a serene environment perfect for families or individuals seeking tranquility. Residents enjoy private lakeside access, proximity to golf courses, shopping, dining, and the vibrant culture of the Coachella Valley.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20231116044513152081000000-o.jpg",
    "features": [
      "Lakeside living",
      "Private docks",
      "Water views"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7599,
      "longitude": -116.426
    },
    "keywords": [
      "Mission Shores homes for sale",
      "Living in Mission Shores Rancho Mirage",
      "Home prices in Mission Shores"
    ],
    "slug": "mission-shores"
  },
  {
    "id": 59,
    "name": "Monte Sereno",
    "description": "Monte Sereno in Rancho Mirage, CA, is an exclusive, gated luxury community known for its stunning desert landscapes, architecturally distinctive homes, and proximity to world-class golf courses, dining, and shopping. Nestled in the heart of the Coachella Valley, this prestigious enclave offers serene living with breathtaking mountain views, impeccably maintained grounds, and an array of amenities, making it a sought-after destination for discerning homeowners seeking privacy, elegance, and comfort.",
    "photo": null,
    "features": [
      "Custom estates",
      "Privacy",
      "Mountain views"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7586,
      "longitude": -116.4223
    },
    "keywords": [
      "Monte Sereno homes for sale",
      "Living in Monte Sereno Rancho Mirage",
      "Home prices in Monte Sereno"
    ],
    "slug": "monte-sereno"
  },
  {
    "id": 60,
    "name": "Victoria Falls",
    "description": "Nestled in the heart of Rancho Mirage, CA, Victoria Falls is an exclusive, luxurious community offering stunning desert landscapes, spacious custom homes, and world-class amenities, including a golf course, clubhouses, and expansive private pools, all set against the breathtaking backdrop of the San Jacinto Mountains, providing residents with both tranquility and an unparalleled lifestyle, ideal for those seeking sophisticated living in a serene desert oasis.",
    "photo": "https://cdn.resize.sparkplatform.com/gps/1280x1024/true/20210610190452109042000000-o.jpg",
    "features": [
      "Gated community",
      "Tennis courts",
      "Spacious homes"
    ],
    "location": "Rancho Mirage, CA",
    "coordinates": {
      "latitude": 33.7649,
      "longitude": -116.4287
    },
    "keywords": [
      "Victoria Falls homes for sale",
      "Living in Victoria Falls Rancho Mirage",
      "Home prices in Victoria Falls"
    ],
    "slug": "victoria-falls"
  }
]